Repository: kelvin5290/openedx-translations
Catalog: translations/xblock-free-text-response/freetextresponse/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Display Correctness?
ms_my: Ketepatan Paparan?

source: This is a flag that indicates if the indicator icon should be displayed after a student enters their response
ms_my: Ini ialah bendera yang menunjukkan jika ikon penunjuk perlu dipaparkan selepas pelajar memasukkan respons mereka

source: Display Other Student Responses
ms_my: Paparkan Jawapan Pelajar Lain

source: This will display other student responses to the student after they submit their response.
ms_my: Ini akan memaparkan respons pelajar lain kepada pelajar selepas mereka menyerahkan respons mereka.

source: System selected answers to give to students
ms_my: Sistem jawapan yang dipilih untuk diberikan kepada pelajar

source: Display Name
ms_my: Nama Paparan

source: This is the title for this question type
ms_my: Ini adalah tajuk untuk jenis soalan ini

source: Full-Credit Key Phrases
ms_my: Frasa Utama Kredit Penuh

source: This is a list of words or phrases, one of which must be present in order for the student's answer to receive full credit
ms_my: Ini ialah senarai perkataan atau frasa, salah satu daripadanya mesti ada agar jawapan pelajar mendapat kredit penuh

source: Half-Credit Key Phrases
ms_my: Frasa Utama Separuh Kredit

source: This is a list of words or phrases, one of which must be present in order for the student's answer to receive half credit
ms_my: Ini ialah senarai perkataan atau frasa, salah satunya mesti ada agar jawapan pelajar mendapat separuh kredit

source: Maximum Number of Attempts
ms_my: Bilangan Maksimum Percubaan

source: This is the maximum number of times a student is allowed to attempt the problem
ms_my: Ini ialah bilangan maksimum kali pelajar dibenarkan mencuba masalah tersebut

source: Maximum Word Count
ms_my: Bilangan Perkataan Maksimum

source: This is the maximum number of words allowed for this question
ms_my: Ini ialah bilangan maksimum perkataan yang dibenarkan untuk soalan ini

source: Minimum Word Count
ms_my: Bilangan Perkataan Minimum

source: This is the minimum number of words required for this question
ms_my: Ini ialah bilangan perkataan minimum yang diperlukan untuk soalan ini

source: This is the prompt students will see when asked to enter their response
ms_my: Ini adalah gesaan yang akan pelajar lihat apabila diminta untuk memasukkan respons mereka

source: Submission Received Message
ms_my: Penyerahan Mesej Diterima

source: This is the message students will see upon submitting their response
ms_my: Ini adalah mesej yang pelajar akan lihat apabila menghantar jawapan mereka

source: Weight
ms_my: Berat badan

source: This assigns an integer value representing the weight of this problem
ms_my: Ini memberikan nilai integer yang mewakili berat masalah ini

source: Draft Received Message
ms_my: Draf Mesej Diterima

source: This is the message students will see upon submitting a draft response
ms_my: Ini adalah mesej yang akan pelajar lihat apabila menyerahkan draf respons

source: Allow my response to possibly be visible by other learners after submitting their response
ms_my: Benarkan respons saya mungkin dapat dilihat oleh pelajar lain selepas menyerahkan respons mereka

source: Checking...
ms_my: Menyemak...

source: Submit
ms_my: Hantar

source: Save
ms_my: Jimat

source: Hide
ms_my: Sembunyi

source: Show
ms_my: Tunjukkan

source: peer responses
ms_my: tindak balas rakan sebaya

source: Submissions by others
ms_my: Penyerahan oleh orang lain

source: No responses to show at this time
ms_my: Tiada respons untuk ditunjukkan pada masa ini

source: {weight} point possible
ms_my: {weight} mata mungkin

source: {score_string}/{weight} point
ms_my: {Score_string}/{weight} mata

source: You have used {count_attempts} of {max_attempts} submission
ms_my: Anda telah menggunakan {count_attempts} daripada {max_attempts} penyerahan

source: Your response must be between {min} and {max} word.
ms_my: Respons anda mestilah antara {min} dan {max} perkataan.

source: Invalid Word Count. {word_count_message}
ms_my: Kiraan Perkataan Tidak Sah. {word_count_message}
