Repository: kelvin5290/openedx-translations
Catalog: translations/edx-ora2/openassessment/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: This section could not be loaded.
ms_my: Bahagian ini tidak dapat dimuatkan.

source: The staff assessment form could not be loaded.
ms_my: Borang penilaian kakitangan tidak dapat dimuatkan.

source: The display of ungraded and checked out responses could not be loaded.
ms_my: Paparan jawapan yang tidak digred dan didaftar keluar tidak dapat dimuatkan.

source: This response could not be submitted.
ms_my: Jawapan ini tidak dapat diserahkan.

source: The submission could not be reset.
ms_my: Penyerahan tidak dapat ditetapkan semula.

source: Please check your internet connection.
ms_my: Sila semak sambungan internet anda.

source: This feedback could not be submitted.
ms_my: Maklum balas ini tidak dapat diserahkan.

source: This assessment could not be submitted.
ms_my: Penilaian ini tidak dapat diserahkan.

source: One or more rescheduling tasks failed.
ms_my: Satu atau lebih tugas penjadualan semula gagal.

source: This problem could not be saved.
ms_my: Masalah ini tidak dapat disimpan.

source: The server could not be contacted.
ms_my: Pelayan tidak dapat dihubungi.

source: Could not retrieve upload url.
ms_my: Tidak dapat mendapatkan semula url muat naik.

source: Server error.
ms_my: Ralat pelayan

source: Could not retrieve download url.
ms_my: Tidak dapat mendapatkan semula url muat turun.

source: The submission could not be removed from the grading pool.
ms_my: Penyerahan tidak dapat dialih keluar daripada kumpulan penggredan.

source: Multiple teams returned for course
ms_my: Beberapa pasukan kembali ke kursus

source: Could not load teams information.
ms_my: Tidak dapat memuatkan maklumat pasukan.

source: User lookup failed
ms_my: Carian pengguna gagal

source: Error when looking up username
ms_my: Ralat semasa mencari nama pengguna

source: Failed to clone rubric
ms_my: Gagal mengklon rubrik

source: View and grade responses
ms_my: Lihat dan gred respons

source: Demo the new Grading Experience
ms_my: Tunjukkan Pengalaman Penggredan baharu

source: Unit Name
ms_my: Nama Unit

source: Units
ms_my: Unit

source: Assessment
ms_my: Penilaian

source: Assessments
ms_my: Penilaian

source: Total Responses
ms_my: Jumlah Jawapan

source: Training
ms_my: Latihan

source: Peer
ms_my: Rakan sebaya

source: Self
ms_my: Diri sendiri

source: Waiting
ms_my: Menunggu

source: Staff
ms_my: Kakitangan

source: Final Grade Received
ms_my: Gred Akhir Diterima

source: Staff Grader
ms_my: Penggred Kakitangan

source: List of Open Assessments is unavailable
ms_my: Senarai Penilaian Terbuka tidak tersedia

source: Please wait
ms_my: Sila tunggu

source: Block view is unavailable
ms_my: Pandangan sekat tidak tersedia

source: Back to Full List
ms_my: Kembali ke Senarai Penuh

source: Confirm
ms_my: sahkan

source: Cancel
ms_my: Batal

source: Cannot submit empty response even everything is optional.
ms_my: Tidak boleh menghantar jawapan kosong walaupun semuanya adalah pilihan.

source: Please upload a file.
ms_my: Sila muat naik fail.

source: Please provide a response.
ms_my: Sila berikan jawapan.

source: No files selected for upload.
ms_my: Tiada fail dipilih untuk dimuat naik.

source: Please provide a description for each file you are uploading.
ms_my: Sila berikan penerangan untuk setiap fail yang anda muat naik.

source: Your file has been deleted or path has been changed:
ms_my: Fail anda telah dipadamkan atau laluan telah ditukar:

source: Saving draft
ms_my: Menyimpan draf

source: If you leave this page without saving or submitting your response, you will lose any work you have done on the response.
ms_my: Jika anda meninggalkan halaman ini tanpa menyimpan atau menyerahkan respons anda, anda akan kehilangan sebarang kerja yang telah anda lakukan pada respons.

source: Saving draft...
ms_my: Menyimpan draf...

source: Draft saved!
ms_my: Draf disimpan!

source: Error
ms_my: Ralat

source: Confirm Submit Response
ms_my: Sahkan Hantar Respons

source: You're about to submit your response for this assignment. After you submit this response, you may have a limited time to resubmit before your submission is graded.
ms_my: Anda akan menyerahkan jawapan anda untuk tugasan ini. Selepas anda menyerahkan respons ini, anda mungkin mempunyai masa terhad untuk menyerahkan semula sebelum penyerahan anda digredkan.

source: You're about to submit your response for this assignment. After you submit this response, you can't change it or submit a new response.
ms_my: Anda akan menyerahkan jawapan anda untuk tugasan ini. Selepas anda menyerahkan respons ini, anda tidak boleh mengubahnya atau menyerahkan respons baharu.

source: Confirm Reset
ms_my: Sahkan Set Semula

source: You're about to reset your response for this assignment. You will need to submit a new response in order to complete this step. Are you sure you want to continue?
ms_my: Anda akan menetapkan semula respons anda untuk tugasan ini. Anda perlu menyerahkan respons baharu untuk melengkapkan langkah ini. Adakah anda pasti mahu meneruskan?

source: Individual file size must be {max_files_mb}MB or less.
ms_my: Saiz fail individu mestilah {max_files_mb}MB atau kurang.

source: File upload failed: unsupported file type. Only the supported file types can be uploaded. If you have questions, please reach out to the course team.
ms_my: Muat naik fail gagal: jenis fail tidak disokong. Hanya jenis fail yang disokong boleh dimuat naik. Jika anda mempunyai soalan, sila hubungi pasukan kursus.

source: The maximum number files that can be saved is
ms_my: Jumlah maksimum fail yang boleh disimpan ialah

source: Describe
ms_my: Huraikan

source: (required):
ms_my: (diperlukan):

source: Thumbnail view of
ms_my: Pandangan lakaran kecil bagi

source: Confirm Delete Uploaded File
ms_my: Sahkan Padam Fail yang Dimuat Naik

source: Are you sure you want to delete the following file? It cannot be restored. File:
ms_my: Adakah anda pasti mahu memadamkan fail berikut? Ia tidak boleh dipulihkan. Fail:

source: If you leave this page without submitting your self assessment, you will lose any work you have done.
ms_my: Jika anda meninggalkan halaman ini tanpa menyerahkan penilaian diri anda, anda akan kehilangan sebarang kerja yang telah anda lakukan.

source: Unexpected server error.
ms_my: Ralat pelayan yang tidak dijangka.

source: You must provide a learner name.
ms_my: Anda mesti memberikan nama pelajar.

source: This grade will be applied to all members of the team. Do you want to continue?
ms_my: Gred ini akan digunakan untuk semua ahli pasukan. Adakah anda mahu meneruskan?

source: Confirm Grade Team Submission
ms_my: Sahkan Penyerahan Pasukan Gred

source: Error getting the number of ungraded responses
ms_my: Ralat mendapatkan bilangan respons yang tidak digredkan

source: If you leave this page without submitting your staff assessment, you will lose any work you have done.
ms_my: Jika anda meninggalkan halaman ini tanpa menyerahkan penilaian kakitangan anda, anda akan kehilangan sebarang kerja yang telah anda lakukan.

source: Feedback available for selection.
ms_my: Maklum balas tersedia untuk dipilih.

source: If you leave this page without submitting your peer assessment, you will lose any work you have done.
ms_my: Jika anda meninggalkan halaman ini tanpa menyerahkan penilaian rakan sebaya anda, anda akan kehilangan sebarang kerja yang telah anda lakukan.

source: Refresh
ms_my: Segarkan semula

source: Action
ms_my: Tindakan

source: Review
ms_my: Semakan

source: Username
ms_my: Nama pengguna

source: Peers Assessed
ms_my: Rakan Sebaya Dinilai

source: Peer Responses Received
ms_my: Respon Rakan Sebaya Diterima

source: Time Spent On Current Step
ms_my: Masa Dibelanjakan Pada Langkah Semasa

source: Staff assessment
ms_my: Penilaian kakitangan

source: Grade Status
ms_my: Status Gred

source: The "{name}" problem is configured to require a minimum of {min_grades} peer grades, and asks to review {min_graded} peers.
ms_my: Masalah "{name}" dikonfigurasikan untuk memerlukan sekurang-kurangnya {min_grades} gred rakan sebaya dan meminta untuk menyemak {min_graded} rakan sebaya.

source: There are currently {stuck_learners} learners in the waiting state, meaning they have not yet met all requirements for Peer Assessment.
ms_my: Pada masa ini terdapat pelajar {stuck_learners} dalam keadaan menunggu, bermakna mereka belum lagi memenuhi semua keperluan untuk Penilaian Rakan Sebaya.

source: However, {overwritten_count} of these students have received a grade through the staff grade override tool already.
ms_my: Walau bagaimanapun, {overwritten_count} daripada pelajar ini telah menerima gred melalui alat ganti gred kakitangan sudah.

source: Error while fetching student data.
ms_my: Ralat semasa mengambil data pelajar.

source: Unable to load
ms_my: Tidak dapat memuatkan

source: Paragraph
ms_my: Perenggan

source: Preformatted
ms_my: Praformat

source: Unnamed Option
ms_my: Pilihan Tanpa Nama

source: Not Selected
ms_my: Tidak Dipilih

source: Problem cloning rubric
ms_my: Masalah pengklonan rubrik

source: Criterion Added
ms_my: Kriteria Ditambah

source: You have added a criterion. You will need to select an option for the criterion in the Learner Training step. To do this, click the Assessment Steps tab.
ms_my: Anda telah menambah kriteria. Anda perlu memilih pilihan untuk kriteria dalam langkah Latihan Pelajar. Untuk melakukan ini, klik tab Langkah-langkah Penilaian.

source: Option Deleted
ms_my: Pilihan Dipadamkan

source: You have deleted an option. That option has been removed from its criterion in the sample responses in the Learner Training step. You might have to select a new option for the criterion.
ms_my: Anda telah memadamkan pilihan. Pilihan itu telah dialih keluar daripada kriterianya dalam sampel respons dalam langkah Latihan Pelajar. Anda mungkin perlu memilih pilihan baharu untuk kriteria tersebut.

source: You have deleted all the options for this criterion. The criterion has been removed from the sample responses in the Learner Training step.
ms_my: Anda telah memadamkan semua pilihan untuk kriteria ini. Kriteria telah dialih keluar daripada sampel respons dalam langkah Latihan Pelajar.

source: Criterion Deleted
ms_my: Kriteria Dipadamkan

source: You have deleted a criterion. The criterion has been removed from the example responses in the Learner Training step.
ms_my: Anda telah memadamkan kriteria. Kriteria telah dialih keluar daripada contoh respons dalam langkah Latihan Pelajar.

source: Warning
ms_my: Amaran

source: Changes to steps that are not selected as part of the assignment will not be saved.
ms_my: Perubahan pada langkah yang tidak dipilih sebagai sebahagian daripada tugasan tidak akan disimpan.

source: Time must be in the format dd:hh:mm. The days must be between 00 and 99, the hours between 00 and 23, and the minutes between 00 and 59.
ms_my: Masa mestilah dalam format dd:hh:mm. Hari mestilah antara 00 dan 99, jam antara 00 dan 23, dan minit antara 00 dan 59.

source: File types can not be empty.
ms_my: Jenis fail tidak boleh kosong.

source: The following file types are not allowed:
ms_my: Jenis fail berikut tidak dibenarkan:

source: Save Unsuccessful
ms_my: Simpan Tidak Berjaya

source: Errors detected on the following tabs:
ms_my: Ralat dikesan pada tab berikut:

source: This ORA has already been released. Changes will only affect learners making new submissions. Existing submissions will not be modified by this change.
ms_my: ORA ini telah pun dikeluarkan. Perubahan hanya akan menjejaskan pelajar yang membuat penyerahan baharu. Penyerahan sedia ada tidak akan diubah suai oleh perubahan ini.

source: error count:
ms_my: kiraan ralat:
