Repository: kelvin5290/openedx-translations
Catalog: translations/course-discovery/course_discovery/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Learner Pathway Course
ms_my: Kursus Laluan Pelajar

source: Learner Pathway Courses
ms_my: Kursus Laluan Pelajar

source: Learner Pathway Program
ms_my: Program Laluan Pelajar

source: Learner Pathway Programs
ms_my: Program Laluan Pelajar

source: Organization Role
ms_my: Peranan Organisasi

source: Update the course recommendations based on skills.
ms_my: Kemas kini cadangan kursus berdasarkan kemahiran.

source: Use arguments from the UpdateCourseRecommendationsConfig model instead of the command line.
ms_my: Gunakan hujah daripada model UpdateCourseRecommendationsConfig dan bukannya baris arahan.

source: The original course, whose recommendation is stored here.
ms_my: Kursus asal, yang cadangannya disimpan di sini.

source: This is the course recommended after learner completes the original course.
ms_my: Ini adalah kursus yang disyorkan selepas pelajar menamatkan kursus asal.

source: Ratio of number of common skills and total skill count.
ms_my: Nisbah bilangan kemahiran biasa dan jumlah kiraan kemahiran.

source: Count of common skills between the original course and recommended course.
ms_my: Kiraan kemahiran biasa antara kursus asal dan kursus yang disyorkan.

source: Ratio of number of common subjects and total subject count.
ms_my: Nisbah bilangan subjek biasa dan jumlah bilangan subjek.

source: Count of common subjects between the original course and recommended course.
ms_my: Kiraan subjek biasa antara kursus asal dan kursus yang disyorkan.

source: Course Recommendation
ms_my: Syor Kursus

source: Course Recommendations
ms_my: Cadangan Kursus

source: Adds recommendations for all published courses
ms_my: Menambah cadangan untuk semua kursus yang diterbitkan

source: Adds recommendations for courses created or modified in the past num days
ms_my: Menambahkan pengesyoran untuk kursus yang dibuat atau diubah suai dalam num hari yang lalu

source: No partner object found!
ms_my: Tiada objek rakan kongsi ditemui!

source: Discovery Service Administration
ms_my: Pentadbiran Perkhidmatan Penemuan
