Repository: kelvin5290/openedx-translations
Catalog: translations/course-discovery/course_discovery/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: U.S. value per lead in U.S. dollars.
ms_my: Nilai A.S. setiap petunjuk dalam dolar A.S.

source: International Value Per Lead
ms_my: Nilai Antarabangsa Setiap Pemimpin

source: International value per lead in U.S. dollars.
ms_my: Nilai antarabangsa setiap petunjuk dalam dolar A.S..

source: U.S. Value Per Click
ms_my: Nilai Setiap Klik A.S

source: U.S. value per click in U.S. dollars.
ms_my: Nilai setiap klik A.S. dalam dolar A.S..

source: International Value Per Click
ms_my: Nilai Setiap Klik Antarabangsa

source: International value per click in U.S. dollars.
ms_my: Nilai antarabangsa setiap klik dalam dolar A.S..

source: Latitude
ms_my: Latitud

source: Longitude
ms_my: Longitud

source: Allowlist
ms_my: Senarai kebenaran

source: Blocklist
ms_my: Senarai sekat

source: When making reruns for this course, they will use this key instead of the course key.
ms_my: Apabila membuat tayangan semula untuk kursus ini, mereka akan menggunakan kunci ini dan bukannya kunci kursus.

source: The actual duration of this course as experienced by learners who complete it.
ms_my: Tempoh sebenar kursus ini seperti yang dialami oleh pelajar yang menyelesaikannya.

source: Add the course image
ms_my: Tambah imej kursus

source: FAQ
ms_my: Soalan Lazim

source: Total number of learners who have enrolled in this course
ms_my: Jumlah bilangan pelajar yang telah mendaftar dalam kursus ini

source: Total number of learners who have enrolled in this course in the last 6 months
ms_my: Jumlah bilangan pelajar yang telah mendaftar dalam kursus ini dalam tempoh 6 bulan yang lalu

source: Course number format e.g CS002x, BIO1.1x, BIO1.2x
ms_my: Format nombor kursus cth CS002x, BIO1.1x, BIO1.2x

source: Additional Information
ms_my: Maklumat Tambahan

source: The last time this course was modified in the database.
ms_my: Kali terakhir kursus ini diubah suai dalam pangkalan data.

source: This field signifies if this course is in the enterprise subscription catalog
ms_my: Medan ini menandakan jika kursus ini berada dalam katalog langganan perusahaan

source: If checked, this item will not be indexed in Algolia and will not show up in search results.
ms_my: Jika ditandakan, item ini tidak akan diindeks dalam Algolia dan tidak akan muncul dalam hasil carian.

source: If checked, the About Page will have a meta tag with noindex value
ms_my: Jika disemak, Halaman Perihal akan mempunyai teg meta dengan nilai noindex

source: Watchers
ms_my: Pemerhati

source: The list of email addresses that will be notified if any of the course runs is published or scheduled.
ms_my: Senarai alamat e-mel yang akan dimaklumkan jika mana-mana kursus berjalan diterbitkan atau dijadualkan.

source: Future
ms_my: masa depan

source: Past
ms_my: lalu

source: Blocked
ms_my: Disekat

source: Unrestricted
ms_my: Tidak terhad

source: Title specific for this run of a course. Leave this value blank to default to the parent course's title.
ms_my: Tajuk khusus untuk larian kursus ini. Biarkan nilai ini kosong kepada lalai kepada tajuk kursus induk.

source: Short description specific for this run of a course. Leave this value blank to default to the parent course's short_description attribute.
ms_my: Penerangan ringkas khusus untuk larian kursus ini. Biarkan nilai ini kosong menjadi lalai kepada atribut short_description kursus induk.

source: Full description specific for this run of a course. Leave this value blank to default to the parent course's full_description attribute.
ms_my: Penerangan penuh khusus untuk larian kursus ini. Biarkan nilai ini kosong kepada lalai kepada atribut full_description kursus induk.

source: Estimated minimum number of hours per week needed to complete a course run.
ms_my: Anggaran bilangan jam minimum setiap minggu yang diperlukan untuk melengkapkan larian kursus.

source: Estimated maximum number of hours per week needed to complete a course run.
ms_my: Anggaran bilangan jam maksimum setiap minggu yang diperlukan untuk melengkapkan larian kursus.

source: Estimated number of weeks needed to complete this course run.
ms_my: Anggaran bilangan minggu yang diperlukan untuk menyelesaikan kursus ini dijalankan.

source: A JSON list detailing the available translations for this run. Each element in the list is a dictionary containing two keys: the language code and the language label. These entries represent the languages into which the run content can be translated.
ms_my: Senarai JSON yang memperincikan terjemahan yang tersedia untuk larian ini. Setiap elemen dalam senarai ialah kamus yang mengandungi dua kunci: kod bahasa dan label bahasa. Entri ini mewakili bahasa yang boleh diterjemahkan kandungan run.

source: Total number of learners who have enrolled in this course run
ms_my: Jumlah bilangan pelajar yang telah mendaftar dalam kursus ini dijalankan

source: Total number of learners who have enrolled in this course run in the last 6 months
ms_my: Jumlah bilangan pelajar yang telah mendaftar dalam kursus ini dijalankan dalam tempoh 6 bulan yang lalu

source: Whether this run should be hidden from API responses. Do not edit here - this value will be overwritten by the "Course Visibility In Catalog" field in Studio via Refresh Course Metadata.
ms_my: Sama ada larian ini harus disembunyikan daripada respons API. Jangan edit di sini - nilai ini akan ditimpa oleh medan "Keterlihatan Kursus Dalam Katalog" dalam Studio melalui Muat Semula Metadata Kursus.

source: Indicates whether the course relation has been manually overridden.
ms_my: Menunjukkan sama ada hubungan kursus telah ditindih secara manual.

source: 'What You Will Learn' description for this particular course run. Leave this value blank to default to the parent course's Outcome attribute.
ms_my: Penerangan 'Apa yang Anda Akan Pelajari' untuk kursus ini dijalankan. Biarkan nilai ini kosong untuk lalai kepada atribut Hasil kursus induk.

source: Add OFAC restriction text to the FAQ section of the Marketing site
ms_my: Tambahkan teks sekatan OFAC pada bahagian Soalan Lazim tapak Pemasaran

source: This calculated field signifies if this course run is in the enterprise subscription catalog
ms_my: Medan terkira ini menandakan jika kursus ini dijalankan dalam katalog langganan perusahaan

source: The identifier for a product variant. This is used to link a course run to a product variant for external LOBs (i.e; ExecEd & Bootcamps).
ms_my: Pengecam untuk varian produk. Ini digunakan untuk memautkan kursus yang dijalankan kepada varian produk untuk LOB luaran (iaitu ExecEd & Bootcamps).

source: Current
ms_my: semasa

source: Starting Soon
ms_my: Bermula Tidak Lama Lagi

source: Switching seat types after being reviewed is not supported. Please reach out to your project coordinator for additional help if necessary.
ms_my: Menukar jenis tempat duduk selepas disemak tidak disokong. Sila hubungi penyelaras projek anda untuk mendapatkan bantuan tambahan jika perlu.

source: Change careers
ms_my: Tukar kerjaya

source: Job advancement
ms_my: Kemajuan pekerjaan

source: Learn valuable skills
ms_my: Belajar kemahiran yang berharga

source: Learn for fun
ms_my: Belajar untuk keseronokan

source: FAQs
ms_my: Soalan Lazim

source: The user-facing display title for this Program.
ms_my: Tajuk paparan menghadap pengguna untuk Program ini.

source: A brief, descriptive subtitle for the Program.
ms_my: Sari kata ringkas dan deskriptif untuk Program.

source: A brief hook for the marketing website
ms_my: Cangkuk ringkas untuk laman web pemasaran

source: The lifecycle status of this Program.
ms_my: Status kitaran hayat Program ini.

source: If this box is not checked, courses will be ordered as in the courses select box above.
ms_my: Jika kotak ini tidak ditandakan, kursus akan dipesan seperti dalam kotak pilih kursus di atas.

source: This field is now deprecated (ECOM-6021).Estimated number of weeks needed to complete a course run belonging to this program.
ms_my: Medan ini kini ditamatkan (ECOM-6021). Anggaran bilangan minggu yang diperlukan untuk menyelesaikan kursus yang dijalankan oleh program ini.

source: DEPRECATED: Use the card image field
ms_my: DITAMATKAN: Gunakan medan imej kad

source: This field can be used by API clients to determine the order in which instructors will be displayed on program pages. Instructors in this list should appear before all others associated with this programs courses runs.
ms_my: Medan ini boleh digunakan oleh pelanggan API untuk menentukan susunan pengajar akan dipaparkan pada halaman program. Pengajar dalam senarai ini harus muncul sebelum semua kursus lain yang dikaitkan dengan program ini dijalankan.

source: The description of credit redemption for courses in program
ms_my: Penerangan tentang penebusan kredit untuk kursus dalam program

source: Allow courses in this program to be purchased in a single transaction
ms_my: Benarkan kursus dalam program ini dibeli dalam satu transaksi

source: Hide program on marketing site landing and search pages. This program MAY have a detail page.
ms_my: Sembunyikan program pada halaman pendaratan dan carian tapak pemasaran. Program ini MUNGKIN mempunyai halaman terperinci.

source: Total number of learners who have enrolled in courses this program
ms_my: Jumlah bilangan pelajar yang telah mendaftar dalam kursus program ini

source: Total number of learners who have enrolled in courses in this program in the last 6 months
ms_my: Jumlah bilangan pelajar yang telah mendaftar dalam kursus dalam program ini dalam tempoh 6 bulan yang lalu

source: Number of credits a learner will earn upon successful completion of the program
ms_my: Bilangan kredit yang akan diperoleh pelajar apabila berjaya menamatkan program ini

source: This calculated field signifies if all the courses in this program are included in the enterprise subscription catalog
ms_my: Medan terkira ini menandakan jika semua kursus dalam program ini disertakan dalam katalog langganan perusahaan

source: A field to override Organization short code alias specific for this program.
ms_my: Medan untuk mengatasi alias kod pendek Organisasi khusus untuk program ini.

source: A field to override Organization logo specific for this program.
ms_my: Medan untuk mengatasi logo Organisasi khusus untuk program ini.

source: Primary subject field specific for this program. Useful field in case there are no courses associated with this program.
ms_my: Bidang subjek utama khusus untuk program ini. Medan berguna sekiranya tiada kursus yang berkaitan dengan program ini.

source: Level type specific for this program. Useful field in case there are no courses associated with this program.
ms_my: Jenis tahap khusus untuk program ini. Medan berguna sekiranya tiada kursus yang berkaitan dengan program ini.

source: Language code specific for this program. Useful field in case there are no courses associated with this program.
ms_my: Kod bahasa khusus untuk program ini. Medan berguna sekiranya tiada kursus yang berkaitan dengan program ini.

source: Useful field to overwrite the duration of a program. It can be a text describing a period of time, Ex: 6-9 months.
ms_my: Medan berguna untuk menulis ganti tempoh program. Ia boleh menjadi teks yang menerangkan tempoh masa, Cth: 6-9 bulan.

source: The last time this program was modified.
ms_my: Kali terakhir program ini diubah suai.

source: The actual rank number
ms_my: Nombor pangkat sebenar

source: What does the rank number mean
ms_my: Apakah maksud nombor pangkat

source: From where the rank is obtained
ms_my: Dari mana pangkat itu diperolehi

source: Callback URL to partner application flow
ms_my: URL panggilan balik kepada aliran aplikasi rakan kongsi

source: Overall program ranking (e.g. "#1 in the U.S.")
ms_my: Kedudukan keseluruhan program (cth. "#1 di U.S.")

source: Provide a campus image for the header of the degree
ms_my: Menyediakan imej kampus untuk tajuk ijazah

source: Provide a background image for the title section of the degree
ms_my: Sediakan imej latar belakang untuk bahagian tajuk ijazah

source: The fine print that displays at the Tuition section's bottom
ms_my: Cetakan halus yang dipaparkan di bahagian bawah bahagian Tuisyen

source: The fine print that displays at the Deadline section's bottom
ms_my: Cetakan halus yang dipaparkan di bahagian bawah bahagian Tarikh Akhir

source: The sailthru email list name to capture leads
ms_my: Nama senarai e-mel sailthru untuk menangkap petunjuk

source: Please provide an image file for the lead capture banner.
ms_my: Sila berikan fail imej untuk sepanduk penangkapan petunjuk.

source: The Hubspot form ID for the lead capture form
ms_my: ID borang Hubspot untuk borang penangkapan petunjuk

source: URL to micromasters landing page
ms_my: URL ke halaman pendaratan micromasters

source: Micromasters verbose title
ms_my: Tajuk kata kerja Micromasters

source: Micromasters descriptive paragraph
ms_my: Perenggan deskriptif Micromasters

source: Customized background image for the MicroMasters section.
ms_my: Imej latar belakang yang disesuaikan untuk bahagian MicroMasters.

source: Override org name if micromasters program comes from different organization than Masters program
ms_my: Gantikan nama org jika program micromasters datang daripada organisasi yang berbeza daripada program Sarjana

source: Cost display for search card (e.g. "$9,999"
ms_my: Paparan kos untuk kad carian (cth. "$9,999"

source: Number of courses for search card (e.g. "11 Courses"
ms_my: Bilangan kursus untuk kad carian (cth. "11 Kursus"

source: Designates whether the degree should be displayed on the owning organization's page
ms_my: Menentukan sama ada ijazah perlu dipaparkan pada halaman organisasi pemilik

source: The redirect URL of the degree on external site
ms_my: URL ubah hala ijazah di tapak luaran

source: The URL of the landing page on external site
ms_my: URL halaman pendaratan di tapak luaran

source: Bell
ms_my: loceng

source: Certificate
ms_my: Sijil

source: Checkmark
ms_my: Tanda semak

source: Clock
ms_my: jam

source: Sitemap
ms_my: Peta laman

source: User
ms_my: pengguna

source: Dollar
ms_my: dolar

source: Book
ms_my: Buku

source: Mortar Board
ms_my: Papan lesung

source: Star
ms_my: Bintang

source: Trophy
ms_my: Piala

source: Icon FA class
ms_my: Kelas ikon FA

source: Paired text
ms_my: Teks berpasangan

source: Deadline applies for this semester (e.g. Spring 2019
ms_my: Tarikh akhir digunakan untuk semester ini (cth. Musim bunga 2019

source: Describes the deadline (e.g. Early Admission Deadline)
ms_my: Menerangkan tarikh akhir (cth. Tarikh Akhir Kemasukan Awal)

source: The date after which the deadline expires (e.g. January 1, 2019)
ms_my: Tarikh tarikh akhir tamat tempoh (mis. 1 Januari 2019)

source: The time after which the deadline expires (e.g. 11:59 PM EST).
ms_my: Masa selepas tarikh akhir tamat tempoh (mis. 11:59 PM EST).

source: Describes what the cost is for (e.g. Tuition)
ms_my: Menghuraikan kos untuk apa (cth. Tuisyen)

source: String-based field stating how much the cost is (e.g. $1000).
ms_my: Medan berasaskan rentetan menyatakan jumlah kosnya (mis. $1000).

source: A high-level overview of the degree's courseware.
ms_my: Gambaran keseluruhan tahap tinggi perisian kursus ijazah.

source: Organization name
ms_my: Nama organisasi

source: These programs are for a different partner than the pathway itself: {}
ms_my: Program ini adalah untuk rakan kongsi yang berbeza daripada laluan itu sendiri: {}

source: Others
ms_my: Lain-lain

source: Partner {partner_key} and course partner {course_partner_key} do not match when attempting to save url slug {url_slug}
ms_my: Rakan kongsi {partner_key} dan rakan kongsi kursus {course_partner_key} tidak sepadan apabila cuba menyimpan slug url {url_slug}

source: Partner {partner_key} and course partner {course_partner_key} do not match when attempting to save url redirect {url_path}
ms_my: Rakan kongsi {partner_key} dan rakan kongsi kursus {course_partner_key} tidak sepadan apabila cuba menyimpan ubah hala url {url_path}

source: It expects the data will be provided in a csv file format
ms_my: Ia menjangkakan data akan disediakan dalam format fail csv

source: A csv file containing uuid of the courses to be archived
ms_my: Fail csv yang mengandungi uuid kursus yang akan diarkibkan

source: It expects the data will be provided in a csv file format with first row containing all the headers.
ms_my: Ia menjangkakan data akan disediakan dalam format fail csv dengan baris pertama mengandungi semua pengepala.

source: Open Courses
ms_my: Kursus Terbuka

source: 2U Executive Education Courses
ms_my: Kursus Pendidikan Eksekutif 2U

source: Course UUIDs
ms_my: Kursus UUID

source: Course Run IDs
ms_my: ID Larian Kursus

source: Profile Image UUIDs
ms_my: UUID Imej Profil

source: Remove All Redirects
ms_my: Alih Keluar Semua Ubah hala

source: Url Paths
ms_my: Laluan Url

source: Add redirects from all published course url slugs
ms_my: Tambahkan ubah hala daripada semua slug url kursus yang diterbitkan

source: Course uuids
ms_my: Kursus uuids

source: Attempted to query Salesforce with no client for partner={}
ms_my: Cuba untuk menanyakan Salesforce tanpa pelanggan untuk rakan kongsi={}

source: Unable to associate a case for comments for {}
ms_my: Tidak dapat mengaitkan kes untuk ulasan untuk {}

source: Cancel
ms_my: Batal

source: Back to Program
ms_my: Kembali ke Program

source: Save Course Run
ms_my: Simpan Larian Kursus

source: Home
ms_my: Rumah

source: Course Skills
ms_my: Kemahiran Kursus

source: Refresh Course Skills
ms_my: Segarkan Kemahiran Kursus

source: Refresh Program Skills
ms_my: Segarkan Kemahiran Program

source: %(user_name)s made the following comment on %(course_name)s on %(date)s at %(time)s
ms_my: %(user_name)s membuat ulasan berikut pada %(course_name)s pada %(date)s pada %(time)s

source: View comment in Publisher
ms_my: Lihat ulasan dalam Penerbit

source: The edX team
ms_my: Pasukan edX

source: Dear %(recipient_name)s,
ms_my: %(recipient_name)s yang dihormati,

source: The About page for the %(course_run_number)s course run of %(course_name)s has been published. No further action is necessary.
ms_my: Halaman Perihal untuk %(course_run_number)s course run of %(course_name)s telah diterbitkan. Tiada tindakan lanjut diperlukan.

source: {link_start}{preview_url}{link_middle}View this About page.{link_end}
ms_my: {link_start}{preview_url}{link_middle}Lihat halaman Perihal ini.{link_end}

source: View this About page. %(preview_url)s
ms_my: Lihat halaman Perihal ini. %(preview_url)s

source: Note: This email address is unable to receive replies. For questions or comments, please contact your Project Coordinator(s):
ms_my: Nota: Alamat e-mel ini tidak dapat menerima balasan. Untuk pertanyaan atau komen, sila hubungi Penyelaras Projek anda:

source: {org_name} has submitted {course_key} for review. {link_start}{course_page_url}{link_middle}View this course run in Publisher{link_end} to review the changes and mark it as reviewed.
ms_my: {org_name} telah menyerahkan {course_key} untuk semakan. {link_start}{course_page_url}{link_middle}Lihat kursus ini dijalankan dalam Penerbit{link_end} untuk menyemak perubahan dan menandakannya sebagai disemak.

source: This is a good time to {link_start}{studio_url}{link_middle}review this course run in Studio{link_end}.
ms_my: Ini adalah masa yang baik untuk {link_start}{studio_url}{link_middle}menyemak kursus ini dijalankan di Studio{link_end}.

source: Visit the {link_start}{restricted_admin_url}{link_middle}restricted course admin page{link_end} to set embargo rules for this course, as needed.
ms_my: Lawati {link_start}{restricted_admin_url}{link_middle}halaman pentadbir kursus terhad{link_end} untuk menetapkan peraturan embargo untuk kursus ini, seperti yang diperlukan.

source: %(org_name)s has submitted %(course_key)s for review.
ms_my: %(org_name)s telah menyerahkan %(course_key)s untuk semakan.

source: Publisher page: %(course_page_url)s
ms_my: Halaman penerbit: %(course_page_url)s

source: Studio page: %(studio_url)s
ms_my: Halaman studio: %(studio_url)s

source: Restricted Course admin: %(restricted_admin_url)s
ms_my: Pentadbir Kursus Terhad: %(restricted_admin_url)s

source: {org_name} has submitted {course_name} for review. {link_start}{course_page_url}{link_middle}View this course run in Publisher{link_end} to determine OFAC status.
ms_my: {org_name} telah menyerahkan {course_name} untuk semakan. {link_start}{course_page_url}{link_middle}Lihat kursus ini dijalankan dalam Penerbit{link_end} untuk menentukan status OFAC.

source: %(org_name)s has submitted %(course_name)s for review.
ms_my: %(org_name)s telah menyerahkan %(course_name)s untuk semakan.

source: View this course run in Publisher above to determine OFAC status.
ms_my: Lihat kursus ini dijalankan dalam Penerbit di atas untuk menentukan status OFAC.

source: The {link_start}{course_page_url}{link_middle}{course_run_number} course run{link_end} of {course_name} has been reviewed and approved by {platform_name}.
ms_my: Kursus {link_start}{course_page_url}{link_middle}{course_run_number} dijalankan{link_end} {course_name} telah disemak dan diluluskan oleh {platform_name}.

source: The course run about page will be published on %(go_live_date)s, pending no further edits.
ms_my: Halaman tentang kursus yang dijalankan akan diterbitkan pada %(go_live_date)s, tanpa menunggu pengeditan lanjut.

source: The course run about page is now published.
ms_my: Halaman kursus run about kini diterbitkan.

source: The %(course_run_number)s course run of %(course_name)s has been reviewed and approved by %(platform_name)s.
ms_my: %(course_run_number)s course run of %(course_name)s telah disemak dan diluluskan oleh %(platform_name)s.

source: View the course run in Publisher: %(course_page_url)s
ms_my: Lihat kursus yang dijalankan dalam Penerbit: %(course_page_url)s

source: Special characters not allowed in Course Number.
ms_my: Aksara khas tidak dibenarkan dalam Nombor Kursus.

source: Invalid HTML received: {0}
ms_my: HTML tidak sah diterima: {0}

source: Invalid HTML received
ms_my: HTML tidak sah diterima

source: {0} tag is not allowed
ms_my: Teg {0} tidak dibenarkan

source: {0} attribute is not allowed on the {1} tag
ms_my: Atribut {0} tidak dibenarkan pada teg {1}.

source: Update excluded course runs
ms_my: Kemas kini kursus yang dikecualikan

source: The program was changed successfully.
ms_my: Program ini telah berjaya diubah.

source: The refresh program skills task triggered successfully.
ms_my: Tugas kemahiran program muat semula berjaya dicetuskan.

source: The refresh course skills task triggered successfully.
ms_my: Tugas kemahiran kursus muat semula berjaya dicetuskan.

source: The course skills were updated successfully.
ms_my: Kemahiran kursus telah dikemas kini dengan jayanya.

source: Request could not be completed due to an incorrect ElasticSearch query parameters
ms_my: Permintaan tidak dapat dilengkapkan kerana parameter pertanyaan ElasticSearch yang salah

source: Name for translation
ms_my: Nama untuk terjemahan

source: LanguageTag model translations
ms_my: Terjemahan model LanguageTag

source: Inactive
ms_my: Tidak aktif

source: Title of the learner pathway.
ms_my: Tajuk laluan pelajar.

source: Course/Program associated pathways also appear in search results
ms_my: Laluan berkaitan kursus/Program juga muncul dalam hasil carian

source: The active/inactive status of this Pathway.
ms_my: Status aktif/tidak aktif Laluan ini.

source: Learner Pathway
ms_my: Laluan Pelajar

source: Learner Pathways
ms_my: Laluan Pelajar

source: Minimum number of nodes to complete this step of the pathway
ms_my: Bilangan minimum nod untuk melengkapkan langkah laluan ini

source: Learner Pathway Step
ms_my: Langkah Laluan Pelajar

source: Learner Pathway Steps
ms_my: Langkah Laluan Pelajar
