Repository: kelvin5290/openedx-translations
Catalog: translations/course-discovery/course_discovery/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: No user with the username [{username}] exists.
ms_my: Tiada pengguna dengan nama pengguna [{username}] wujud.

source: Only staff users are permitted to filter by username. Remove the username parameter.
ms_my: Hanya pengguna kakitangan dibenarkan menapis mengikut nama pengguna. Alih keluar parameter nama pengguna.

source: Number of courses contained in this catalog
ms_my: Bilangan kursus yang terkandung dalam katalog ini

source: Usernames of users with explicit access to view this catalog
ms_my: Nama pengguna pengguna dengan akses eksplisit untuk melihat katalog ini

source: Start date cannot be after the End date
ms_my: Tarikh mula tidak boleh selepas tarikh Tamat

source: Term cannot be changed
ms_my: Istilah tidak boleh diubah

source: Language in which the course is administered
ms_my: Bahasa di mana kursus ditadbir

source: Course cannot be changed for an existing course run
ms_my: Kursus tidak boleh ditukar untuk kursus yang sedia ada

source: Minimum effort cannot be greater than Maximum effort
ms_my: Usaha minimum tidak boleh lebih besar daripada usaha maksimum

source: Minimum effort and Maximum effort cannot be the same
ms_my: Usaha minimum dan usaha maksimum tidak boleh sama

source: Dictionary mapping course run IDs to boolean values
ms_my: Kursus pemetaan kamus menjalankan ID kepada nilai boolean

source: Restriction Type cannot be empty
ms_my: Jenis Sekatan tidak boleh kosong

source: Dictionary mapping course IDs to boolean values
ms_my: Kamus memetakan ID kursus kepada nilai boolean

source: Languages that course runs in this program are offered in.
ms_my: Bahasa yang kursus dijalankan dalam program ini ditawarkan.

source: Languages that course runs in this program have available transcripts in.
ms_my: Bahasa yang dijalankan kursus dalam program ini mempunyai transkrip yang tersedia.

source: An error occurred while setting the course run image for [{key}] in studio. All other fields were successfully saved in Studio.
ms_my: Ralat berlaku semasa menetapkan imej larian kursus untuk [{key}] dalam studio. Semua medan lain telah berjaya disimpan dalam Studio.

source: You must include a course_uuid in your query parameters.
ms_my: Anda mesti memasukkan course_uuid dalam parameter pertanyaan anda.

source: Missing value for: [{name}].
ms_my: Tiada nilai untuk: [{name}].

source: Incorrect data sent.
ms_my: Data tidak betul dihantar.

source: Failed to set course run data: {}
ms_my: Gagal menetapkan data larian kursus: {}

source: Can only update status, ofac restrictions, and ofac comment
ms_my: Hanya boleh mengemas kini status, sekatan ofac dan ulasan ofac

source: Course run is in review. Editing disabled.
ms_my: Kursus berjalan sedang dalam semakan. Pengeditan dilumpuhkan.

source: Invalid parameter
ms_my: Parameter tidak sah

source: Failed to set data: {}
ms_my: Gagal menetapkan data: {}

source: Organization [{org}] does not exist.
ms_my: Organisasi [{org}] tidak wujud.

source: Course Type [{course_type}] does not exist.
ms_my: Jenis Kursus [{course_type}] tidak wujud.

source: Product Source [{product_source}] does not exist.
ms_my: Sumber Produk [{product_source}] tidak wujud.

source: A course with key [{key}] already exists.
ms_my: Kursus dengan kunci [{key}] sudah wujud.

source: Course creation was unsuccessful. The course URL slug ‘[{url_slug}]’ is already in use. Please update this field and try again.
ms_my: Penciptaan kursus tidak berjaya. Slug URL kursus '[{url_slug}]' sudah digunakan. Sila kemas kini medan ini dan cuba lagi.

source: Switching entitlement types after being reviewed is not supported. Please reach out to your project coordinator for additional help if necessary.
ms_my: Menukar jenis kelayakan selepas disemak tidak disokong. Sila hubungi penyelaras projek anda untuk mendapatkan bantuan tambahan jika perlu.

source: Course edit was unsuccessful. The course URL slug ‘[{url_slug}]’ is already in use. Please update this field and try again.
ms_my: Pengeditan kursus tidak berjaya. Slug URL kursus '[{url_slug}]' sudah digunakan. Sila kemas kini medan ini dan cuba lagi.

source: You are not permitted to access the API documentation.
ms_my: Anda tidak dibenarkan mengakses dokumentasi API.

source: Catalog name
ms_my: Nama katalog

source: Query to retrieve Course Run catalog contents
ms_my: Pertanyaan untuk mendapatkan semula kandungan katalog Course Run

source: Query to retrieve Program catalog contents
ms_my: Pertanyaan untuk mendapatkan semula kandungan katalog Program

source: Include archived courses
ms_my: Sertakan kursus yang diarkibkan

source: Personal info
ms_my: Maklumat peribadi

source: Permissions
ms_my: kebenaran

source: Important dates
ms_my: Tarikh penting

source: API Configuration
ms_my: Konfigurasi API

source: Configure the APIs that will be used to retrieve data.
ms_my: Konfigurasikan API yang akan digunakan untuk mendapatkan semula data.

source: Marketing Site Configuration
ms_my: Konfigurasi Tapak Pemasaran

source: Configure the marketing site URLs that will be used to retrieve data and create URLs.
ms_my: Konfigurasikan URL tapak pemasaran yang akan digunakan untuk mendapatkan semula data dan membuat URL.

source: Analytics Configuration
ms_my: Konfigurasi Analitis

source: Configure the analytics API that will be used to retrieve enrollment data
ms_my: Konfigurasikan API analitik yang akan digunakan untuk mendapatkan semula data pendaftaran

source: period must be one of {period_choices}.
ms_my: tempoh mestilah salah satu daripada {period_choices}.

source: 'rate' must be in the format defined by DRF, such as '100/hour'.
ms_my: 'kadar' mestilah dalam format yang ditakrifkan oleh DRF, seperti '100/jam'.

source: Full Name
ms_my: Nama Penuh

source: Referral Tracking ID
ms_my: ID Penjejakan Rujukan

source: The rate of requests to limit this user to. The format is specified by Django Rest Framework (see http://www.django-rest-framework.org/api-guide/throttling/).
ms_my: Kadar permintaan untuk mengehadkan pengguna ini. Format ditentukan oleh Django Rest Framework (lihat http://www.django-rest-framework.org/api-guide/throttling/).

source: Short Code
ms_my: Kod Pendek

source: Convenient code/slug used to identify this Partner (e.g. for management commands.)
ms_my: Kod/slug mudah digunakan untuk mengenal pasti Rakan Kongsi ini (cth. untuk arahan pengurusan.)

source: Courses API URL
ms_my: URL API Kursus

source: Course Mode API URL
ms_my: URL API Mod Kursus

source: E-Commerce API URL
ms_my: URL API E-Dagang

source: Organizations API URL
ms_my: URL API Organisasi

source: Programs API URL
ms_my: URL API Program

source: Marketing Site API URL
ms_my: URL API Tapak Pemasaran

source: Marketing Site URL
ms_my: URL Tapak Pemasaran

source: Marketing Site API Username
ms_my: Nama Pengguna API Tapak Pemasaran

source: Marketing Site API Password
ms_my: Kata Laluan API Tapak Pemasaran

source: Studio URL
ms_my: URL studio

source: Publisher URL
ms_my: URL penerbit

source: The base URL of your publisher service, if used. Example: https://publisher.example.com/
ms_my: URL asas perkhidmatan penerbit anda, jika digunakan. Contoh: https://publisher.example.com/

source: LMS URL
ms_my: URL LMS

source: LMS Admin URL
ms_my: URL Pentadbir LMS

source: The public URL of your LMS Django admin. Example: https://lms-internal.example.com/admin
ms_my: URL awam pentadbir LMS Django anda. Contoh: https://lms-internal.example.com/admin

source: Analytics API URL
ms_my: URL API Analitis

source: Analytics Access Token
ms_my: Token Akses Analitis

source: Partner
ms_my: rakan kongsi

source: Partners
ms_my: rakan kongsi

source: Salesforce Username
ms_my: Nama Pengguna Salesforce

source: Salesforce Password
ms_my: Kata Laluan Salesforce

source: Salesforce Organization Id
ms_my: Id Organisasi Salesforce

source: Salesforce Security Token
ms_my: Token Keselamatan Salesforce

source: Is a Salesforce Sandbox?
ms_my: Adakah Kotak Pasir Salesforce?

source: Case Record Type Id
ms_my: Id Jenis Rekod Kes

source: An error occurred while publishing the {model} to the marketing site. Please try again. If the error persists, please contact the Engineering Team.
ms_my: Ralat berlaku semasa menerbitkan {model} ke tapak pemasaran. Sila cuba lagi. Jika ralat berterusan, sila hubungi Pasukan Kejuruteraan.

source: eligible for one-click purchase
ms_my: layak untuk pembelian satu klik

source: Yes
ms_my: ya

source: No
ms_my: Tidak

source: Included course runs
ms_my: Termasuk larian kursus

source: Edit link
ms_my: Edit pautan

source: Edit course run exclusions
ms_my: Edit pengecualian larian kursus

source: (save and continue editing to create a link)
ms_my: (simpan dan teruskan mengedit untuk membuat pautan)

source: Certificates
ms_my: Sijil

source: Pathways to Degrees
ms_my: Laluan ke Darjah

source: Boot Camps
ms_my: Kem Boot

source: Bachelor’s
ms_my: Sarjana Muda

source: Master’s
ms_my: Cikgu

source: Available now
ms_my: Tersedia sekarang

source: Upcoming
ms_my: Akan datang

source: Archived
ms_my: Diarkibkan

source: Available by subscription
ms_my: Tersedia melalui langganan

source: Unpublished
ms_my: Tidak diterbitkan

source: Awaiting Review from Legal
ms_my: Menunggu Semakan daripada Undang-undang

source: Awaiting Internal Review
ms_my: Menunggu Semakan Dalaman

source: Reviewed
ms_my: Disemak

source: Published
ms_my: Diterbitkan

source: Instructor-paced
ms_my: Rentak pengajar

source: Self-paced
ms_my: Bergerak sendiri

source: Active
ms_my: Aktif

source: Retired
ms_my: Bersara

source: Deleted
ms_my: Dipadamkan

source: test
ms_my: ujian

source: other
ms_my: lain

source: Honor
ms_my: Kehormatan

source: Credit
ms_my: Kredit

source: Verified
ms_my: Disahkan

source: Professional
ms_my: Profesional

source: Executive Education
ms_my: Pendidikan Eksekutif

source: Paid Executive Education
ms_my: Pendidikan Eksekutif Berbayar

source: Unpaid Executive Education
ms_my: Pendidikan Eksekutif Tanpa Gaji

source: Paid Bootcamp
ms_my: Bootcamp Berbayar

source: Unpaid Bootcamp
ms_my: Bootcamp tidak berbayar

source: Organization
ms_my: Organisasi

source: Short
ms_my: pendek

source: Medium
ms_my: Sederhana

source: Long
ms_my: Panjang

source: Short Course
ms_my: Kursus Pendek

source: Sprint
ms_my: Lari pecut

source: Course Stack
ms_my: Timbunan Kursus

source: Custom B2B Enterprise
ms_my: B2B Enterprise tersuai

source: Custom B2C
ms_my: B2C tersuai

source: Existing course type {type} for {key} ({id}) doesn't match its own entitlements.
ms_my: Jenis kursus sedia ada {type} untuk {key} ({id}) tidak sepadan dengan kelayakannya sendiri.

source: Existing run type {run_type} for {key} ({id}) doesn't match course type {type}.Skipping type.
ms_my: Jenis larian sedia ada {run_type} untuk {key} ({id}) tidak sepadan dengan jenis kursus {type}.Jenis melangkau.

source: Existing run type {run_type} for {key} ({id}) doesn't match its own seats.
ms_my: Jenis larian sedia ada {run_type} untuk {key} ({id}) tidak sepadan dengan tempat duduknya sendiri.

source: Course {key} ({id}) matched type {type}
ms_my: Kursus {key} ({id}) dipadankan dengan jenis {type}

source: Could not convert course {key} ({id}) to type {type}
ms_my: Tidak dapat menukar kursus {key} ({id}) kepada menaip {type}

source: Not sending notification email for template {template} because no organization is defined for course {course}
ms_my: Tidak menghantar e-mel pemberitahuan untuk templat {template} kerana tiada organisasi ditentukan untuk kursus {course}

source: Not sending notification email for template {template} because no project coordinator is defined for organization {org}
ms_my: Tidak menghantar e-mel pemberitahuan untuk templat {template} kerana tiada penyelaras projek ditentukan untuk organisasi {org}

source: Not sending notification email for template {template} because no publisher URL is defined for partner {partner}
ms_my: Tidak menghantar e-mel pemberitahuan untuk templat {template} kerana tiada URL penerbit ditentukan untuk rakan kongsi {partner}

source: Not sending notification email for template {template} because no studio URL is defined for partner {partner}
ms_my: Tidak menghantar e-mel pemberitahuan untuk templat {template} kerana tiada URL studio ditentukan untuk rakan kongsi {partner}

source: legal team
ms_my: pasukan undang-undang

source: Project Coordinator team
ms_my: Pasukan Penyelaras Projek

source: course team
ms_my: pasukan kursus

source: Legal review requested: {title}
ms_my: Semakan undang-undang diminta: {title}

source: Course URL for {title}
ms_my: URL kursus untuk {title}

source: Review requested: {key} - {title}
ms_my: Semakan diminta: {key} - {title}

source: Review complete: {title}
ms_my: Semakan selesai: {title}

source: Published: {title}
ms_my: Diterbitkan: {title}

source: Published: {key} - {title}
ms_my: Diterbitkan: {key} - {title}

source: Comment added: {title}
ms_my: Ulasan ditambahkan: {title}

source: Enter a valid “slug” consisting of letters, numbers, slashes, underscores or hyphens.
ms_my: Masukkan "slug" yang sah yang terdiri daripada huruf, nombor, garis miring, garis bawah atau sempang.

source: Programs can only be activated if they have a banner image.
ms_my: Program hanya boleh diaktifkan jika ia mempunyai imej sepanduk.

source: Tag to add to courses
ms_my: Tag untuk ditambahkan pada kursus

source: UUIDs of courses to tag
ms_my: UUID kursus untuk ditanda

source: Use arguments from the TagCourseUUIDsConfig model instead of the command line.
ms_my: Gunakan hujah daripada model TagCourseUUIDsConfig dan bukannya baris arahan.

source: Missing required arguments
ms_my: Tiada hujah yang diperlukan

source: Backpopulate new-style CourseType and CourseRunType where possible.
ms_my: Isi semula CourseType dan CourseRunType gaya baharu jika boleh.

source: CODE
ms_my: KOD

source: Short code for a partner.
ms_my: Kod pendek untuk rakan kongsi.

source: Course to backpopulate.
ms_my: Kursus untuk backpopulate.

source: KEY
ms_my: KUNCI

source: Organization to backpopulate.
ms_my: Organisasi untuk backpopulate.

source: CourseType/CourseRunType mismatches to allow. Specify like course-type-slug:run-type-slug.
ms_my: CourseType/CourseRunType tidak sepadan untuk dibenarkan. Tentukan seperti course-type-slug:run-type-slug.

source: Actually commit the changes to the database.
ms_my: Sebenarnya lakukan perubahan pada pangkalan data.

source: Use arguments from the BackpopulateCourseTypeConfig model instead of the command line.
ms_my: Gunakan hujah daripada model BackpopulateCourseTypeConfig dan bukannya baris arahan.

source: You must specify --partner
ms_my: Anda mesti menyatakan --partner

source: Supplied Course Run Type slug [{rt_slug}] does not exist.
ms_my: Slug Jenis Larian Kursus yang dibekalkan [{rt_slug}] tidak wujud.

source: Supplied Course Type slug [{ct_slug}] does not exist.
ms_my: Slug Jenis Kursus yang dibekalkan [{ct_slug}] tidak wujud.

source: No courses found. Did you specify an argument?
ms_my: Tiada kursus ditemui. Adakah anda menyatakan hujah?

source: Could not backpopulate a course type for the following courses: {course_keys}
ms_my: Tidak dapat mengisi semula jenis kursus untuk kursus berikut: {course_keys}

source: Delete duplicate persons in course_metadata.
ms_my: Padamkan orang pendua dalam course_metadata.

source: PERSON
ms_my: ORANG

source: People to delete, in UUID:TARGET_UUID form.
ms_my: Orang untuk dipadamkan, dalam borang UUID:TARGET_UUID.

source: PARTNER
ms_my: RAKAN NIAGA

source: Use arguments from the DeletePersonDupsConfig model instead of the command line.
ms_my: Gunakan hujah daripada model DeletePersonDupsConfig dan bukannya baris arahan.

source: Malformed argument "{}", should be in form of UUID:TARGET_UUID
ms_my: Argumen cacat "{}", hendaklah dalam bentuk UUID:TARGET_UUID

source: Malformed argument "{}", UUIDs cannot be equal
ms_my: Hujah cacat "{}", UUIDS tidak boleh sama

source: Deleting
ms_my: Memadam

source: Would delete
ms_my: Akan memadam

source: Name
ms_my: Nama

source: Endorsements
ms_my: Pengendorsan

source: Programs
ms_my: Program

source: Course Runs
ms_my: Kursus Larian

source: Target
ms_my: Sasaran

source: You must specify --partner-code
ms_my: Anda mesti menyatakan --partner-code

source: You must specify at least one person
ms_my: Anda mesti menyatakan sekurang-kurangnya seorang

source: Publishing course run {key}
ms_my: Menerbitkan kursus dijalankan {key}

source: Failed to publish {key}
ms_my: Gagal menerbitkan {key}

source: Successfully published {key}
ms_my: Berjaya menerbitkan {key}

source: One or more course runs failed to publish.
ms_my: Satu atau lebih kursus larian gagal diterbitkan.

source: Remove all redirects to all courses
ms_my: Alih keluar semua ubah hala ke semua kursus

source: Redirects to remove
ms_my: Ubah hala untuk mengalih keluar

source: Use arguments from the RemoveRedirectsConfig model instead of the command line.
ms_my: Gunakan hujah daripada model RemoveRedirectsConfig dan bukannya baris arahan.

source: Invalid arguments
ms_my: Hujah tidak sah

source: Cannot remove active url_slug {url_slug}
ms_my: Tidak boleh mengalih keluar url_slug {url_slug} aktif

source: Path {url_path} not in use, nothing to delete
ms_my: Laluan {url_path} tidak digunakan, tiada apa-apa untuk dipadamkan

source: One or more courses failed to unpublish.
ms_my: Satu atau lebih kursus gagal dinyahterbitkan.

source: Successfully unpublished runs in course {key}
ms_my: Berjaya menyahterbitkan larian dalam kursus {key}

source: Failed to unpublish runs in course {key}
ms_my: Gagal menyahterbitkan larian dalam kursus {key}

source: Please do not use any spaces or special characters other than period, underscore or hyphen. This key will be used in the course's course key.
ms_my: Tolong jangan gunakan sebarang ruang atau aksara khas selain noktah, garis bawah atau sempang. Kunci ini akan digunakan dalam kunci kursus kursus.

source: If populated, this field will overwrite name in platform.
ms_my: Jika diisi, medan ini akan menulis ganti nama dalam platform.

source: Spanish Description
ms_my: Penerangan Bahasa Sepanyol

source: For seo, this field allows for alternate spanish description to be manually inputted
ms_my: Untuk seo, medan ini membolehkan penerangan bahasa Sepanyol alternatif dimasukkan secara manual

source: Pick a tag from the suggestions. To make a new tag, add a comma after the tag name.
ms_my: Pilih teg daripada cadangan. Untuk membuat teg baharu, tambahkan koma selepas nama teg.

source: Automatically generate course run keys
ms_my: Menjana kunci larian kursus secara automatik

source: When this flag is enabled, the key of a new course run will be auto generated. When this flag is disabled, the key can be manually set.
ms_my: Apabila bendera ini didayakan, kunci larian kursus baharu akan dijana secara automatik. Apabila bendera ini dilumpuhkan, kunci boleh ditetapkan secara manual.

source: This field signifies if any of this org's courses are in the enterprise subscription catalog
ms_my: Medan ini menandakan jika mana-mana kursus org ini berada dalam katalog langganan perusahaan

source: The timestamp of the last time the organization data was modified.
ms_my: Cap masa kali terakhir data organisasi diubah suai.

source: Please do not use any spaces or special characters other than period, underscore or hyphen in the key field.
ms_my: Tolong jangan gunakan sebarang ruang atau aksara khas selain noktah, garis bawah atau tanda sempang dalam medan utama.

source: Corresponding organization code in an external product source
ms_my: Kod organisasi yang sepadan dalam sumber produk luaran

source: LevelType model translations
ms_my: Terjemahan model LevelType

source: Seat types that qualify for completion of programs of this type. Learners completing associated courses, but enrolled in other seat types, will NOT have their completion of the course counted toward the completion of the program.
ms_my: Jenis tempat duduk yang layak untuk melengkapkan program jenis ini. Pelajar yang menamatkan kursus yang berkaitan, tetapi mendaftar dalam jenis tempat duduk lain, TIDAK akan dikira tamatnya kursus tersebut.

source: Please provide an image file with transparent background
ms_my: Sila berikan fail imej dengan latar belakang lutsinar

source: Name of the external source.
ms_my: Nama sumber luaran.

source: Description of the external source.
ms_my: Penerangan tentang sumber luaran.

source: Programs of these types will be OFAC restricted
ms_my: Program jenis ini akan dihadkan OFAC

source: ProgramType model translations
ms_my: Terjemahan model ProgramType

source: This mode requires ID verification.
ms_my: Mod ini memerlukan pengesahan ID.

source: Completion can grant credit toward an organization’s degree.
ms_my: Penyiapan boleh memberikan kredit kepada ijazah organisasi.

source: Certificate type granted if this mode is eligible for a certificate, or blank if not.
ms_my: Jenis sijil diberikan jika mod ini layak untuk sijil, atau kosong jika tidak.

source: Who gets paid for the course? Platform is the site owner, Organization is the school.
ms_my: Siapa yang mendapat bayaran untuk kursus itu? Platform ialah pemilik tapak, Organisasi ialah sekolah.

source: Sets the order for displaying Course Run Types.
ms_my: Menetapkan susunan untuk memaparkan Jenis Larian Kursus.

source: Leave this blank to allow all orgs. Otherwise, specifies which orgs can see this course type in Publisher.
ms_my: Biarkan ini kosong untuk membenarkan semua org. Jika tidak, tentukan org mana yang boleh melihat jenis kursus ini dalam Penerbit.

source: Subject model translations
ms_my: Terjemahan model subjek

source: Topic model translations
ms_my: Terjemahan model topik

source: SEO Meta tags for Products
ms_my: Tag Meta SEO untuk Produk

source: The ID of the Taxi Form (by 2U) that would be rendered in place of the hubspot capture form
ms_my: ID Borang Teksi (oleh 2U) yang akan diberikan sebagai ganti borang tangkapan hubspot

source: The grouping of the Taxi Form (by 2U) that would be rendered instead of the hubspot capture form
ms_my: Pengumpulan Borang Teksi (oleh 2U) yang akan diberikan dan bukannya borang tangkapan hubspot

source: The URL of the paid landing page on external site
ms_my: URL halaman pendaratan berbayar di tapak luaran

source: The URL of the organic landing page on external site
ms_my: URL halaman pendaratan organik di tapak luaran

source: The start date of the external course offering for marketing purpose
ms_my: Tarikh mula tawaran kursus luar untuk tujuan pemasaran

source: The ends date of the external course offering for marketing purpose
ms_my: Tarikh tamat tawaran kursus luar untuk tujuan pemasaran

source: The suggested deadline for enrollment for marketing purpose
ms_my: Tarikh akhir yang dicadangkan untuk pendaftaran untuk tujuan pemasaran

source: The identifier for a product variant.
ms_my: Pengecam untuk varian produk.

source: Course override
ms_my: Tolak kursus

source: This field allows for override the default course term
ms_my: Medan ini membenarkan untuk menggantikan istilah kursus lalai

source: This field contain external course marketing type specific to product lines
ms_my: Medan ini mengandungi jenis pemasaran kursus luaran khusus untuk barisan produk

source: Determines weather the course should be displayed on the owning organization's page
ms_my: Menentukan cuaca kursus harus dipaparkan pada halaman organisasi pemilik

source: A list of major works by this person. Must be valid HTML.
ms_my: Senarai karya utama oleh orang ini. Mestilah HTML yang sah.

source: People
ms_my: Orang ramai

source: Add the collaborator image, please make sure its dimensions are 200x100px
ms_my: Tambahkan imej kolaborator, sila pastikan dimensinya ialah 200x100px

source: U.S. Value Per Lead
ms_my: Nilai A.S. Setiap Pemimpin
