Repository: kelvin5290/openedx-translations
Catalog: translations/xblock-google-drive/google_drive/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Display Name
ms_my: Nama Paparan

source: This name appears in the horizontal navigation at the top of the page.
ms_my: Nama ini muncul dalam navigasi mendatar di bahagian atas halaman.

source: Public Calendar ID
ms_my: ID Kalendar Awam

source: Google provides an ID for publicly available calendars. In the Google Calendar, open Settings and copy the ID from the Calendar Address section into this field.
ms_my: Google menyediakan ID untuk kalendar yang tersedia untuk umum. Dalam Kalendar Google, buka Tetapan dan salin ID daripada bahagian Alamat Kalendar ke dalam medan ini.

source: Default View
ms_my: Paparan Lalai

source: The calendar view that students see by default. A student can change this view.
ms_my: Paparan kalendar yang pelajar lihat secara lalai. Seorang pelajar boleh mengubah pandangan ini.

source: Embed Code
ms_my: Benamkan Kod

source: Google provides an embed code for Drive documents. In the Google Drive document, from the File menu, select Publish to the Web. Modify settings as needed, click Publish, and copy the embed code into this field.
ms_my: Google menyediakan kod benam untuk dokumen Drive. Dalam dokumen Google Drive, daripada menu Fail, pilih Terbitkan ke Web. Ubah suai tetapan seperti yang diperlukan, klik Terbitkan dan salin kod benam ke dalam medan ini.

source: Alternative Text
ms_my: Teks Alternatif

source: Alternative text describes an image and appears if the image is unavailable.
ms_my: Teks alternatif menerangkan imej dan muncul jika imej tidak tersedia.

source: Invalid Google Calendar
ms_my: Kalendar Google tidak sah

source: Please correct the outlined fields.
ms_my: Sila betulkan medan yang digariskan.

source: Clear Value
ms_my: Nilai Jelas

source: Google provides an ID for publicly available calendars. In the Google Calendar, open Settings and copy the ID from the Calendar Address section into this field. You can
ms_my: Google menyediakan ID untuk kalendar yang tersedia untuk umum. Dalam Kalendar Google, buka Tetapan dan salin ID daripada bahagian Alamat Kalendar ke dalam medan ini. awak boleh

source: Save
ms_my: Jimat

source: Cancel
ms_my: Batal

source: Invalid Google Document
ms_my: Dokumen Google tidak sah

source: Alternative text
ms_my: Teks alternatif

source: Saving
ms_my: Menyimpan
