Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
ms_my: Anda mesti menunggu sekurang-kurangnya {wait_secs} antara penyerahan. {remaining_secs} lagi.

source: {num_hour} hour
ms_my: {num_hour} jam

source: {num_minute} minute
ms_my: {num_minute} minit

source: {num_second} second
ms_my: {num_second} saat

source: Problem needs to be reset prior to save.
ms_my: Masalah perlu ditetapkan semula sebelum menyimpan.

source: Your answers have been saved.
ms_my: Jawapan anda telah disimpan.

source: Your answers have been saved but not graded. Click '{button_name}' to grade them.
ms_my: Jawapan anda telah disimpan tetapi tidak dinilai. Klik '{button_name}' untuk menilai mereka.

source: You cannot select Reset for a problem that is closed.
ms_my: Anda tidak boleh memilih Tetapkan Semula untuk masalah yang ditutup.

source: You must submit an answer before you can select Reset.
ms_my: Anda mesti menyerahkan jawapan sebelum anda boleh memilih Tetapkan Semula.

source: Problem's definition does not support rescoring.
ms_my: Takrifan masalah tidak menyokong penskoran.

source: Problem must be answered before it can be graded again.
ms_my: Masalah mesti dijawab sebelum boleh dinilai semula.

source: Conditional
ms_my: Bersyarat

source: List of urls of children that are references to external modules
ms_my: Senarai url kanak-kanak yang menjadi rujukan kepada modul luaran

source: Source Components
ms_my: Komponen Sumber

source: The component location IDs of all source components that are used to determine whether a learner is shown the content of this conditional block. Copy the component location ID of a component from its Settings dialog in Studio.
ms_my: ID lokasi komponen semua komponen sumber yang digunakan untuk menentukan sama ada pelajar ditunjukkan kandungan blok bersyarat ini. Salin ID lokasi komponen komponen daripada dialog Tetapannya dalam Studio.

source: Conditional Attribute
ms_my: Atribut Bersyarat

source: The attribute of the source components that determines whether a learner is shown the content of this conditional block.
ms_my: Atribut komponen sumber yang menentukan sama ada pelajar ditunjukkan kandungan blok bersyarat ini.

source: Conditional Value
ms_my: Nilai Bersyarat

source: The value that the conditional attribute of the source components must match before a learner is shown the content of this conditional block.
ms_my: Nilai yang atribut bersyarat bagi komponen sumber mesti sepadan sebelum pelajar ditunjukkan kandungan blok bersyarat ini.

source: Blocked Content Message
ms_my: Mesej Kandungan Disekat

source: The message that is shown to learners when not all conditions are met to show the content of this conditional block. Include {link} in the text of your message to give learners a direct link to required units. For example, 'You must complete {link} before you can access this unit'.
ms_my: Mesej yang ditunjukkan kepada pelajar apabila tidak semua syarat dipenuhi untuk menunjukkan kandungan blok bersyarat ini. Sertakan {link} dalam teks mesej anda untuk memberi pelajar pautan terus ke unit yang diperlukan. Contohnya, 'Anda mesti melengkapkan {link} sebelum anda boleh mengakses unit ini'.

source: You must complete {link} before you can access this unit.
ms_my: Anda mesti melengkapkan {link} sebelum anda boleh mengakses unit ini.

source: This component has no source components configured yet.
ms_my: Komponen ini belum mempunyai komponen sumber yang dikonfigurasikan lagi.

source: Configure list of sources
ms_my: Konfigurasikan senarai sumber

source: LTI Passports
ms_my: Pasport LTI

source: List of Textbook objects with (title, url) for textbooks used in this course
ms_my: Senarai objek Buku Teks dengan (tajuk, url) untuk buku teks yang digunakan dalam kursus ini

source: Slug that points to the wiki for this course
ms_my: Slug yang menunjuk ke wiki untuk kursus ini

source: Date that enrollment for this class is opened
ms_my: Tarikh pendaftaran untuk kelas ini dibuka

source: Date that enrollment for this class is closed
ms_my: Tarikh pendaftaran untuk kelas ini ditutup

source: Start time when this block is visible
ms_my: Masa mula apabila blok ini kelihatan

source: Date that this class ends
ms_my: Tarikh kelas ini tamat

source: Date that certificates become available to learners
ms_my: Tarikh sijil tersedia untuk pelajar

source: Cosmetic Course Display Price
ms_my: Harga Paparan Kursus Kosmetik

source: The cost displayed to students for enrolling in the course. If a paid course registration price is set by an administrator in the database, that price will be displayed instead of this one.
ms_my: Kos yang dipaparkan kepada pelajar untuk mendaftar dalam kursus. Jika harga pendaftaran kursus berbayar ditetapkan oleh pentadbir dalam pangkalan data, harga itu akan dipaparkan dan bukannya harga ini.

source: Course Advertised Start
ms_my: Permulaan Kursus yang Diiklankan

source: Enter the text that you want to use as the advertised starting time frame for the course, such as "Winter 2018". If you enter null for this value, the start date that you have set for this course is used.
ms_my: Masukkan teks yang anda ingin gunakan sebagai rangka masa permulaan yang diiklankan untuk kursus, seperti "Musim Sejuk 2018". Jika anda memasukkan null untuk nilai ini, tarikh mula yang anda tetapkan untuk kursus ini digunakan.

source: Pre-Requisite Courses
ms_my: Kursus Prasyarat

source: Pre-Requisite Course key if this course has a pre-requisite course
ms_my: Kunci Kursus Pra-Keperluan jika kursus ini mempunyai kursus pra-syarat

source: Grading policy definition for this class
ms_my: Definisi dasar penggredan untuk kelas ini

source: Show Calculator
ms_my: Tunjukkan Kalkulator

source: Enter true or false. When true, students can see the calculator in the course.
ms_my: Masukkan benar atau salah. Apabila benar, pelajar boleh melihat kalkulator dalam kursus.

source: Enter the name of the course as it should appear in the course list.
ms_my: Masukkan nama kursus seperti yang sepatutnya muncul dalam senarai kursus.

source: Course Display Name
ms_my: Nama Paparan Kursus

source: Course Editor
ms_my: Editor Kursus

source: Course Survey URL
ms_my: URL Tinjauan Kursus

source: Enter the URL for the end-of-course survey. If your course does not have a survey, enter null.
ms_my: Masukkan URL untuk tinjauan akhir kursus. Jika kursus anda tidak mempunyai tinjauan, masukkan null.

source: Discussion Blackout Dates
ms_my: Perbincangan Tarikh Blackout

source: Enter pairs of dates between which students cannot post to discussion forums. Inside the provided brackets, enter an additional set of square brackets surrounding each pair of dates you add. Format each pair of dates as ["YYYY-MM-DD", "YYYY-MM-DD"]. To specify times as well as dates, format each pair as ["YYYY-MM-DDTHH:MM", "YYYY-MM-DDTHH:MM"]. Be sure to include the "T" between the date and time. For example, an entry defining two blackout periods looks like this, including the outer pair of square brackets: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]
ms_my: Perbincangan Blackout DatesMasukkan pasangan tarikh yang pelajar tidak boleh hantar ke forum perbincangan. Di dalam kurungan yang disediakan, masukkan set tambahan kurungan persegi yang mengelilingi setiap pasangan tarikh yang anda tambahkan. Formatkan setiap pasangan tarikh sebagai ["YYYY-MM-DD", "YYYY-MM-DD"]. Untuk menentukan masa serta tarikh, formatkan setiap pasangan sebagai ["YYYY-MM-DDTHH:MM", "YYYY-MM-DDTHH:MM"]. Pastikan anda memasukkan "T" antara tarikh dan masa. Contohnya, entri yang mentakrifkan dua tempoh pemadaman kelihatan seperti ini, termasuk pasangan luar kurungan segi empat sama: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]

source: Discussion Topic Mapping
ms_my: Pemetaan Topik Perbincangan

source: Discussions Plugin Settings
ms_my: Tetapan Pemalam Perbincangan

source: Settings for discussions plugins.
ms_my: Tetapan untuk pemalam perbincangan.

source: Course Announcement Date
ms_my: Tarikh Pengumuman Kursus

source: Enter the date to announce your course.
ms_my: Masukkan tarikh untuk mengumumkan kursus anda.

source: Cohort Configuration
ms_my: Konfigurasi Kohort

source: Enter policy keys and values to enable the cohort feature, define automated student assignment to groups, or identify any course-wide discussion topics as private to cohort members.
ms_my: Masukkan kunci dasar dan nilai untuk mendayakan ciri kohort, tentukan tugasan pelajar automatik kepada kumpulan atau kenal pasti sebarang topik perbincangan seluruh kursus sebagai peribadi kepada ahli kohort.

source: Course Is New
ms_my: Kursus Baru

source: Enter true or false. If true, the course appears in the list of new courses, and a New! badge temporarily appears next to the course image.
ms_my: Masukkan benar atau salah. Jika benar, kursus itu muncul dalam senarai kursus baharu, dan kursus Baharu! lencana muncul sementara di sebelah imej kursus.

source: Mobile Course Available
ms_my: Kursus Mudah Alih Tersedia

source: Enter true or false. If true, the course will be available to mobile devices.
ms_my: Masukkan benar atau salah. Jika benar, kursus akan tersedia untuk peranti mudah alih.

source: Video Upload Credentials
ms_my: Bukti Muat Naik Video

source: Enter the unique identifier for your course's video files provided by {platform_name}.
ms_my: Masukkan pengecam unik untuk fail video kursus anda yang disediakan oleh {platform_name}.

source: Course Not Graded
ms_my: Kursus Tidak Digred

source: Enter true or false. If true, the course will not be graded.
ms_my: Masukkan benar atau salah. Jika benar, kursus tidak akan dinilai.

source: Disable Progress Graph
ms_my: Lumpuhkan Graf Kemajuan

source: Enter true or false. If true, students cannot view the progress graph.
ms_my: Masukkan benar atau salah. Jika benar, pelajar tidak boleh melihat graf kemajuan.

source: PDF Textbooks
ms_my: Buku Teks PDF

source: List of dictionaries containing pdf_textbook configuration
ms_my: Senarai kamus yang mengandungi konfigurasi pdf_textbook

source: HTML Textbooks
ms_my: Buku Teks HTML

source: For HTML textbooks that appear as separate tabs in the course, enter the name of the tab (usually the title of the book) as well as the URLs and titles of each chapter in the book.
ms_my: Untuk buku teks HTML yang muncul sebagai tab berasingan dalam kursus, masukkan nama tab (biasanya tajuk buku) serta URL dan tajuk setiap bab dalam buku.

source: Remote Gradebook
ms_my: Buku Gred Jauh

source: Enter the remote gradebook mapping. Only use this setting when REMOTE_GRADEBOOK_URL has been specified.
ms_my: Masukkan pemetaan buku gred jauh. Hanya gunakan tetapan ini apabila REMOTE_GRADEBOOK_URL telah ditentukan.

source: Enable CCX
ms_my: Dayakan CCX

source: Allow course instructors to assign CCX Coach roles, and allow coaches to manage Custom Courses on {platform_name}. When false, Custom Courses cannot be created, but existing Custom Courses will be preserved.
ms_my: Benarkan pengajar kursus menetapkan peranan Jurulatih CCX dan benarkan jurulatih mengurus Kursus Tersuai di {platform_name}. Apabila palsu, Kursus Tersuai tidak boleh dibuat, tetapi Kursus Tersuai sedia ada akan dikekalkan.

source: CCX Connector URL
ms_my: URL Penyambung CCX

source: URL for CCX Connector application for managing creation of CCXs. (optional). Ignored unless 'Enable CCX' is set to 'true'.
ms_my: URL untuk aplikasi Penyambung CCX untuk mengurus penciptaan CCX. (pilihan). Diabaikan melainkan 'Dayakan CCX' ditetapkan kepada 'benar'.

source: Allow Anonymous Discussion Posts
ms_my: Benarkan Siaran Perbincangan Tanpa Nama

source: Enter true or false. If true, students can create discussion posts that are anonymous to all users.
ms_my: Masukkan benar atau salah. Jika benar, pelajar boleh membuat siaran perbincangan yang tidak dikenali kepada semua pengguna.

source: Allow Anonymous Discussion Posts to Peers
ms_my: Benarkan Siaran Perbincangan Tanpa Nama kepada Rakan Sebaya

source: Enter true or false. If true, students can create discussion posts that are anonymous to other students. This setting does not make posts anonymous to course staff.
ms_my: Masukkan benar atau salah. Jika benar, pelajar boleh membuat siaran perbincangan yang tidak dikenali kepada pelajar lain. Tetapan ini tidak menjadikan siaran awanama kepada kakitangan kursus.

source: Advanced Module List
ms_my: Senarai Modul Lanjutan

source: Enter the names of the advanced modules to use in your course.
ms_my: Masukkan nama modul lanjutan untuk digunakan dalam kursus anda.

source: True if timezones should be shown on dates in the course. Deprecated in favor of due_date_display_format.
ms_my: Benar jika zon waktu harus ditunjukkan pada tarikh dalam kursus. Ditamatkan dan memihak kepada format_paparan_ tarikh tamat tempoh.

source: Due Date Display Format
ms_my: Format Paparan Tarikh Akhir

source: External Login Domain
ms_my: Domain Log Masuk Luaran

source: Enter the external login method students can use for the course.
ms_my: Masukkan kaedah log masuk luaran yang boleh digunakan oleh pelajar untuk kursus.

source: Certificates Downloadable Before End
ms_my: Sijil Boleh Muat Turun Sebelum Tamat

source: Enter true or false. If true, students can download certificates before the course ends, if they've met certificate requirements.
ms_my: Masukkan benar atau salah. Jika benar, pelajar boleh memuat turun sijil sebelum kursus tamat, jika mereka telah memenuhi keperluan sijil.

source: Certificates Display Behavior
ms_my: Kelakuan Paparan Sijil

source: This field, together with certificate_available_date will determine when a user can see their certificate for the course
ms_my: Medan ini, bersama-sama dengan certificate_available_date akan menentukan bila pengguna boleh melihat sijil mereka untuk kursus tersebut

source: Course About Page Image
ms_my: Kursus Mengenai Imej Halaman

source: Edit the name of the course image file. You must upload this file on the Files & Uploads page. You can also set the course image on the Settings & Details page.
ms_my: Edit nama fail imej kursus. Anda mesti memuat naik fail ini pada halaman Fail & Muat Naik. Anda juga boleh menetapkan imej kursus pada halaman Tetapan & Butiran.

source: Course Banner Image
ms_my: Imej Sepanduk Kursus

source: Edit the name of the banner image file. You can set the banner image on the Settings & Details page.
ms_my: Edit nama fail imej sepanduk. Anda boleh menetapkan imej sepanduk pada halaman Tetapan & Butiran.

source: Course Video Thumbnail Image
ms_my: Imej Kecil Video Kursus

source: Edit the name of the video thumbnail image file. You can set the video thumbnail image on the Settings & Details page.
ms_my: Edit nama fail imej kecil video. Anda boleh menetapkan imej lakaran kecil video pada halaman Tetapan & Butiran.

source: Certificate Name (Short)
ms_my: Nama Sijil (Pendek)

source: Certificate Name (Long)
ms_my: Nama Sijil (Panjang)

source: Certificate Configuration
ms_my: Konfigurasi Sijil

source: Enter course-specific configuration information here (JSON format)
ms_my: Masukkan maklumat konfigurasi khusus kursus di sini (format JSON)

source: CSS Class for Course Reruns
ms_my: Kelas CSS untuk Tayangan Semula Kursus

source: Allows courses to share the same css class across runs even if they have different numbers.
ms_my: Membenarkan kursus berkongsi kelas css yang sama merentas larian walaupun mereka mempunyai nombor yang berbeza.

source: Discussion Forum External Link
ms_my: Pautan Luar Forum Perbincangan

source: Allows specification of an external link to replace discussion forums.
ms_my: Membenarkan spesifikasi pautan luar menggantikan forum perbincangan.

source: Hide Progress Tab
ms_my: Sembunyikan Tab Kemajuan

source: Allows hiding of the progress tab.
ms_my: Membenarkan menyembunyikan tab kemajuan.

source: Course Organization Display String
ms_my: Rentetan Paparan Organisasi Kursus

source: Enter the course organization that you want to appear in the course. This setting overrides the organization that you entered when you created the course. To use the organization that you entered when you created the course, enter null.
ms_my: Masukkan organisasi kursus yang anda mahu muncul dalam kursus. Tetapan ini mengatasi organisasi yang anda masukkan semasa anda membuat kursus. Untuk menggunakan organisasi yang anda masukkan semasa anda membuat kursus, masukkan null.

source: Course Number Display String
ms_my: Rentetan Paparan Nombor Kursus

source: Enter the course number that you want to appear in the course. This setting overrides the course number that you entered when you created the course. To use the course number that you entered when you created the course, enter null.
ms_my: Masukkan nombor kursus yang anda mahu muncul dalam kursus. Tetapan ini mengatasi nombor kursus yang anda masukkan semasa anda membuat kursus. Untuk menggunakan nombor kursus yang anda masukkan semasa anda mencipta kursus, masukkan nol.

source: Course Maximum Student Enrollment
ms_my: Pendaftaran Pelajar Maksimum Kursus

source: Enter the maximum number of students that can enroll in the course. To allow an unlimited number of students, enter null.
ms_my: Masukkan bilangan maksimum pelajar yang boleh mendaftar dalam kursus. Untuk membenarkan bilangan pelajar yang tidak terhad, masukkan null.

source: Allow Public Wiki Access
ms_my: Benarkan Akses Wiki Awam

source: Enter true or false. If true, students can view the course wiki even if they're not enrolled in the course.
ms_my: Masukkan benar atau salah. Jika benar, pelajar boleh melihat wiki kursus walaupun mereka tidak mendaftar dalam kursus.

source: Invitation Only
ms_my: Jemputan Sahaja

source: Whether to restrict enrollment to invitation by the course staff.
ms_my: Sama ada untuk mengehadkan pendaftaran kepada jemputan oleh kakitangan kursus.

source: Pre-Course Survey Name
ms_my: Nama Tinjauan Pra-Kursus

source: Name of SurveyForm to display as a pre-course survey to the user.
ms_my: Nama Borang Tinjauan untuk dipaparkan sebagai tinjauan pra-kursus kepada pengguna.

source: Pre-Course Survey Required
ms_my: Tinjauan Pra-Kursus Diperlukan

source: Specify whether students must complete a survey before they can view your course content. If you set this value to true, you must add a name for the survey to the Course Survey Name setting above.
ms_my: Tentukan sama ada pelajar mesti melengkapkan tinjauan sebelum mereka boleh melihat kandungan kursus anda. Jika anda menetapkan nilai ini kepada benar, anda mesti menambah nama untuk tinjauan pada tetapan Nama Tinjauan Kursus di atas.

source: Course Visibility In Catalog
ms_my: Keterlihatan Kursus Dalam Katalog

source: Entrance Exam Enabled
ms_my: Peperiksaan Kemasukan Didayakan

source: Specify whether students must complete an entrance exam before they can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
ms_my: Tentukan sama ada pelajar mesti melengkapkan peperiksaan kemasukan sebelum mereka boleh melihat kandungan kursus anda. Ambil perhatian, anda mesti mendayakan Peperiksaan Kemasukan untuk tetapan kursus ini berkuat kuasa.

source: Entrance Exam Minimum Score (%)
ms_my: Markah Minimum Peperiksaan Kemasukan (%)

source: Specify a minimum percentage score for an entrance exam before students can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
ms_my: Tentukan markah peratusan minimum untuk peperiksaan kemasukan sebelum pelajar boleh melihat kandungan kursus anda. Ambil perhatian, anda mesti mendayakan Peperiksaan Kemasukan untuk tetapan kursus ini berkuat kuasa.

source: Entrance Exam ID
ms_my: ID Peperiksaan Kemasukan

source: Content block identifier (location) of entrance exam.
ms_my: Pengecam blok kandungan (lokasi) peperiksaan kemasukan.

source: Social Media Sharing URL
ms_my: URL Perkongsian Media Sosial

source: If dashboard social sharing and custom course URLs are enabled, you can provide a URL (such as the URL to a course About page) that social media sites can link to. URLs must be fully qualified. For example: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
ms_my: Jika perkongsian sosial papan pemuka dan URL kursus tersuai didayakan, anda boleh menyediakan URL (seperti URL ke halaman Perihal kursus) yang boleh dipautkan oleh tapak media sosial. URL mesti memenuhi syarat sepenuhnya. Contohnya: http://www.edx.org/course/Introduction-to-MOOCs-ITM001

source: Course Language
ms_my: Bahasa Kursus

source: Specify the language of your course.
ms_my: Nyatakan bahasa kursus anda.

source: Teams Configuration
ms_my: Konfigurasi Pasukan

source: Enable Proctored Exams
ms_my: Dayakan Peperiksaan Berkawal

source: Enter true or false. If this value is true, proctored exams are enabled in your course. Note that enabling proctored exams will also enable timed exams.
ms_my: Masukkan benar atau salah. Jika nilai ini benar, peperiksaan terkawal didayakan dalam kursus anda. Ambil perhatian bahawa mendayakan peperiksaan terkawal juga akan membolehkan peperiksaan bermasa.

source: Proctoring Provider
ms_my: Pembekal Proctoring

source: Enter the proctoring provider you want to use for this course run. Choose from the following options: {available_providers}.
ms_my: Masukkan pembekal pengawas yang anda mahu gunakan untuk kursus ini dijalankan. Pilih daripada pilihan berikut: {available_providers}.

source: Proctortrack Exam Escalation Contact
ms_my: Hubungan Peningkatan Peperiksaan Proctortrack

source: Allow Opting Out of Proctored Exams
ms_my: Benarkan Menarik Diri daripada Peperiksaan Dilindungi

source: Enter true or false. If this value is true, learners can choose to take proctored exams without proctoring. If this value is false, all learners must take the exam with proctoring. This setting only applies if proctored exams are enabled for the course.
ms_my: Masukkan benar atau salah. Jika nilai ini benar, pelajar boleh memilih untuk mengambil peperiksaan terkawal tanpa mengawasi. Jika nilai ini palsu, semua pelajar mesti mengambil peperiksaan dengan mengawasi. Tetapan ini hanya terpakai jika peperiksaan terkawal didayakan untuk kursus.

source: Create Zendesk Tickets For Suspicious Proctored Exam Attempts
ms_my: Cipta Tiket Zendesk Untuk Percubaan Peperiksaan Berkawal Mencurigakan

source: Enter true or false. If this value is true, a Zendesk ticket will be created for suspicious attempts.
ms_my: Masukkan benar atau salah. Jika nilai ini benar, tiket Zendesk akan dibuat untuk percubaan yang mencurigakan.

source: Enable Timed Exams
ms_my: Dayakan Peperiksaan Bermasa

source: Enter true or false. If this value is true, timed exams are enabled in your course. Regardless of this setting, timed exams are enabled if Enable Proctored Exams is set to true.
ms_my: Masukkan benar atau salah. Jika nilai ini benar, peperiksaan bermasa didayakan dalam kursus anda. Tanpa mengira tetapan ini, peperiksaan bermasa didayakan jika Dayakan Peperiksaan Dilindungi ditetapkan kepada benar.

source: Minimum Grade for Credit
ms_my: Gred Minimum untuk Kredit

source: The minimum grade that a learner must earn to receive credit in the course, as a decimal between 0.0 and 1.0. For example, for 75%, enter 0.75.
ms_my: Gred minimum yang pelajar mesti peroleh untuk menerima kredit dalam kursus, sebagai perpuluhan antara 0.0 dan 1.0. Sebagai contoh, untuk 75%, masukkan 0.75.

source: Enable Subsection Prerequisites
ms_my: Dayakan Prasyarat Subseksyen
