Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Sign Up for {platform_name}
ms_my: Daftar untuk {platform_name}

source: e.g. yourname@domain.com
ms_my: cth. yourname@domain.com

source: e.g. yourname (shown on forums)
ms_my: cth. nama anda (ditunjukkan di forum)

source: e.g. Your Name (for certificates)
ms_my: cth. Nama Anda (untuk sijil)

source: {start_li}Welcome{end_li} {name}
ms_my: {start_li}Selamat datang{end_li} {name}

source: Enter a public username:
ms_my: Masukkan nama pengguna awam:

source: Full Name *
ms_my: Nama Penuh *

source: Ed. Completed
ms_my: Ed. Selesai

source: Goals in signing up for {platform_name}
ms_my: Matlamat dalam mendaftar untuk {platform_name}

source: I agree to the {link_start}Terms of Service{link_end}
ms_my: Saya bersetuju menerima {link_start}Syarat Perkhidmatan{link_end}

source: I agree to the {link_start}Honor Code{link_end}
ms_my: Saya bersetuju menerima {link_start}Kod Kehormatan{link_end}

source: Create My Account
ms_my: Cipta Akaun Saya

source: Already have an account?
ms_my: Sudah mempunyai akaun?

source: Login.
ms_my: Log masuk.

source: Active Groups
ms_my: Kumpulan Aktif

source: Inactive Groups
ms_my: Kumpulan Tidak Aktif

source: Staff Debug Info
ms_my: Maklumat Nyahpepijat Kakitangan

source: Submission history
ms_my: Sejarah penyerahan

source: {platform_name} Content Quality Assessment
ms_my: {platform_name} Penilaian Kualiti Kandungan

source: Comment
ms_my: Komen

source: comment
ms_my: komen

source: Add comment
ms_my: Tambah komen

source: Staff Debug:
ms_my: Nyahpepijat Kakitangan:

source: Score (for override only)
ms_my: Skor (untuk menimpa sahaja)

source: Reset Learner's Attempts to Zero
ms_my: Tetapkan Semula Percubaan Pelajar kepada Sifar

source: Delete Learner's State
ms_my: Padamkan Keadaan Pelajar

source: Rescore Learner's Submission
ms_my: Rescore Penyerahan Pelajar

source: Rescore Only If Score Improves
ms_my: Skor semula Hanya Jika Markah Bertambah

source: Override Score
ms_my: Mengatasi Skor

source: Module Fields
ms_my: Medan Modul

source: XML attributes
ms_my: Atribut XML

source: Submission History Viewer
ms_my: Pemapar Sejarah Penyerahan

source: Learner's {platform_name} email address or username:
ms_my: Alamat e-mel atau nama pengguna {platform_name} pelajar:

source: Enter the learner email address or username
ms_my: Masukkan alamat e-mel atau nama pengguna pelajar

source: View History
ms_my: Lihat Sejarah

source: {course_number} Textbook
ms_my: {course_number} Buku teks

source: Textbook Navigation
ms_my: Navigasi Buku Teks

source: Page
ms_my: Halaman

source: Previous page
ms_my: Halaman sebelumnya

source: Next page
ms_my: Halaman seterusnya

source: Paste Component
ms_my: Komponen Tampal

source: From:
ms_my: Daripada:

source: What's in my clipboard?
ms_my: Apa yang ada dalam papan keratan saya?

source: Tracking Log
ms_my: Log Penjejakan

source: datetime
ms_my: tarikh masa

source: source
ms_my: sumber

source: type
ms_my: menaip

source: Unsubscribe Successful!
ms_my: Berjaya berhenti melanggan!

source: You will no longer receive forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}. If you did not mean to do this, {undo_link_start}you can re-subscribe{link_end}.
ms_my: Anda tidak lagi akan menerima e-mel pemberitahuan forum daripada {platform_name}. Anda boleh {dashboard_link_start}kembali ke papan pemuka anda{link_end}. Jika anda tidak berniat untuk melakukan ini, {undo_link_start}anda boleh melanggan semula{link_end}.

source: Dashboard for:
ms_my: Papan pemuka untuk:

source: Usermenu
ms_my: Menu pengguna

source: More options
ms_my: Lebih banyak pilihan

source: More Options
ms_my: Lebih Banyak Pilihan

source: Using the system
ms_my: Menggunakan sistem

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
ms_my: Semasa main balik video, gunakan sari kata dan bar skrol untuk menavigasi. Mengklik sari kata ialah cara pantas untuk melangkau ke hadapan dan ke belakang dengan jumlah yang kecil.

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
ms_my: Jika anda berada pada paparan resolusi rendah, bar navigasi kiri boleh disembunyikan dengan mengklik pada set tiga anak panah kiri di sebelahnya.

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
ms_my: Jika anda memerlukan fon yang lebih besar atau lebih kecil, gunakan tetapan penyemak imbas anda untuk menaikkan atau menurunkannya. Di bawah Google Chrome, ini dilakukan dengan menekan ctrl-plus, atau ctrl-tolak pada masa yang sama.

source: Due {date}
ms_my: Tarikh akhir {date}

source: Past due
ms_my: Lewat tempoh masa

source: Reset Problems
ms_my: Tetapkan Semula Masalah

source: Loading video player
ms_my: Memuatkan pemain video

source: Play video
ms_my: Mainkan video

source: No playable video sources found.
ms_my: Tiada sumber video yang boleh dimainkan ditemui.

source: Your browser does not support this video format. Try using a different browser.
ms_my: Penyemak imbas anda tidak menyokong format video ini. Cuba gunakan pelayar lain.

source: Downloads and transcripts
ms_my: Muat turun dan transkrip

source: Download video file
ms_my: Muat turun fail video

source: Share this video
ms_my: Kongsi video ini

source: Share on {site}
ms_my: Kongsi di {site}

source: Copy
ms_my: salin

source: Transcripts
ms_my: Transkrip

source: Download {file}
ms_my: Muat turun {file}

source: Download transcript
ms_my: Muat turun transkrip

source: Handouts
ms_my: Edaran

source: How is the transcript quality ?
ms_my: Bagaimanakah kualiti transkrip?

source: {num} of {total}
ms_my: {number} daripada {total}

source: Your words were:
ms_my: Kata-kata anda ialah:

source: API Access Request
ms_my: Permintaan Akses API

source: {platform_name} API Access Request
ms_my: Permintaan Akses API {platform_name}.

source: Request API Access
ms_my: Minta Akses API

source: API Access Request Status
ms_my: Status Permintaan Akses API

source: Your request to access the {platform_name} Course Catalog API is being processed. You will receive a message at the email address in your profile when processing is complete. You can also return to this page to see the status of your API access request.
ms_my: Permintaan anda untuk mengakses API Katalog Kursus {platform_name} sedang diproses. Anda akan menerima mesej di alamat e-mel dalam profil anda apabila pemprosesan selesai. Anda juga boleh kembali ke halaman ini untuk melihat status permintaan akses API anda.

source: Your request to access the {platform_name} Course Catalog API has been denied. If you think this is an error, or for other questions about using this API, contact {api_support_email_link}.
ms_my: Permintaan anda untuk mengakses API Katalog Kursus {platform_name} telah ditolak. Jika anda rasa ini ralat atau untuk soalan lain tentang menggunakan API ini, hubungi {api_support_email_link}.

source: Your request to access the {platform_name} Course Catalog API has been approved.
ms_my: Permintaan anda untuk mengakses API Katalog Kursus {platform_name} telah diluluskan.

source: Application Name
ms_my: Nama Permohonan

source: API Client ID
ms_my: ID Pelanggan API

source: API Client Secret
ms_my: Rahsia Pelanggan API

source: Redirect URLs
ms_my: Ubah hala URL

source: If you would like to regenerate your API client information, please use the form below.
ms_my: Jika anda ingin menjana semula maklumat klien API anda, sila gunakan borang di bawah.

source: Generate API client credentials
ms_my: Hasilkan bukti kelayakan pelanggan API

source: To learn more about the {platform_name} Course Catalog API, visit {link_start}our API documentation page{link_end}. For questions about using this API, contact {api_support_email_link}.
ms_my: Untuk mengetahui lebih lanjut tentang API Katalog Kursus {platform_name}, lawati {link_start}halaman dokumentasi API kami{link_end}. Untuk pertanyaan tentang menggunakan API ini, hubungi {api_support_email_link}.

source: API Terms of Service
ms_my: Syarat Perkhidmatan API

source: Terms of Service for {platform_name} APIs
ms_my: Syarat Perkhidmatan untuk API {platform_name}.

source: Effective Date: May 24th, 2018
ms_my: Tarikh Berkuatkuasa: 24 Mei 2018

source: API Access
ms_my: Akses API

source: To access the APIs, you will need to create an {platform_name} user account for your application (not for personal use). This account will provide you with access to our API request page at {request_url}. On that page, you must complete the API request form including a description of your proposed uses for the APIs. Any account and registration information that you provide to {platform_name} must be accurate and up to date, and you agree to inform us promptly of any changes. {platform_name_capitalized} will review your API request form and, upon approval in {platform_name}'s sole discretion, will provide you with instructions for obtaining your API shared secret and client ID.
ms_my: Untuk mengakses API, anda perlu membuat akaun pengguna {platform_name} untuk aplikasi anda (bukan untuk kegunaan peribadi). Akaun ini akan memberi anda akses kepada halaman permintaan API kami di {request_url}. Pada halaman itu, anda mesti melengkapkan borang permintaan API termasuk perihalan penggunaan cadangan anda untuk API. Sebarang maklumat akaun dan pendaftaran yang anda berikan kepada {platform_name} mestilah tepat dan terkini, dan anda bersetuju untuk memaklumkan kami dengan segera tentang sebarang perubahan. {platform_name_capitalized} akan menyemak borang permintaan API anda dan, setelah diluluskan mengikut budi bicara mutlak {platform_name}, akan memberikan anda arahan untuk mendapatkan rahsia kongsi API dan ID pelanggan anda.

source: Permissible Use
ms_my: Penggunaan yang dibenarkan

source: Prohibited Uses and Activities
ms_my: Penggunaan dan Aktiviti Terlarang

source: {platform_name_capitalized} shall have the sole right to determine whether or not any given use of the APIs is acceptable, and {platform_name} reserves the right to revoke API access for any use that {platform_name} determines at any time, in its sole discretion, does not benefit or serve the best interests of {platform_name}, its users and its partners.
ms_my: {platform_name_capitalized} mempunyai hak tunggal untuk menentukan sama ada mana-mana penggunaan API boleh diterima atau tidak, dan {platform_name} berhak untuk membatalkan akses API untuk sebarang penggunaan yang ditentukan oleh {platform_name} pada bila-bila masa, mengikut budi bicara mutlaknya, tidak memberi manfaat atau memberi manfaat kepada {platform_name}, pengguna dan rakan kongsinya.

source: The following activities are not acceptable when using the APIs (this is not an exhaustive list):
ms_my: Aktiviti berikut tidak boleh diterima apabila menggunakan API (ini bukan senarai lengkap):

source: collecting or storing the names, passwords, or other credentials of {platform_name} users;
ms_my: mengumpul atau menyimpan nama, kata laluan atau bukti kelayakan lain pengguna {platform_name};

source: scraping or similar techniques to aggregate or otherwise create permanent copies of API Content;
ms_my: mengikis atau teknik serupa untuk mengagregat atau sebaliknya mencipta salinan kekal Kandungan API;

source: violating, misappropriating or infringing any copyright, trademark rights, rights of privacy or publicity, confidential information or any other right of any third party;
ms_my: melanggar, menyalahgunakan atau melanggar mana-mana hak cipta, hak tanda dagangan, hak privasi atau publisiti, maklumat sulit atau mana-mana hak lain mana-mana pihak ketiga;

source: altering or editing any content or graphics in the API Content;
ms_my: mengubah atau menyunting sebarang kandungan atau grafik dalam Kandungan API;

source: altering or removing any trademark, copyright or other proprietary or legal notices contained in, or appearing on, the APIs or any API Content;
ms_my: mengubah atau mengalih keluar sebarang tanda dagangan, hak cipta atau notis proprietari atau undang-undang lain yang terkandung dalam, atau muncul pada, API atau mana-mana Kandungan API;

source: sublicensing, re-distributing, renting, selling or leasing access to the APIs or your client secret to any third party;
ms_my: mensublesenkan, mengedar semula, menyewa, menjual atau memajak akses kepada API atau rahsia pelanggan anda kepada mana-mana pihak ketiga;

source: distributing any virus, Trojan horse, spyware, adware, malware, bot, time bomb, worm, or other harmful or malicious component; or
ms_my: mengedarkan sebarang virus, kuda Trojan, perisian pengintip, perisian iklan, perisian hasad, bot, bom jangka, cecacing atau komponen berbahaya atau berniat jahat yang lain; atau

source: using the APIs for any purpose which or might overburden, impair or disrupt the {platform_name} platform, servers or networks.
ms_my: menggunakan API untuk sebarang tujuan yang atau mungkin membebankan, menjejaskan atau mengganggu platform, pelayan atau rangkaian {platform_name}.

source: Usage and Quotas
ms_my: Penggunaan dan Kuota

source: {platform_name_capitalized} reserves the right, in its discretion, to impose reasonable restrictions and limitations on the number and frequency of calls made by you or Your Application to the APIs. You must not attempt to circumvent any restrictions or limitations imposed by {platform_name}.
ms_my: {platform_name_capitalized} berhak, mengikut budi bicaranya, untuk mengenakan sekatan dan had yang munasabah ke atas bilangan dan kekerapan panggilan yang dibuat oleh anda atau Permohonan Anda kepada API. Anda tidak boleh cuba memintas sebarang sekatan atau pengehadan yang dikenakan oleh {platform_name}.

source: Compliance
ms_my: Pematuhan

source: You agree to comply with all applicable laws, regulations, and third party rights (including without limitation laws regarding the import or export of data or software, privacy, copyright, and local laws). You will not use the APIs to encourage or promote illegal activity or violation of third party rights. You will not violate any other terms of service with {platform_name}. You will only access (or attempt to access) an API by the means described in the documentation of that API. You will not misrepresent or mask either your identity or Your Application's identity when using the APIs.
ms_my: Anda bersetuju untuk mematuhi semua undang-undang, peraturan dan hak pihak ketiga yang terpakai (termasuk tanpa had undang-undang mengenai import atau eksport data atau perisian, privasi, hak cipta dan undang-undang tempatan). Anda tidak akan menggunakan API untuk menggalakkan atau mempromosikan aktiviti haram atau pelanggaran hak pihak ketiga. Anda tidak akan melanggar mana-mana syarat perkhidmatan lain dengan {platform_name}. Anda hanya akan mengakses (atau cuba mengakses) API dengan cara yang diterangkan dalam dokumentasi API tersebut. Anda tidak akan salah nyata atau menyembunyikan sama ada identiti anda atau identiti Aplikasi Anda apabila menggunakan API.

source: Ownership
ms_my: Pemilikan

source: You acknowledge and agree that the APIs and all API Content contain valuable intellectual property of {platform_name} and its partners. The APIs and all API Content are protected by United States and foreign copyright, trademark, and other laws. All rights in the APIs and the API Content, if not expressly granted, are reserved. By using the APIs or any API Content, you do not acquire ownership of any rights in the APIs or API Content. You must not claim or attempt to claim ownership in the APIs or any API Content or misrepresent yourself or your company or your Application as being the source of any API Content. You may not modify, create derivative works of, or attempt to use, license, or in any way exploit any API Content in whole or in part on your own behalf or on behalf of any third party. You may not distribute or modify the APIs or any API Content (including adaptation, editing, excerpting, or creating derivative works).
ms_my: Anda mengakui dan bersetuju bahawa API dan semua Kandungan API mengandungi harta intelek berharga {platform_name} dan rakan kongsinya. API dan semua Kandungan API dilindungi oleh undang-undang Amerika Syarikat dan hak cipta asing, tanda dagangan dan undang-undang lain. Semua hak dalam API dan Kandungan API, jika tidak diberikan secara nyata, adalah terpelihara. Dengan menggunakan API atau mana-mana Kandungan API, anda tidak memperoleh pemilikan sebarang hak dalam API atau Kandungan API. Anda tidak boleh menuntut atau cuba menuntut pemilikan dalam API atau mana-mana Kandungan API atau menyalahgambarkan diri anda atau syarikat anda atau Aplikasi anda sebagai sumber mana-mana Kandungan API. Anda tidak boleh mengubah suai, mencipta karya terbitan, atau cuba menggunakan, melesenkan, atau dalam apa-apa cara mengeksploitasi mana-mana Kandungan API secara keseluruhan atau sebahagiannya bagi pihak anda sendiri atau bagi pihak mana-mana pihak ketiga. Anda tidak boleh mengedarkan atau mengubah suai API atau mana-mana Kandungan API (termasuk penyesuaian, penyuntingan, petikan atau mencipta karya terbitan).

source: To the extent that you submit any content to {platform_name} in connection with your use of the APIs or any API Content, you hereby grant to {platform_name} a worldwide, non-exclusive, transferable, assignable, sub licensable, fully paid-up, royalty-free, perpetual, irrevocable right and license to host, transfer, display, perform, reproduce, modify, distribute, re-distribute, relicense and otherwise use, make available and exploit such content, in whole or in part, in any form and in any media formats and through any media channels (now known or hereafter developed).
ms_my: Setakat anda menyerahkan apa-apa kandungan kepada {platform_name} berkaitan dengan penggunaan API atau mana-mana Kandungan API anda, anda dengan ini memberikan kepada {platform_name} hak di seluruh dunia, tidak eksklusif, boleh dipindah milik, boleh diserah hak, sublesen, berbayar penuh, bebas royalti, kekal, tidak boleh ditarik balik hak dan lesen untuk mengehoskan, memindahkan, mempamerkan, mengedarkan, mengedar semula, menggunakan cara lain, menyediakan dan mengeksploitasi kandungan tersebut, secara keseluruhan atau sebahagian, dalam sebarang bentuk dan dalam sebarang format media dan melalui mana-mana saluran media (kini dikenali atau dibangunkan selepas ini).

source: Privacy
ms_my: Privasi

source: You agree to comply with all applicable privacy laws and regulations and to be transparent with respect to any collection and use of end user data. You will provide and adhere to a privacy policy for Your Application that clearly and accurately describes to your end users what user information you collect and how you may use and share such information (including for advertising) with {platform_name} and other third parties.
ms_my: Anda bersetuju untuk mematuhi semua undang-undang dan peraturan privasi yang terpakai dan telus berkenaan dengan sebarang pengumpulan dan penggunaan data pengguna akhir. Anda akan memberikan dan mematuhi dasar privasi untuk Aplikasi Anda yang menerangkan dengan jelas dan tepat kepada pengguna akhir anda maklumat pengguna yang anda kumpulkan dan cara anda boleh menggunakan dan berkongsi maklumat tersebut (termasuk untuk pengiklanan) dengan {platform_name} dan pihak ketiga yang lain.

source: Right to Charge
ms_my: Hak untuk Dikenakan

source: Certain access to the APIs may be provided free of charge, but {platform_name} reserves the right to charge fees for future use or access to the APIs.
ms_my: Akses tertentu kepada API mungkin diberikan secara percuma, tetapi {platform_name} berhak untuk mengenakan bayaran untuk kegunaan masa hadapan atau akses kepada API.

source: {platform_name_capitalized} reserves the right to modify the Terms at any time without advance notice. Any changes to the Terms will be effective immediately upon posting on this page, with an updated effective date. By accessing or using the APIs after any changes have been made, you signify your agreement on a prospective basis to the modified Terms and all of the changes. Be sure to return to this page periodically to ensure familiarity with the most current version of the Terms.
ms_my: {platform_name_capitalized} berhak untuk mengubah suai Syarat pada bila-bila masa tanpa notis awal. Sebarang perubahan kepada Terma akan berkuat kuasa serta-merta selepas disiarkan di halaman ini, dengan tarikh berkuat kuasa yang dikemas kini. Dengan mengakses atau menggunakan API selepas sebarang perubahan dibuat, anda menandakan persetujuan anda secara prospektif kepada Syarat yang diubah suai dan semua perubahan. Pastikan anda kembali ke halaman ini secara berkala untuk memastikan kebiasaan dengan versi Terma terkini.

source: {platform_name_capitalized} may also update or modify the APIs from time to time without advance notice. These changes may affect your use of the APIs or the way your integration interacts with the API. If we make a change that is unacceptable to you, you should stop using the APIs. Continued use of the APIs means you accept the change.
ms_my: {platform_name_capitalized} juga boleh mengemas kini atau mengubah suai API dari semasa ke semasa tanpa notis awal. Perubahan ini boleh menjejaskan penggunaan API anda atau cara penyepaduan anda berinteraksi dengan API. Jika kami membuat perubahan yang tidak boleh diterima oleh anda, anda harus berhenti menggunakan API. Penggunaan API yang berterusan bermakna anda menerima perubahan tersebut.

source: Confidentiality
ms_my: Kerahsiaan

source: Your credentials (such as client secret and IDs) are intended to be used solely by you. You will keep your credentials confidential and prevent and discourage others from using your credentials. Your credentials may not be embedded in open source projects.
ms_my: Bukti kelayakan anda (seperti rahsia pelanggan dan ID) bertujuan untuk digunakan oleh anda semata-mata. Anda akan merahsiakan bukti kelayakan anda dan menghalang serta tidak menggalakkan orang lain menggunakan bukti kelayakan anda. Bukti kelayakan anda mungkin tidak dibenamkan dalam projek sumber terbuka.

source: Disclaimer of Warranty / Limitation of Liabilities
ms_my: Penafian Waranti / Had Liabiliti

source: {platform_name} AND THE {platform_name} PARTICIPANTS DO NOT WARRANT THAT THE APIS WILL OPERATE IN AN UNINTERRUPTED OR ERROR-FREE MANNER, THAT THE APIS ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT THE APIS OR API CONTENT PROVIDED WILL MEET YOUR NEEDS OR EXPECTATIONS. {platform_name} AND THE {platform_name} PARTICIPANTS ALSO MAKE NO WARRANTY ABOUT THE ACCURACY, COMPLETENESS, TIMELINESS, OR QUALITY OF THE APIS OR ANY API CONTENT, OR THAT ANY PARTICULAR API CONTENT WILL CONTINUE TO BE MADE AVAILABLE.
ms_my: {platform_name} DAN PESERTA {platform_name} TIDAK MENJAMIN BAHAWA API AKAN BEROPERASI DENGAN CARA TANPA GANGGUAN ATAU TANPA RALAT, BAHAWA API ADALAH BEBAS VIRUS ATAU KOMPONEN BERBAHAYA LAIN, ATAU BAHAWA API ATAU KANDUNGAN API AKAN MENYEDIAKAN ANDA. {platform_name} DAN PESERTA {platform_name} JUGA TIDAK MEMBUAT JAMINAN TENTANG KEJADIAN, KESEMPATAN, KETEPATAN MASA ATAU KUALITI API ATAU SEBARANG KANDUNGAN API ATAU BAHAWA SEBARANG KANDUNGAN API TERTENTU AKAN TERUS DISEDIAKAN.
