Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
ms_my: Jika anda tidak meminta perubahan ini, anda boleh mengabaikan e-mel ini - kami belum menetapkan semula kata laluan anda.

source: Email Change
ms_my: Tukar E-mel

source: Confirm Email Change
ms_my: Sahkan Perubahan E-mel

source: We keep a log of old e-mails, so if this request was unintentional, we can investigate.
ms_my: Kami menyimpan log e-mel lama, jadi jika permintaan ini tidak disengajakan, kami boleh menyiasat.

source: Thank you,
ms_my: terima kasih,

source: The %(platform_name)s Team
ms_my: Pasukan %(platform_name)s

source: You are enrolled in %(course_name)s at %(platform_name)s. This course contains proctored exams.
ms_my: Anda telah mendaftar dalam %(course_name)s di %(platform_name)s. Kursus ini mengandungi peperiksaan terkawal.

source: Proctored exams are timed exams that you take while proctoring software monitors your computer's desktop, webcam video, and audio. Your course uses %(proctoring_provider)s software for proctoring.
ms_my: Peperiksaan berjaga-jaga ialah peperiksaan bermasa yang anda ambil semasa perisian proktor memantau desktop komputer anda, video kamera web dan audio. Kursus anda menggunakan perisian %(proctoring_provider)s untuk proctoring.

source: Carefully review the system requirements as well as the steps to take a proctored exam in order to ensure that you are prepared.
ms_my: Semak dengan teliti keperluan sistem serta langkah-langkah untuk mengambil peperiksaan terkawal bagi memastikan anda bersedia.

source: To view proctoring instructions and requirements, please visit: %(proctoring_requirements_url)s
ms_my: Untuk melihat arahan dan keperluan proctoring, sila lawati: %(proctoring_requirements_url)s

source: This email was automatically sent from %(platform_name)s to %(full_name)s.
ms_my: E-mel ini dihantar secara automatik daripada %(platform_name)s kepada %(full_name)s.

source: Proctoring requirements for %(course_name)s
ms_my: Keperluan perlindungan untuk %(course_name)s

source: Create Recovery Email
ms_my: Cipta E-mel Pemulihan

source: If you set this email address, click "confirm email." If you didn't request this change, you can disregard this email.
ms_my: Jika anda menetapkan alamat e-mel ini, klik "sahkan e-mel." Jika anda tidak meminta perubahan ini, anda boleh mengabaikan e-mel ini.

source: Confirm Email
ms_my: Sahkan E-mel

source: Completed the course "{course_name}" ({course_mode}, {start_date} - {end_date})
ms_my: Telah melengkapkan kursus "{course_name}" ({course_mode}, {start_date} - {end_date})

source: Completed the course "{course_name}" ({course_mode})
ms_my: Telah melengkapkan kursus "{course_name}" ({course_mode})

source: The badge image must be square.
ms_my: Imej lencana mestilah segi empat sama.

source: The badge image file size must be less than 250KB.
ms_my: Saiz fail imej lencana mestilah kurang daripada 250KB.

source: This value must be all lowercase.
ms_my: Nilai ini mestilah semua huruf kecil.

source: Take free online courses at edX.org
ms_my: Ambil kursus dalam talian percuma di edX.org

source: © {org_name}. All rights reserved except where noted. edX, Open edX and their respective logos are registered trademarks of edX Inc.
ms_my: © {org_name}. Semua hak terpelihara kecuali jika dinyatakan. edX, Open edX dan logo masing-masing adalah tanda dagangan berdaftar edX Inc.

source: Powered by Open edX
ms_my: Dikuasakan oleh Open edX

source: Contact Us
ms_my: Hubungi Kami

source: Help Center
ms_my: Pusat Bantuan

source: Security
ms_my: Keselamatan

source: Media Kit
ms_my: Kit Media

source: Donate
ms_my: Menderma

source: About
ms_my: Tentang

source: {platform_name} for Business
ms_my: {platform_name} untuk Perniagaan

source: Contact
ms_my: Kenalan

source: Careers
ms_my: Kerjaya

source: News
ms_my: Berita

source: Terms of Service & Honor Code
ms_my: Syarat Perkhidmatan & Kod Kehormat

source: Privacy Policy
ms_my: Dasar Privasi

source: Accessibility Policy
ms_my: Dasar Kebolehcapaian

source: Terms of Service
ms_my: Syarat Perkhidmatan

source: Sitemap
ms_my: Peta laman

source: Affiliates
ms_my: Ahli gabungan

source: Open edX
ms_my: Buka edX

source: Cookie Policy
ms_my: Dasar Kuki

source: Your Privacy Choices
ms_my: Pilihan Privasi Anda

source: Trademark Policy
ms_my: Dasar Tanda Dagangan

source: Download the {platform_name} mobile app from the Apple App Store
ms_my: Muat turun apl mudah alih {platform_name} daripada Apple App Store

source: Download the {platform_name} mobile app from Google Play
ms_my: Muat turun apl mudah alih {platform_name} daripada Google Play

source: "{course_title}" Course Staff
ms_my: Kakitangan Kursus "{course_title}".

source: CCX Coach
ms_my: Jurulatih CCX

source: A CCX can only be created on this course through an external service. Contact a course admin to give you access.
ms_my: CCX hanya boleh dibuat pada kursus ini melalui perkhidmatan luaran. Hubungi pentadbir kursus untuk memberi anda akses.

source: The course is full: the limit is {max_student_enrollments_allowed}
ms_my: Kursus ini penuh: hadnya ialah {max_student_enrollments_allowed}

source: You must be a CCX Coach to access this view.
ms_my: Anda mesti menjadi Jurulatih CCX untuk mengakses paparan ini.

source: You must be the coach for this ccx to access this view
ms_my: Anda mesti menjadi jurulatih untuk ccx ini untuk mengakses paparan ini

source: You cannot create a CCX from a course using a deprecated id. Please create a rerun of this course in the studio to allow this action.
ms_my: Anda tidak boleh membuat CCX daripada kursus menggunakan id yang tidak digunakan. Sila buat tayangan semula kursus ini di studio untuk membenarkan tindakan ini.

source: regenerated
ms_my: dijana semula

source: generated
ms_my: dihasilkan

source: All learners
ms_my: Semua pelajar

source: For exceptions
ms_my: Untuk pengecualian

source: A human-readable description of the example certificate. For example, 'verified' or 'honor' to differentiate between two types of certificates.
ms_my: Perihalan sijil contoh yang boleh dibaca manusia. Sebagai contoh, 'disahkan' atau 'penghormatan' untuk membezakan antara dua jenis sijil.

source: A unique identifier for the example certificate. This is used when we receive a response from the queue to determine which example certificate was processed.
ms_my: Pengecam unik untuk sijil contoh. Ini digunakan apabila kami menerima respons daripada baris gilir untuk menentukan sijil contoh yang telah diproses.

source: An access key for the example certificate. This is used when we receive a response from the queue to validate that the sender is the same entity we asked to generate the certificate.
ms_my: Kunci akses untuk sijil contoh. Ini digunakan apabila kami menerima respons daripada baris gilir untuk mengesahkan bahawa pengirim adalah entiti yang sama yang kami minta untuk menjana sijil.

source: The full name that will appear on the certificate.
ms_my: Nama penuh yang akan tertera pada sijil.

source: The template file to use when generating the certificate.
ms_my: Fail templat untuk digunakan semasa menjana sijil.

source: The status of the example certificate.
ms_my: Status sijil contoh.

source: The reason an error occurred during certificate generation.
ms_my: Sebab ralat berlaku semasa penjanaan sijil.

source: The download URL for the generated certificate.
ms_my: URL muat turun untuk sijil yang dijana.

source: Name of template.
ms_my: Nama templat.

source: Description and/or admin notes.
ms_my: Penerangan dan/atau nota pentadbir.

source: Django template HTML.
ms_my: HTML templat Django.

source: Organization of template.
ms_my: Organisasi templat.

source: The course mode for this template.
ms_my: Mod kursus untuk templat ini.

source: On/Off switch.
ms_my: Suis hidup/mati.

source: Description of the asset.
ms_my: Perihalan aset.

source: Asset file. It could be an image or css file.
ms_my: Fail aset. Ia boleh menjadi imej atau fail css.

source: Asset's unique slug. We can reference the asset in templates using this value.
ms_my: Siput unik aset. Kita boleh merujuk aset dalam templat menggunakan nilai ini.

source: user is not given.
ms_my: pengguna tidak diberikan.

source: user '{user}' does not exist
ms_my: pengguna '{user}' tidak wujud

source: Course id '{course_id}' is not valid
ms_my: Id kursus '{course_id}' tidak sah

source: The course does not exist against the given key '{course_key}'
ms_my: Kursus tidak wujud terhadap kunci yang diberikan '{course_key}'

source: User {username} does not exist
ms_my: Pengguna {username} tidak wujud

source: {course_key} is not a valid course key
ms_my: {course_key} bukan kunci kursus yang sah

source: The course {course_key} does not exist
ms_my: Kursus {course_key} tidak wujud

source: User {user_id} is not enrolled in the course {course_key}
ms_my: Pengguna {user_id} tidak didaftarkan dalam kursus {course_key}

source: An unexpected error occurred while regenerating certificates.
ms_my: Ralat yang tidak dijangka berlaku semasa menjana semula sijil.

source: User {username} is not enrolled in the course {course_key}
ms_my: Pengguna {username} tidak didaftarkan dalam kursus {course_key}

source: An {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines.
ms_my: Sijil {cert_type} menandakan bahawa pelajar telah bersetuju untuk mematuhi kod penghormatan yang ditetapkan oleh {platform_name} dan telah menyelesaikan semua tugasan yang diperlukan untuk kursus ini di bawah garis panduannya.

source: A {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines.
ms_my: Sijil {cert_type} menandakan bahawa pelajar telah bersetuju untuk mematuhi kod penghormatan yang ditetapkan oleh {platform_name} dan telah menyelesaikan semua tugasan yang diperlukan untuk kursus ini di bawah garis panduannya.

source: A {cert_type} certificate also indicates that the identity of the learner has been checked and is valid.
ms_my: Sijil {cert_type} juga menunjukkan bahawa identiti pelajar telah disemak dan sah.

source: An {cert_type} certificate demonstrates a high level of achievement in a program of study, and includes verification of the student's identity.
ms_my: Sijil {cert_type} menunjukkan tahap pencapaian yang tinggi dalam program pengajian dan termasuk pengesahan identiti pelajar.

source: This is a valid {platform_name} certificate for {user_name}, who participated in {partner_short_name} {course_number}
ms_my: Ini ialah sijil {platform_name} yang sah untuk {user_name}, yang menyertai {partner_short_name} {course_number}

source: {partner_short_name} {course_number} Certificate | {platform_name}
ms_my: {partner_short_name} {course_number} Sijil | {platform_name}

source: successfully completed, received a passing grade, and was awarded this {platform_name} {certificate_type} Certificate of Completion in
ms_my: berjaya disiapkan, menerima gred lulus dan telah dianugerahkan Sijil Tamat {platform_name} {certificate_type} ini dalam

source: {platform_name} acknowledges achievements through certificates, which are awarded for course activities that {platform_name} students complete.
ms_my: {platform_name} mengiktiraf pencapaian melalui sijil, yang diberikan untuk aktiviti kursus yang pelajar {platform_name} selesaikan.

source: All rights reserved
ms_my: Semua hak terpelihara

source: Invalid Certificate
ms_my: Sijil Tidak Sah

source: Certificate Validation
ms_my: Pengesahan Sijil

source: About {platform_name} Accomplishments
ms_my: Mengenai Pencapaian {platform_name}.

source: Issued On:
ms_my: Dikeluarkan pada:

source: Certificate ID Number
ms_my: Nombor ID Sijil

source: About {platform_name} Certificates
ms_my: Mengenai Sijil {platform_name}.

source: How {platform_name} Validates Student Certificates
ms_my: Cara {platform_name} Mengesahkan Sijil Pelajar

source: Certificates issued by {platform_name} are signed by a gpg key so that they can be validated independently by anyone with the {platform_name} public key. For independent verification, {platform_name} uses what is called a "detached signature"&quot;".
ms_my: Sijil yang dikeluarkan oleh {platform_name} ditandatangani oleh kunci gpg supaya ia boleh disahkan secara bebas oleh sesiapa sahaja yang mempunyai kunci awam {platform_name}. Untuk pengesahan bebas, {platform_name} menggunakan apa yang dipanggil "tandatangan terpisah"&quot;".

source: Validate this certificate for yourself
ms_my: Sahkan sijil ini untuk diri sendiri

source: {platform_name} offers interactive online classes and MOOCs.
ms_my: {platform_name} menawarkan kelas dalam talian interaktif dan MOOC.

source: About {platform_name}
ms_my: Mengenai {platform_name}

source: Learn more about {platform_name}
ms_my: Ketahui lebih lanjut tentang {platform_name}

source: Learn with {platform_name}
ms_my: Belajar dengan {platform_name}

source: Work at {platform_name}
ms_my: Bekerja di {platform_name}

source: Contact {platform_name}
ms_my: Hubungi {platform_name}

source: {platform_name} acknowledges the following student accomplishment
ms_my: {platform_name} mengakui pencapaian pelajar berikut

source: a course of study offered by {partner_short_name}, an online learning initiative of {partner_long_name}.
ms_my: kursus pengajian yang ditawarkan oleh {partner_short_name}, inisiatif pembelajaran dalam talian {partner_long_name}.

source: a course of study offered by {partner_short_name}.
ms_my: kursus pengajian yang ditawarkan oleh {partner_short_name}.

source: I completed the {course_title} course on {platform_name}.
ms_my: Saya telah melengkapkan kursus {course_title} di {platform_name}.

source: I completed a course at {platform_name}. Take a look at my certificate.
ms_my: Saya telah menyelesaikan kursus di {platform_name}. Tengok sijil saya.

source: More Information About {user_name}'s Certificate:
ms_my: Maklumat Lanjut Mengenai Sijil {user_name}:

source: {fullname}, you earned a certificate!
ms_my: {nama penuh}, anda memperoleh sijil!

source: Congratulations! This page summarizes what you accomplished. Show it off to family, friends, and colleagues in your social and professional networks.
ms_my: tahniah! Halaman ini meringkaskan apa yang anda capai. Tunjukkan kepada keluarga, rakan dan rakan sekerja dalam rangkaian sosial dan profesional anda.

source: More about {fullname}'s accomplishment
ms_my: Lagi tentang pencapaian {fullname}.

source: {course_id} is not a valid course key.
ms_my: {course_id} bukan kunci kursus yang sah.

source: Course {course_id} does not exist.
ms_my: Kursus {course_id} tidak wujud.

source: Use the checkout page hosted by the E-Commerce service.
ms_my: Gunakan halaman pembayaran yang dihoskan oleh perkhidmatan E-Dagang.

source: Specified in seconds. Enable caching by setting this to a value greater than 0.
ms_my: Dinyatakan dalam beberapa saat. Dayakan caching dengan menetapkan ini kepada nilai yang lebih besar daripada 0.

source: Path to order receipt page.
ms_my: Laluan ke halaman resit pesanan.

source: Automatically approve valid refund requests, without manual processing
ms_my: Luluskan permintaan bayaran balik yang sah secara automatik, tanpa pemprosesan manual

source: [Refund] User-Requested Refund
ms_my: [Bayaran Balik] Bayaran Balik yang Diminta Pengguna

source: A refund request has been initiated for {username} ({email}). To process this request, please visit the link(s) below.
ms_my: Permintaan bayaran balik telah dimulakan untuk {username} ({email}). Untuk memproses permintaan ini, sila lawati pautan di bawah.

source: Practice Exam
ms_my: Peperiksaan Latihan

source: Proctored Exam
ms_my: Peperiksaan Berkawal

source: Timed Exam
ms_my: Peperiksaan Bermasa

source: Exam
ms_my: Peperiksaan

source: You're almost there!
ms_my: Anda hampir sampai!

source: There's still time to reach your goal
ms_my: Masih ada masa untuk mencapai matlamat anda

source: You set a goal of learning %(days_per_week)s times a week in %(course_name)s. You're not quite there, but there's still time to reach that goal!
ms_my: Anda menetapkan matlamat untuk belajar %(days_per_week)s kali seminggu dalam %(course_name)s. Anda belum sampai ke sana, tetapi masih ada masa untuk mencapai matlamat itu!

source: Remember, you can always change your learning goal. The best goal is one that you can stick to.
ms_my: Ingat, anda sentiasa boleh mengubah matlamat pembelajaran anda. Matlamat terbaik ialah matlamat yang boleh anda patuhi.

source: You've almost reached your goal in %(course_name)s
ms_my: Anda hampir mencapai matlamat anda dalam %(course_name)s

source: If any of these values is left empty or "Unknown", then their value at runtime will be retrieved from the next most specific context that applies. For example, if "Disabled" is left as "Unknown" in the course context, then that course will be Disabled only if the org that it is in is Disabled.
ms_my: Jika mana-mana nilai ini dibiarkan kosong atau "Tidak diketahui", maka nilainya pada masa jalan akan diambil daripada konteks paling khusus seterusnya yang digunakan. Contohnya, jika "Dilumpuhkan" dibiarkan sebagai "Tidak Diketahui" dalam konteks kursus, maka kursus itu akan Dilumpuhkan hanya jika org yang berada di dalamnya Dilumpuhkan.

source: Disabled
ms_my: Dilumpuhkan

source: ({number} Question)
ms_my: ({nombor} Soalan)

source: Please contact your degree administrator or {platform_name} Support if you have questions.
ms_my: Sila hubungi pentadbir ijazah anda atau Sokongan {platform_name} jika anda mempunyai soalan.

source: Course is full
ms_my: Kursus penuh

source: 'course_id' is required.
ms_my: 'course_id' diperlukan.

source: Only 'course_id' is expected.
ms_my: Hanya 'course_id' dijangka.

source: Welcome message successfully dismissed.
ms_my: Mesej alu-aluan berjaya diketepikan.

source: Your course goal has been successfully set.
ms_my: Matlamat kursus anda telah berjaya ditetapkan.

source: Course goal updated successfully.
ms_my: Matlamat kursus berjaya dikemas kini.

source: Enable learners to access, and collaborate on course-related information.
ms_my: Membolehkan pelajar mengakses dan bekerjasama dalam maklumat berkaitan kursus.

source: This is the wiki for **{organization}**'s _{course_name}_.
ms_my: Ini ialah wiki untuk **{organization}**'s _{course_name}_.

source: Course page automatically created.
ms_my: Halaman kursus dibuat secara automatik.

source: Welcome to the {platform_name} Wiki
ms_my: Selamat datang ke Wiki {platform_name}.

source: Visit a course wiki to add an article.
ms_my: Lawati wiki kursus untuk menambah artikel.

source: Course has not started
ms_my: Kursus belum bermula

source: Course does not start until {}
ms_my: Kursus tidak bermula sehingga {}

source: You have unfulfilled milestones
ms_my: Anda mempunyai pencapaian yang belum dicapai

source: You do not have access to this course
ms_my: Anda tidak mempunyai akses kepada kursus ini

source: You do not have access to this course on a mobile device
ms_my: Anda tidak mempunyai akses kepada kursus ini pada peranti mudah alih

source: You must be enrolled in the course
ms_my: Anda mesti mendaftar dalam kursus

source: You are enrolled in this course with '{enrollment_enterprise_name}'. However, you are currently logged in as a '{active_enterprise_name}' user. Please log in with '{enrollment_enterprise_name}' to access this course.
ms_my: Anda telah mendaftar dalam kursus ini dengan '{enrollment_enterprise_name}'. Walau bagaimanapun, anda sedang log masuk sebagai pengguna '{active_enterprise_name}'. Sila log masuk dengan '{enrollment_enterprise_name}' untuk mengakses kursus ini.

source: You must give Data Sharing Consent for the course
ms_my: Anda mesti memberikan Persetujuan Perkongsian Data untuk kursus

source: You must be logged in to see this course
ms_my: Anda mesti log masuk untuk melihat kursus ini

source: {course_name} is no longer available.
ms_my: {course_name} tidak tersedia lagi.

source: Financial Assistance
ms_my: Bantuan Kewangan

source: Assignment
ms_my: Tugasan

source: Open Response Assessment
ms_my: Penilaian Respons Terbuka

source: This Open Response Assessment's due dates are set by your instructor and can't be shifted.
ms_my: Tarikh akhir Penilaian Respons Terbuka ini ditetapkan oleh pengajar anda dan tidak boleh dialihkan.

source: Self Assessment
ms_my: Penilaian Kendiri

source: Peer Assessment
ms_my: Penilaian Rakan Sebaya

source: Staff Assessment
ms_my: Penilaian Kakitangan

source: Submission
ms_my: Penyerahan

source: {relative} ago - {absolute}
ms_my: {relative} lalu - {absolute}

source: in {relative} - {absolute}
ms_my: dalam {relative} - {mutlak}

source: Enrollment Date
ms_my: Tarikh Pendaftaran

source: Course starts
ms_my: Kursus bermula

source: Course ends
ms_my: Kursus tamat

source: After this date, the course will be archived, which means you can review the course content but can no longer participate in graded assignments or work towards earning a certificate.
ms_my: Selepas tarikh ini, kursus akan diarkibkan, yang bermaksud anda boleh menyemak kandungan kursus tetapi tidak lagi boleh mengambil bahagian dalam tugasan yang dinilai atau berusaha untuk mendapatkan sijil.

source: After the course ends, the course content will be archived and no longer active.
ms_my: Selepas kursus tamat, kandungan kursus akan diarkibkan dan tidak lagi aktif.

source: This course is archived, which means you can review course content but it is no longer active.
ms_my: Kursus ini diarkibkan, yang bermaksud anda boleh menyemak kandungan kursus tetapi ia tidak lagi aktif.

source: You lose all access to this course, including your progress.
ms_my: Anda kehilangan semua akses kepada kursus ini, termasuk kemajuan anda.

source: Audit Access Expires
ms_my: Akses Audit Tamat Tempoh

source: Certificate Available
ms_my: Sijil Tersedia

source: Day certificates will become available for passing verified learners.
ms_my: Sijil hari akan tersedia untuk pelajar yang disahkan lulus.

source: Upgrade to Verified Certificate
ms_my: Naik taraf kepada Sijil Disahkan

source: Verification Upgrade Deadline
ms_my: Tarikh Akhir Peningkatan Pengesahan

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate.
ms_my: Jangan lepaskan peluang untuk menyerlahkan pengetahuan dan kemahiran baharu anda dengan memperoleh sijil yang disahkan.

source: You are still eligible to upgrade to a Verified Certificate! Pursue it to highlight the knowledge and skills you gain in this course.
ms_my: Anda masih layak untuk menaik taraf kepada Sijil Disahkan! Kejar untuk menyerlahkan pengetahuan dan kemahiran yang anda perolehi dalam kursus ini.

source: by {date}
ms_my: menjelang {tarikh}

source: Learn More
ms_my: Ketahui Lebih Lanjut

source: Retry Verification
ms_my: Cuba semula Pengesahan

source: Verify My Identity
ms_my: Sahkan Identiti Saya

source: Missed Verification Deadline
ms_my: Tarikh Akhir Pengesahan terlepas

source: Unfortunately you missed this course's deadline for a successful verification.
ms_my: Malangnya anda terlepas tarikh akhir kursus ini untuk pengesahan yang berjaya.

source: You must successfully complete verification before this date to qualify for a Verified Certificate.
ms_my: Anda mesti berjaya melengkapkan pengesahan sebelum tarikh ini untuk layak mendapat Sijil Disahkan.

source: There is no user with the username or email address "{user_identifier}" enrolled in this course.
ms_my: Tiada pengguna dengan nama pengguna atau alamat e-mel "{user_identifier}" didaftarkan dalam kursus ini.
