Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: This setting indicates whether this exam is for testing purposes only. Practice exams are not verified.
ms_my: Tetapan ini menunjukkan sama ada peperiksaan ini adalah untuk tujuan ujian sahaja. Peperiksaan latihan tidak disahkan.

source: Is Onboarding Exam
ms_my: Adakah Peperiksaan Onboarding

source: This setting indicates whether this exam is an onboarding exam.
ms_my: Tetapan ini menunjukkan sama ada peperiksaan ini ialah peperiksaan semasa.

source: This subsection is unlocked for learners when they meet the prerequisite requirements.
ms_my: Subseksyen ini dibuka untuk pelajar apabila mereka memenuhi keperluan prasyarat.

source: This exam is hidden from the learner.
ms_my: Peperiksaan ini disembunyikan daripada pelajar.

source: Because the course has ended, this assignment is hidden from the learner.
ms_my: Oleh kerana kursus telah tamat, tugasan ini disembunyikan daripada pelajar.

source: Because the due date has passed, this assignment is hidden from the learner.
ms_my: Oleh kerana tarikh akhir telah berlalu, tugasan ini disembunyikan daripada pelajar.

source: This section is a prerequisite. You must complete this section in order to unlock additional content.
ms_my: Bahagian ini adalah prasyarat. Anda mesti melengkapkan bahagian ini untuk membuka kunci kandungan tambahan.

source: A list summarizing what students should look forward to in this section.
ms_my: Senarai yang meringkaskan perkara yang pelajar harus nantikan dalam bahagian ini.

source: Group ID {group_id}
ms_my: ID Kumpulan {group_id}

source: Not Selected
ms_my: Tidak Dipilih

source: The display name for this component. (Not shown to learners)
ms_my: Nama paparan untuk komponen ini. (Tidak ditunjukkan kepada pelajar)

source: Content Experiment
ms_my: Eksperimen Kandungan

source: The configuration defines how users are grouped for this content experiment. Caution: Changing the group configuration of a student-visible experiment will impact the experiment data.
ms_my: Konfigurasi mentakrifkan cara pengguna dikumpulkan untuk percubaan kandungan ini. Awas: Menukar konfigurasi kumpulan percubaan yang boleh dilihat oleh pelajar akan memberi kesan kepada data percubaan.

source: Group Configuration
ms_my: Konfigurasi Kumpulan

source: {group_name} (inactive)
ms_my: {group_name} (tidak aktif)

source: The experiment is not associated with a group configuration.
ms_my: Percubaan tidak dikaitkan dengan konfigurasi kumpulan.

source: Select a Group Configuration
ms_my: Pilih Konfigurasi Kumpulan

source: The experiment uses a deleted group configuration. Select a valid group configuration or delete this experiment.
ms_my: Percubaan menggunakan konfigurasi kumpulan yang dipadamkan. Pilih konfigurasi kumpulan yang sah atau padamkan percubaan ini.

source: The experiment uses a group configuration that is not supported for experiments. Select a valid group configuration or delete this experiment.
ms_my: Percubaan menggunakan konfigurasi kumpulan yang tidak disokong untuk percubaan. Pilih konfigurasi kumpulan yang sah atau padamkan percubaan ini.

source: The experiment does not contain all of the groups in the configuration.
ms_my: Percubaan tidak mengandungi semua kumpulan dalam konfigurasi.

source: Add Missing Groups
ms_my: Tambah Kumpulan yang Hilang

source: The experiment has an inactive group. Move content into active groups, then delete the inactive group.
ms_my: Percubaan mempunyai kumpulan yang tidak aktif. Alihkan kandungan ke dalam kumpulan aktif, kemudian padamkan kumpulan yang tidak aktif.

source: This content experiment has issues that affect content visibility.
ms_my: Percubaan kandungan ini mempunyai isu yang menjejaskan keterlihatan kandungan.

source: External Discussion
ms_my: Perbincangan Luar

source: Press {link_start}Edit{link_end} to configure how many will be shown and other settings.
ms_my: Tekan {link_start}Edit{link_end} untuk mengkonfigurasi bilangan yang akan ditunjukkan dan tetapan lain.

source: You have not selected any components yet.
ms_my: Anda belum memilih mana-mana komponen lagi.

source: {button_start}Add components{button_end} from a content library to this problem bank.
ms_my: {button_start}Tambah komponen{button_end} daripada pustaka kandungan ke bank masalah ini.

source: Enable in-context discussions for the Unit
ms_my: Dayakan perbincangan dalam konteks untuk Unit

source: Add discussion for the Unit.
ms_my: Tambah perbincangan untuk Unit.

source: Can't get transcript link from Youtube for {youtube_id}.
ms_my: Tidak boleh mendapatkan pautan transkrip daripada Youtube untuk {youtube_id}.

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
ms_my: Tidak dapat menerima transkrip daripada Youtube untuk {youtube_id}. Kod status: {status_code}.

source: We support only SubRip (*.srt) transcripts format.
ms_my: Kami hanya menyokong format transkrip SubRip (*.srt).

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
ms_my: Sesuatu yang salah dengan fail transkrip SubRip semasa menghuraikan. Mesej dalaman ialah {error_message}

source: Something wrong with SubRip transcripts file during parsing.
ms_my: Sesuatu yang salah dengan fail transkrip SubRip semasa menghuraikan.

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
ms_my: {exception_message}: Tidak menemui transkrip yang dimuat naik: {user_filename}

source: Basic
ms_my: asas

source: There is no transcript file associated with the {lang} language.
ms_my: Tiada fail transkrip yang dikaitkan dengan bahasa {lang}.

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
ms_my: URL untuk video anda. Ini boleh menjadi URL YouTube atau pautan ke fail video .mp4, .ogg atau .webm yang dihoskan di tempat lain di Internet.

source: Default Video URL
ms_my: URL Video Lalai

source: Language is required.
ms_my: Bahasa diperlukan.

source: Component Display Name
ms_my: Nama Paparan Komponen

source: Current position in the video.
ms_my: Kedudukan semasa dalam video.

source: Optional, for older browsers: the YouTube ID for the normal speed video.
ms_my: Pilihan, untuk pelayar lama: ID YouTube untuk video kelajuan biasa.

source: YouTube ID
ms_my: ID YouTube

source: Optional, for older browsers: the YouTube ID for the .75x speed video.
ms_my: Pilihan, untuk pelayar lama: ID YouTube untuk video berkelajuan .75x.

source: YouTube ID for .75x speed
ms_my: ID YouTube untuk kelajuan .75x

source: Optional, for older browsers: the YouTube ID for the 1.25x speed video.
ms_my: Pilihan, untuk pelayar lama: ID YouTube untuk video berkelajuan 1.25x.

source: YouTube ID for 1.25x speed
ms_my: ID YouTube untuk kelajuan 1.25x

source: Optional, for older browsers: the YouTube ID for the 1.5x speed video.
ms_my: Pilihan, untuk pelayar lama: ID YouTube untuk video berkelajuan 1.5x.

source: YouTube ID for 1.5x speed
ms_my: ID YouTube untuk kelajuan 1.5x

source: Time you want the video to start if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
ms_my: Masa anda mahu video dimulakan jika anda tidak mahu keseluruhan video dimainkan. Tidak disokong dalam apl mudah alih asli: fail video penuh akan dimainkan. Diformat sebagai HH:MM:SS. Nilai maksimum ialah 23:59:59.

source: Video Start Time
ms_my: Masa Mula Video

source: Time you want the video to stop if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
ms_my: Masa anda mahu video dihentikan jika anda tidak mahu keseluruhan video dimainkan. Tidak disokong dalam apl mudah alih asli: fail video penuh akan dimainkan. Diformat sebagai HH:MM:SS. Nilai maksimum ialah 23:59:59.

source: Video Stop Time
ms_my: Masa Berhenti Video

source: Allow students to download versions of this video in different formats if they cannot use the edX video player or do not have access to YouTube. You must add at least one non-YouTube URL in the Video File URLs field.
ms_my: Benarkan pelajar memuat turun versi video ini dalam format yang berbeza jika mereka tidak boleh menggunakan pemain video edX atau tidak mempunyai akses kepada YouTube. Anda mesti menambah sekurang-kurangnya satu URL bukan YouTube dalam medan URL Fail Video.

source: Video Download Allowed
ms_my: Muat Turun Video Dibenarkan

source: The URL or URLs where you've posted non-YouTube versions of the video. Each URL must end in .mpeg, .mp4, .ogg, or .webm and cannot be a YouTube URL. (For browser compatibility, we strongly recommend .mp4 and .webm format.) Students will be able to view the first listed video that's compatible with the student's computer. To allow students to download these videos, set Video Download Allowed to True.
ms_my: URL atau URL tempat anda menyiarkan versi video bukan YouTube. Setiap URL mesti berakhir dengan .mpeg, .mp4, .ogg atau .webm dan tidak boleh menjadi URL YouTube. (Untuk keserasian penyemak imbas, kami amat mengesyorkan format .mp4 dan .webm.) Pelajar akan dapat melihat video tersenarai pertama yang serasi dengan komputer pelajar. Untuk membenarkan pelajar memuat turun video ini, tetapkan Muat Turun Video Dibenarkan kepada Benar.

source: Video File URLs
ms_my: URL Fail Video

source: By default, students can download an .srt or .txt transcript when you set Download Transcript Allowed to True. If you want to provide a downloadable transcript in a different format, we recommend that you upload a handout by using the Upload a Handout field. If this isn't possible, you can post a transcript file on the Files & Uploads page or on the Internet, and then add the URL for the transcript here. Students see a link to download that transcript below the video.
ms_my: Secara lalai, pelajar boleh memuat turun transkrip .srt atau .txt apabila anda menetapkan Muat Turun Transkrip Dibenarkan kepada Benar. Jika anda ingin menyediakan transkrip yang boleh dimuat turun dalam format yang berbeza, kami mengesyorkan anda memuat naik edaran dengan menggunakan medan Muat Naik Edaran. Jika ini tidak boleh dilakukan, anda boleh menyiarkan fail transkrip pada halaman Fail & Muat Naik atau di Internet, kemudian tambahkan URL untuk transkrip di sini. Pelajar melihat pautan untuk memuat turun transkrip itu di bawah video.

source: Downloadable Transcript URL
ms_my: URL Transkrip Boleh Muat Turun

source: Allow students to download the timed transcript. A link to download the file appears below the video. By default, the transcript is an .srt or .txt file. If you want to provide the transcript for download in a different format, upload a file by using the Upload Handout field.
ms_my: Benarkan pelajar memuat turun transkrip bermasa. Pautan untuk memuat turun fail dipaparkan di bawah video. Secara lalai, transkrip ialah fail .srt atau .txt. Jika anda ingin memberikan transkrip untuk muat turun dalam format yang berbeza, muat naik fail dengan menggunakan medan Muat Naik Edaran.

source: Download Transcript Allowed
ms_my: Muat Turun Transkrip Dibenarkan

source: The default transcript for the video, from the Default Timed Transcript field on the Basic tab. This transcript should be in English. You don't have to change this setting.
ms_my: Transkrip lalai untuk video, daripada medan Transkrip Bermasa Lalai pada tab Asas. Transkrip ini hendaklah dalam bahasa Inggeris. Anda tidak perlu menukar tetapan ini.

source: Default Timed Transcript
ms_my: Transkrip Bermasa Lalai

source: Specify whether the transcripts appear with the video by default.
ms_my: Tentukan sama ada transkrip muncul bersama video secara lalai.

source: Show Transcript
ms_my: Tunjukkan Transkrip

source: Add transcripts in different languages. Click below to specify a language and upload an .srt transcript file for that language.
ms_my: Tambah transkrip dalam bahasa yang berbeza. Klik di bawah untuk menentukan bahasa dan muat naik fail transkrip .srt untuk bahasa tersebut.

source: Transcript Languages
ms_my: Bahasa Transkrip

source: Preferred language for transcript.
ms_my: Bahasa pilihan untuk transkrip.

source: Preferred language for transcript
ms_my: Bahasa pilihan untuk transkrip

source: Transcript file format to download by user.
ms_my: Format fail transkrip untuk dimuat turun oleh pengguna.

source: SubRip (.srt) file
ms_my: Fail SubRip (.srt).

source: Text (.txt) file
ms_my: Fail teks (.txt).

source: The last speed that the user specified for the video.
ms_my: Kelajuan terakhir yang ditentukan pengguna untuk video.

source: The default speed for the video.
ms_my: Kelajuan lalai untuk video.

source: Specify whether to advance automatically to the next unit when the video ends.
ms_my: Tentukan sama ada untuk maju secara automatik ke unit seterusnya apabila video tamat.

source: Specify whether YouTube is available for the user.
ms_my: Tentukan sama ada YouTube tersedia untuk pengguna.

source: Upload a handout to accompany this video. Students can download the handout by clicking Download Handout under the video.
ms_my: Muat naik edaran untuk mengiringi video ini. Pelajar boleh memuat turun edaran dengan mengklik Muat Turun Edaran di bawah video.

source: Upload Handout
ms_my: Muat Naik Edaran

source: Specify whether access to this video is limited to browsers only, or if it can be accessed from other applications including mobile apps.
ms_my: Tentukan sama ada akses kepada video ini terhad kepada penyemak imbas sahaja atau jika ia boleh diakses daripada aplikasi lain termasuk apl mudah alih.

source: Video Available on Web Only
ms_my: Video Tersedia di Web Sahaja

source: If you were assigned a Video ID by edX for the video to play in this component, enter the ID here. In this case, do not enter values in the Default Video URL, the Video File URLs, and the YouTube ID fields. If you were not assigned a Video ID, enter values in those other fields and ignore this field.
ms_my: Jika anda telah diberikan ID Video oleh edX untuk video dimainkan dalam komponen ini, masukkan ID di sini. Dalam kes ini, jangan masukkan nilai dalam URL Video Lalai, URL Fail Video dan medan ID YouTube. Jika anda tidak diberikan ID Video, masukkan nilai dalam medan lain tersebut dan abaikan medan ini.

source: Date of the last view of the bumper
ms_my: Tarikh pandangan terakhir bampar

source: Do not show bumper again
ms_my: Jangan tunjukkan bumper lagi

source: Specify whether the video can be accessed publicly by learners.
ms_my: Tentukan sama ada video boleh diakses secara terbuka oleh pelajar.

source: Public Access
ms_my: Akses Awam

source: Add a specific thumbnail for learners to see before playing the video.
ms_my: Tambahkan lakaran kecil khusus untuk pelajar lihat sebelum memainkan video.

source: Thumbnail
ms_my: Gambar kecil

source: Instructions
ms_my: Arahan

source: Add instructions to help learners understand how to use the word cloud. Clear instructions are important, especially for learners who have accessibility requirements.
ms_my: Tambahkan arahan untuk membantu pelajar memahami cara menggunakan perkataan awan. Arahan yang jelas adalah penting, terutamanya bagi pelajar yang mempunyai keperluan kebolehaksesan.

source: Inputs
ms_my: Input

source: The number of text boxes available for learners to add words and sentences.
ms_my: Bilangan kotak teks yang tersedia untuk pelajar menambah perkataan dan ayat.

source: Maximum Words
ms_my: Perkataan Maksimum

source: The maximum number of words displayed in the generated word cloud.
ms_my: Bilangan maksimum perkataan yang dipaparkan dalam awan perkataan yang dihasilkan.

source: Show Percents
ms_my: Tunjukkan Peratusan

source: Statistics are shown for entered words near that word.
ms_my: Statistik ditunjukkan untuk perkataan yang dimasukkan berhampiran perkataan itu.

source: Whether this learner has posted words to the cloud.
ms_my: Sama ada pelajar ini telah menyiarkan perkataan ke awan.

source: Student answer.
ms_my: Jawapan pelajar.

source: All possible words from all learners.
ms_my: Semua perkataan yang mungkin daripada semua pelajar.

source: {display_name} is only accessible to enrolled learners. Sign in or register, and enroll in this course to view it.
ms_my: {display_name} hanya boleh diakses oleh pelajar yang berdaftar. Log masuk atau daftar, dan daftar dalam kursus ini untuk melihatnya.

source: created
ms_my: dicipta

source: Wiki notifications
ms_my: Pemberitahuan Wiki

source: Wiki images
ms_my: Imej Wiki

source: Wiki attachments
ms_my: Lampiran Wiki

source: Only localhost... muahahaha
ms_my: Hanya localhost... muahahaha

source: Initial title of the article. May be overridden with revision titles.
ms_my: Tajuk awal artikel. Boleh diganti dengan tajuk semakan.

source: Type in some contents
ms_my: Taipkan beberapa kandungan

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
ms_my: Ini hanyalah kandungan awal artikel anda. Selepas menciptanya, anda boleh menggunakan ciri yang lebih kompleks seperti menambah pemalam, data meta, artikel berkaitan dsb...

source: Contents
ms_my: kandungan

source: Summary
ms_my: Ringkasan

source: Give a short reason for your edit, which will be stated in the revision log.
ms_my: Berikan alasan ringkas untuk pengeditan anda, yang akan dinyatakan dalam log semakan.

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
ms_my: Semasa anda mengedit, orang lain menukar semakan. Kandungan anda telah digabungkan secara automatik dengan kandungan baharu. Sila semak teks di bawah.

source: No changes made. Nothing to save.
ms_my: Tiada perubahan dibuat. Tiada apa-apa untuk disimpan.

source: Write a brief message for the article's history log.
ms_my: Tulis mesej ringkas untuk log sejarah artikel.

source: A slug may not begin with an underscore.
ms_my: Slug tidak boleh bermula dengan garis bawah.

source: Yes, I am sure
ms_my: Ya, saya pasti

source: Purge
ms_my: Bersihkan

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
ms_my: Bersihkan artikel: Alih keluar sepenuhnya (dan semua kandungannya) tanpa membuat asal. Pembersihan adalah idea yang baik jika anda ingin membebaskan slug supaya pengguna boleh mencipta artikel baharu sebagai gantinya.

source: You are not sure enough!
ms_my: Anda tidak cukup pasti!

source: While you tried to delete this article, it was modified. TAKE CARE!
ms_my: Semasa anda cuba memadamkan artikel ini, ia telah diubah suai. JAGA-JAGA!

source: Lock article
ms_my: Kunci artikel

source: Deny all users access to edit this article.
ms_my: Tolak akses semua pengguna untuk mengedit artikel ini.

source: Permissions
ms_my: kebenaran

source: Owner
ms_my: Pemilik

source: Enter the username of the owner.
ms_my: Masukkan nama pengguna pemilik.

source: (none)
ms_my: (tiada)

source: Inherit permissions
ms_my: Mewarisi kebenaran

source: Check here to apply the above permissions recursively to articles under this one.
ms_my: Semak di sini untuk menggunakan kebenaran di atas secara rekursif pada artikel di bawah yang satu ini.

source: Permission settings for the article were updated.
ms_my: Tetapan kebenaran untuk artikel telah dikemas kini.

source: Your permission settings were unchanged, so nothing saved.
ms_my: Tetapan kebenaran anda tidak berubah, jadi tiada apa yang disimpan.

source: No user with that username
ms_my: Tiada pengguna dengan nama pengguna itu

source: Article locked for editing
ms_my: Artikel dikunci untuk diedit

source: Article unlocked for editing
ms_my: Artikel dibuka kunci untuk diedit

source: Filter
ms_my: Penapis

source: Settings for plugin
ms_my: Tetapan untuk pemalam

source: current revision
ms_my: semakan semasa

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
ms_my: Semakan sedang dipaparkan untuk artikel ini. Jika anda perlu melakukan roll-back, cuma tukar nilai medan ini.

source: modified
ms_my: diubahsuai

source: Article properties last modified
ms_my: Sifat artikel terakhir diubah suai

source: The owner of the article, usually the creator. The owner always has both read and write access.
ms_my: Pemilik artikel, biasanya pencipta. Pemilik sentiasa mempunyai akses baca dan tulis.

source: group
ms_my: kumpulan

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
ms_my: Seperti dalam sistem fail UNIX, kebenaran boleh diberikan kepada pengguna mengikut keahlian kumpulan. Kumpulan dikendalikan melalui sistem pengesahan Django.

source: group read access
ms_my: akses baca kumpulan

source: group write access
ms_my: akses tulis kumpulan

source: others read access
ms_my: akses baca yang lain

source: others write access
ms_my: akses tulis yang lain

source: content type
ms_my: jenis kandungan

source: object ID
ms_my: ID objek

source: Article for object
ms_my: Artikel untuk objek

source: Articles for object
ms_my: Artikel untuk objek

source: revision number
ms_my: nombor semakan

source: IP address
ms_my: alamat IP

source: user
ms_my: pengguna

source: locked
ms_my: terkunci

source: article
ms_my: artikel

source: article contents
ms_my: kandungan artikel

source: article title
ms_my: tajuk artikel

source: Each revision contains a title field that must be filled out, even if the title has not changed
ms_my: Setiap semakan mengandungi medan tajuk yang mesti diisi, walaupun tajuk tidak berubah

source: original article
ms_my: artikel asal

source: Permissions are inherited from this article
ms_my: Kebenaran diwarisi daripada artikel ini

source: A plugin was changed
ms_my: Satu pemalam telah ditukar

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
ms_my: Semakan sedang dipaparkan untuk pemalam ini. Jika anda perlu melakukan roll-back, cuma tukar nilai medan ini.

source: Cache lookup value for articles
ms_my: Nilai carian cache untuk artikel

source: (root)
ms_my: (akar)

source: URL path
ms_my: Laluan URL

source: URL paths
ms_my: Laluan URL

source: Sorry but you cannot have a root article with a slug.
ms_my: Maaf tetapi anda tidak boleh mempunyai artikel akar dengan slug.

source: A non-root note must always have a slug.
ms_my: Nota bukan akar mesti sentiasa mempunyai slug.

source: Lost and found
ms_my: Hilang dan ditemui

source: Description
ms_my: Penerangan

source: A short summary of what the file contains
ms_my: Ringkasan ringkas tentang kandungan fail

source: Yes I am sure...
ms_my: Ya saya pasti...

source: Click to download file
ms_my: Klik untuk memuat turun fail

source: The revision of this attachment currently in use (on all articles using the attachment)
ms_my: Semakan lampiran ini sedang digunakan (pada semua artikel menggunakan lampiran)

source: original filename
ms_my: nama fail asal

source: attachment
ms_my: lampiran

source: attachments
ms_my: lampiran

source: file
ms_my: fail

source: attachment revision
ms_my: semakan lampiran

source: attachment revisions
ms_my: semakan lampiran

source: Your file could not be saved, probably because of a permission error on the web server.
ms_my: Fail anda tidak dapat disimpan, mungkin kerana ralat kebenaran pada pelayan web.
