Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Thank you for sharing your reasons for unenrolling.
ms_my: Terima kasih kerana berkongsi sebab anda membatalkan pendaftaran.

source: You are unenrolled from
ms_my: Anda dibatalkan pendaftaran daripada

source: Return To Dashboard
ms_my: Kembali Ke Papan Pemuka

source: Browse Courses
ms_my: Layari Kursus

source: We're sorry to see you go! Please share your main reason for unenrolling.
ms_my: Kami kesal melihat anda pergi! Sila kongsi sebab utama anda membatalkan pendaftaran.

source: I just wanted to browse the material
ms_my: Saya hanya mahu menyemak imbas bahan

source: This won't help me reach my goals
ms_my: Ini tidak akan membantu saya mencapai matlamat saya

source: I don't have the time
ms_my: Saya tidak mempunyai masa

source: I don't have the academic or language prerequisites
ms_my: Saya tidak mempunyai prasyarat akademik atau bahasa

source: I don't have enough support
ms_my: Saya tidak mempunyai sokongan yang mencukupi

source: I am not happy with the quality of the content
ms_my: Saya tidak berpuas hati dengan kualiti kandungan

source: The course material was too hard
ms_my: Bahan kursus terlalu sukar

source: The course material was too easy
ms_my: Bahan kursus terlalu mudah

source: Something was broken
ms_my: Ada yang rosak

source: Other
ms_my: Lain-lain

source: Results:
ms_my: Keputusan:

source: Topic:
ms_my: Topik:

source: Show Discussion
ms_my: Tunjukkan Perbincangan

source: To view live discussions, click Preview or View Live in Unit Settings.
ms_my: Untuk melihat perbincangan langsung, klik Pratonton atau Lihat Langsung dalam Tetapan Unit.

source: Discussion ID: {discussion_id}
ms_my: ID Perbincangan: {discussion_id}

source: The discussion block is disabled for this course as it is not using a compatible discussion provider.
ms_my: Blok perbincangan dilumpuhkan untuk kursus ini kerana ia tidak menggunakan penyedia perbincangan yang serasi.

source: Discussion topics list
ms_my: Senarai topik perbincangan

source: Filter Topics
ms_my: Tapis Topik

source: filter topics
ms_my: tapis topik

source: All Discussions
ms_my: Semua Perbincangan

source: Posts I'm Following
ms_my: Catatan yang Saya Ikuti

source: Filter:
ms_my: Penapis:

source: Show all posts
ms_my: Tunjukkan semua siaran

source: Unread posts
ms_my: Catatan yang belum dibaca

source: Unanswered posts
ms_my: Catatan yang tidak dijawab

source: Flagged
ms_my: Ditandakan

source: Group:
ms_my: Kumpulan:

source: in all groups
ms_my: dalam semua kumpulan

source: Sort:
ms_my: Isih:

source: by recent activity
ms_my: dengan aktiviti baru-baru ini

source: by most activity
ms_my: oleh kebanyakan aktiviti

source: by most votes
ms_my: dengan undian terbanyak

source: Student Notes
ms_my: Nota Pelajar

source: Highlights and notes you've made in course content
ms_my: Sorotan dan nota yang telah anda buat dalam kandungan kursus

source: Search notes for:
ms_my: Cari nota untuk:

source: Search notes for...
ms_my: Cari nota untuk...

source: View notes by:
ms_my: Lihat nota oleh:

source: You have not made any notes in this course yet. Other students in this course are using notes to:
ms_my: Anda belum membuat sebarang nota dalam kursus ini lagi. Pelajar lain dalam kursus ini menggunakan nota untuk:

source: Mark a passage or concept so that it's easy to find later.
ms_my: Tandakan petikan atau konsep supaya senang dicari nanti.

source: Record thoughts about a specific passage or concept.
ms_my: Catat pemikiran tentang petikan atau konsep tertentu.

source: Highlight important information to review later in the course or in future courses.
ms_my: Serlahkan maklumat penting untuk disemak kemudian dalam kursus atau dalam kursus akan datang.

source: Get started by making a note in something you just read, like {section_link}.
ms_my: Mulakan dengan membuat nota dalam sesuatu yang baru anda baca, seperti {section_link}.

source: Hide notes
ms_my: Sembunyikan nota

source: Show notes
ms_my: Tunjukkan nota

source: Thank you for your purchase of
ms_my: Terima kasih atas pembelian anda

source: Your payment was successful.
ms_my: Pembayaran anda berjaya.

source: If you have billing questions, please read the FAQ ({faq_url}) or contact {billing_email}.
ms_my: Jika anda mempunyai soalan pengebilan, sila baca Soalan Lazim ({faq_url}) atau hubungi {billing_email}.

source: If you have billing questions, please contact {billing_email}.
ms_my: Jika anda mempunyai soalan pengebilan, sila hubungi {billing_email}.

source: {order_placed_by} placed an order and mentioned your name as the Organization contact.
ms_my: {order_placed_by} membuat pesanan dan menyebut nama anda sebagai kenalan Organisasi.

source: {order_placed_by} placed an order and mentioned your name as the additional receipt recipient.
ms_my: {order_placed_by} membuat pesanan dan menyebut nama anda sebagai penerima resit tambahan.

source: The items in your order are:
ms_my: Item dalam pesanan anda ialah:

source: Quantity - Description - Price
ms_my: Kuantiti - Penerangan - Harga

source: Total billed to credit/debit card: {currency_symbol}{total_cost}
ms_my: Jumlah yang dibilkan kepada kad kredit/debit: {currency_symbol}{total_cost}

source: Company Name:
ms_my: Nama Syarikat:

source: Purchase Order Number:
ms_my: Nombor Pesanan Belian:

source: Company Contact Name:
ms_my: Nama Hubungan Syarikat:

source: Company Contact Email:
ms_my: E-mel Perhubungan Syarikat:

source: Recipient Name:
ms_my: Nama Penerima:

source: Recipient Email:
ms_my: E-mel Penerima:

source: Order Number: {order_number}
ms_my: Nombor Pesanan: {order_number}

source: A CSV file of your registration URLs is attached. Please distribute registration URLs to each student planning to enroll using the email template below.
ms_my: Fail CSV URL pendaftaran anda dilampirkan. Sila edarkan URL pendaftaran kepada setiap pelajar yang merancang untuk mendaftar menggunakan templat e-mel di bawah.

source: Warm regards,
ms_my: salam mesra,

source: Dear [[Name]]
ms_my: [[Nama]] yang dihormati

source: To enroll in {course_names} we have provided a registration URL for you. Please follow the instructions below to claim your access.
ms_my: Untuk mendaftar dalam {course_names} kami telah menyediakan URL pendaftaran untuk anda. Sila ikut arahan di bawah untuk menuntut akses anda.

source: (1) Register for an account at {site_name}
ms_my: (1) Daftar untuk akaun di {site_name}

source: (2) Once registered, copy the redeem URL and paste it in your web browser.
ms_my: (2) Setelah mendaftar, salin URL tebus dan tampalkannya dalam pelayar web anda.

source: (5) Course materials will not be available until the course start date.
ms_my: (5) Bahan kursus tidak akan tersedia sehingga tarikh permulaan kursus.

source: The photo of you:
ms_my: Foto awak:

source: The photo of your ID:
ms_my: Foto ID anda:

source: Other Reasons:
ms_my: Sebab-sebab lain:

source: Resubmit Verification: {reverify_url}
ms_my: Hantar semula Pengesahan: {reverify_url}

source: ID Verification FAQ: {faq_url}
ms_my: Soalan Lazim Pengesahan ID: {faq_url}

source: The {platform_name} team
ms_my: Pasukan {platform_name}.

source: Your payment was successful. You will see the charge below on your next credit or debit card statement under the company name {merchant_name}.
ms_my: Pembayaran anda berjaya. Anda akan melihat caj di bawah pada penyata kad kredit atau debit anda yang seterusnya di bawah nama syarikat {merchant_name}.

source: Your order number is: {order_number}
ms_my: Nombor pesanan anda ialah: {order_number}

source: Hello {full_name},
ms_my: Helo {full_name},

source: Your {platform_name} ID verification photos have been approved.
ms_my: Foto pengesahan ID {platform_name} anda telah diluluskan.

source: Your approval status remains valid for two years, and it will expire {expiration_datetime}.
ms_my: Status kelulusan anda kekal sah selama dua tahun dan akan tamat tempoh {expiration_datetime}.

source: Hi {full_name},
ms_my: Hai {full_name},

source: Thanks for submitting your photos!
ms_my: Terima kasih kerana menyerahkan foto anda!

source: We've received your information and the ID verification process has begun.Check for an email from us in the next few days to confirm whether your verification was successful.You can also check the status of the verification process on your dashboard.
ms_my: Kami telah menerima maklumat anda dan proses pengesahan ID telah bermula. Semak e-mel daripada kami dalam beberapa hari akan datang untuk mengesahkan sama ada pengesahan anda berjaya. Anda juga boleh menyemak status proses pengesahan pada papan pemuka anda.

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the course staff at {email}.
ms_my: Kami minta maaf. Kakitangan kursus kami tidak meluluskan permintaan anda untuk menukar nama anda daripada {old_name} kepada {new_name}. Jika anda memerlukan bantuan lanjut, sila e-mel kakitangan kursus di {email}.

source: We have successfully verified your identity for the {assessment} assessment in the {course_name} course.
ms_my: Kami telah berjaya mengesahkan identiti anda untuk penilaian {assessment} dalam kursus {course_name}.

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity.
ms_my: Kami tidak dapat mengesahkan identiti anda untuk penilaian {assessment} dalam kursus {course_name}. Anda telah menggunakan {used_attempts} daripada {allowed_attempts} percubaan untuk mengesahkan identiti anda.

source: You must verify your identity before the assessment closes on {due_date}.
ms_my: Anda mesti mengesahkan identiti anda sebelum penilaian ditutup pada {due_date}.

source: To try to verify your identity again, select the following link:
ms_my: Untuk cuba mengesahkan identiti anda sekali lagi, pilih pautan berikut:

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity, and verification is no longer possible.
ms_my: Kami tidak dapat mengesahkan identiti anda untuk penilaian {assessment} dalam kursus {course_name}. Anda telah menggunakan {used_attempts} daripada {allowed_attempts} percubaan untuk mengesahkan identiti anda dan pengesahan tidak lagi boleh dilakukan.

source: To go to the courseware, select the following link:
ms_my: Untuk pergi ke perisian kursus, pilih pautan berikut:

source: If you have any questions, you can contact student support at {support_link}.
ms_my: Jika anda mempunyai sebarang soalan, anda boleh menghubungi sokongan pelajar di {support_link}.

source: Thanks,
ms_my: terima kasih,

source: This Course Unavailable In Your Country
ms_my: Kursus Ini Tidak Tersedia Di Negara Anda

source: Our system indicates that you are trying to access this {platform_name} course from a country or region in which it is not currently available.
ms_my: Sistem kami menunjukkan bahawa anda cuba mengakses kursus {platform_name} ini dari negara atau wilayah yang tidak tersedia pada masa ini.

source: Our system indicates that you are trying to enroll in this {platform_name} course from a country or region in which it is not currently available.
ms_my: Sistem kami menunjukkan bahawa anda cuba mendaftar dalam kursus {platform_name} ini dari negara atau wilayah yang tidak tersedia pada masa ini.

source: Enrollment Successful
ms_my: Pendaftaran Berjaya

source: Thank you for enrolling in {course_names}. We hope you enjoy the course.
ms_my: Terima kasih kerana mendaftar dalam {course_names}. Kami harap anda menikmati kursus ini.

source: Thank you for enrolling in:
ms_my: Terima kasih kerana mendaftar dalam:

source: We hope you enjoy the course.
ms_my: Kami harap anda menikmati kursus ini.

source: Financial Assistance Application
ms_my: Permohonan Bantuan Kewangan

source: A Note to Learners
ms_my: Nota kepada Pelajar

source: Dear edX Learner,
ms_my: Pelajar edX yang dihormati,

source: EdX Financial Assistance is a program we created to give learners in all financial circumstances a chance to earn a Verified Certificate upon successful completion of an edX course.
ms_my: Bantuan Kewangan EdX ialah program yang kami cipta untuk memberi peluang kepada pelajar dalam semua keadaan kewangan untuk memperoleh Sijil Disahkan setelah berjaya menamatkan kursus edX.

source: If you are interested in working toward a Verified Certificate, but cannot afford to pay the fee, please apply now. Please note that financial assistance is limited and may not be awarded to all eligible candidates.
ms_my: Jika anda berminat untuk mendapatkan Sijil Disahkan, tetapi tidak mampu membayar yuran, sila mohon sekarang. Sila ambil perhatian bahawa bantuan kewangan adalah terhad dan mungkin tidak diberikan kepada semua calon yang layak.

source: If your application is approved, we'll give you instructions for verifying your identity on edx.org so you can start working toward completing your edX course.
ms_my: Jika permohonan anda diluluskan, kami akan memberi anda arahan untuk mengesahkan identiti anda di edx.org supaya anda boleh mula berusaha untuk melengkapkan kursus edX anda.

source: EdX is committed to making it possible for you to take high quality courses from leading institutions regardless of your financial situation, earn a Verified Certificate, and share your success with others.
ms_my: EdX komited untuk membolehkan anda mengambil kursus berkualiti tinggi daripada institusi terkemuka tanpa mengira keadaan kewangan anda, memperoleh Sijil Disahkan dan berkongsi kejayaan anda dengan orang lain.

source: Sincerely,
ms_my: Yang ikhlas,

source: Apply for Financial Assistance
ms_my: Mohon Bantuan Kewangan

source: {platform_name} Home Page
ms_my: Halaman Utama {platform_name}.

source: Options Menu
ms_my: Menu Pilihan

source: {begin_strong}Warning:{end_strong} Your browser is not fully supported. We strongly recommend using {chrome_link} or {ff_link}.
ms_my: {begin_strong}Amaran:{end_strong} Penyemak imbas anda tidak disokong sepenuhnya. Kami amat mengesyorkan anda menggunakan {chrome_link} atau {ff_link}.

source: Discover New
ms_my: Temui Baharu

source: {name} Dashboard
ms_my: {name} Papan pemuka

source: Supplemental Links
ms_my: Pautan Tambahan

source: How it Works
ms_my: Bagaimana ia Berfungsi

source: Schools
ms_my: Sekolah

source: Register for free
ms_my: Daftar percuma

source: Profile
ms_my: Profil

source: Order History
ms_my: Sejarah Pesanan

source: Add Coupon Code
ms_my: Tambah Kod Kupon

source: Enter information about the coupon code below.
ms_my: Masukkan maklumat tentang kod kupon di bawah.

source: Coupon Code
ms_my: Kod Kupon

source: Discount Percentage
ms_my: Peratusan Diskaun

source: Add expiration date
ms_my: Tambah tarikh luput

source: Example Certificates
ms_my: Contoh Sijil

source: This course is configured to generate PDF certificates and this certificate type is no longer supported. Example certificates cannot be generated.
ms_my: Kursus ini dikonfigurasikan untuk menjana sijil PDF dan jenis sijil ini tidak lagi disokong. Sijil contoh tidak boleh dijana.

source: Generate Example Certificates
ms_my: Hasilkan Sijil Contoh

source: Generating example {name} certificate
ms_my: Menjana sijil {name} contoh

source: Error generating example {name} certificate: {error}
ms_my: Ralat menjana sijil contoh {name}: {error}

source: View {name} certificate
ms_my: Lihat sijil {name}.

source: Refresh Status
ms_my: Muat semula Status

source: Student-Generated Certificates
ms_my: Sijil Dijana Pelajar

source: Disable Student-Generated Certificates
ms_my: Lumpuhkan Sijil Dijana Pelajar

source: Enable Student-Generated Certificates
ms_my: Dayakan Sijil Dijana Pelajar

source: You must successfully generate example certificates before you enable student-generated certificates.
ms_my: Anda mesti berjaya menjana sijil contoh sebelum anda mendayakan sijil yang dijana pelajar.

source: Generate Certificates
ms_my: Jana Sijil

source: Course certificate generation requires an activated web certificate configuration.
ms_my: Penjanaan sijil kursus memerlukan konfigurasi sijil web yang diaktifkan.

source: When you are ready to generate certificates for your course, click Generate Certificates. You do not need to do this if you have set the certificate mode to on-demand generation.
ms_my: Apabila anda bersedia untuk menjana sijil untuk kursus anda, klik Jana Sijil. Anda tidak perlu melakukan ini jika anda telah menetapkan mod sijil kepada penjanaan atas permintaan.

source: Pending Tasks
ms_my: Tugas Tertunda

source: The status for any active tasks appears in a table below.
ms_my: Status untuk sebarang tugas aktif muncul dalam jadual di bawah.

source: Regenerate Certificates
ms_my: Menjana semula Sijil

source: To regenerate certificates for your course, choose the learners who will receive regenerated certificates and click Regenerate Certificates.
ms_my: Untuk menjana semula sijil untuk kursus anda, pilih pelajar yang akan menerima sijil yang dijana semula dan klik Jana Semula Sijil.

source: Choose learner types for regeneration
ms_my: Pilih jenis pelajar untuk penjanaan semula

source: Regenerate for learners who have already received certificates. ({count})
ms_my: Menjana semula untuk pelajar yang telah menerima sijil. ({count})

source: Regenerate for learners who have not received certificates. ({count})
ms_my: Menjana semula untuk pelajar yang belum menerima sijil. ({count})

source: Regenerate for learners with audit passing state. ({count})
ms_my: Menjana semula untuk pelajar dengan keadaan lulus audit. ({count})

source: Regenerate for learners with audit not passing state. ({count})
ms_my: Menjana semula untuk pelajar dengan keadaan tidak lulus audit. ({count})

source: Regenerate for learners in an error state. ({count})
ms_my: Menjana semula untuk pelajar dalam keadaan ralat. ({count})

source: Certificate Generation History
ms_my: Sejarah Penjanaan Sijil

source: Task name
ms_my: Nama tugas

source: SET CERTIFICATE EXCEPTIONS
ms_my: TETAPKAN PENGECUALIAN SIJIL

source: Set exceptions to generate certificates for learners who did not qualify for a certificate but have been given an exception by the course team. After you add learners to the exception list, click Generate Exception Certificates below.
ms_my: Tetapkan pengecualian untuk menjana sijil bagi pelajar yang tidak layak untuk sijil tetapi telah diberi pengecualian oleh pasukan kursus. Selepas anda menambah pelajar pada senarai pengecualian, klik Jana Sijil Pengecualian di bawah.

source: Invalidate Certificates
ms_my: Sijil Batal

source: Enrollment Information
ms_my: Maklumat Pendaftaran

source: Number of enrollees (admins, staff, and students) by track
ms_my: Bilangan pendaftaran (pentadbir, kakitangan dan pelajar) mengikut landasan

source: Honor
ms_my: Kehormatan

source: Professional
ms_my: Profesional

source: Executive Education
ms_my: Pendidikan Eksekutif

source: Unpaid Executive Education
ms_my: Pendidikan Eksekutif Tanpa Gaji

source: Paid Executive Education
ms_my: Pendidikan Eksekutif Berbayar

source: Master's
ms_my: Cikgu

source: Unpaid Bootcamp
ms_my: Bootcamp tidak berbayar

source: Paid Bootcamp
ms_my: Bootcamp Berbayar

source: Basic Course Information
ms_my: Maklumat Asas Kursus

source: Course Name:
ms_my: Nama Kursus:

source: Course Start Date:
ms_my: Tarikh Mula Kursus:

source: Course End Date:
ms_my: Tarikh Tamat Kursus:

source: No end date set
ms_my: Tiada tarikh tamat ditetapkan

source: Has the course started?
ms_my: Adakah kursus bermula?

source: Yes
ms_my: ya

source: No
ms_my: Tidak

source: Has the course ended?
ms_my: Adakah kursus telah tamat?

source: Number of sections:
ms_my: Bilangan bahagian:

source: Grade Cutoffs:
ms_my: Potongan Gred:

source: Course Warnings
ms_my: Amaran Kursus

source: Grading Configuration
ms_my: Konfigurasi Penggredan

source: The CSV of anonymized student IDs download has been relocated to the Reports section below.
ms_my: CSV muat turun ID pelajar tanpa nama telah dipindahkan ke bahagian Laporan di bawah.

source: Reports
ms_my: Laporan

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
ms_my: Untuk kursus besar, menghasilkan beberapa laporan boleh mengambil masa beberapa jam. Apabila penjanaan laporan selesai, pautan yang merangkumi tarikh dan masa penjanaan muncul dalam jadual di bawah. Laporan ini dijana di latar belakang, bermakna adalah OK untuk menavigasi keluar dari halaman ini semasa laporan anda dijana.

source: Please be patient and do not click these buttons multiple times. Clicking these buttons multiple times will significantly slow the generation process.
ms_my: Harap bersabar dan jangan klik butang ini beberapa kali. Mengklik butang ini beberapa kali akan melambatkan proses penjanaan dengan ketara.

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
ms_my: Klik untuk menjana fail CSV semua pelajar yang mendaftar dalam kursus ini, bersama-sama dengan maklumat profil seperti alamat e-mel dan nama pengguna:

source: Download profile information as a CSV
ms_my: Muat turun maklumat profil sebagai CSV

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
ms_my: Klik untuk menjana fail CSV yang menyenaraikan pelajar yang boleh mendaftar dalam kursus tetapi belum berbuat demikian.

source: Download a CSV of learners who can enroll
ms_my: Muat turun CSV pelajar yang boleh mendaftar

source: Click to download a CSV of anonymized student IDs:
ms_my: Klik untuk memuat turun CSV ID pelajar tanpa nama:

source: Get Student Anonymized IDs CSV
ms_my: Dapatkan CSV ID Tanpa Nama Pelajar

source: Click to generate a CSV file of all proctored exam results in this course.
ms_my: Klik untuk menjana fail CSV bagi semua keputusan peperiksaan terkawal dalam kursus ini.

source: Generate Proctored Exam Results Report
ms_my: Hasilkan Laporan Keputusan Peperiksaan Berkawal

source: Click to generate a CSV file of survey results for this course.
ms_my: Klik untuk menjana fail CSV hasil tinjauan untuk kursus ini.

source: Generate Survey Results Report
ms_my: Hasilkan Laporan Hasil Tinjauan

source: Select a problem to generate a CSV file that lists all student answers to the problem. You also select a section or chapter to include results of all problems in that section or chapter.
ms_my: Pilih masalah untuk menjana fail CSV yang menyenaraikan semua jawapan pelajar kepada masalah tersebut. Anda juga memilih bahagian atau bab untuk memasukkan keputusan semua masalah dalam bahagian atau bab itu.

source: NOTE
ms_my: NOTA

source: The generated report is limited to {max_entries} responses. If you expect more than {max_entries} responses, try generating the report on a chapter-by-chapter, or problem-by-problem basis, or contact your site administrator to increase the limit.
ms_my: Laporan yang dijana adalah terhad kepada {max_entry} respons. Jika anda menjangkakan lebih daripada {max_entry} jawapan, cuba jana laporan berdasarkan bab demi bab atau masalah demi masalah atau hubungi pentadbir tapak anda untuk meningkatkan had.

source: Click to list certificates that are issued for this course:
ms_my: Klik untuk menyenaraikan sijil yang dikeluarkan untuk kursus ini:

source: View Certificates Issued
ms_my: Lihat Sijil Dikeluarkan
