Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: This team does not have any members.
ms_my: Pasukan ini tidak mempunyai ahli.

source: Joined %(date)s
ms_my: Menyertai %(date)s

source: Last Activity %(date)s
ms_my: Aktiviti Terakhir %(tarikh)s

source: Remove this team member?
ms_my: Alih keluar ahli pasukan ini?

source: This learner will be removed from the team,allowing another learner to take the available spot.
ms_my: Pelajar ini akan dialih keluar daripada pasukan, membenarkan pelajar lain mengambil tempat yang tersedia.

source: Delete this team?
ms_my: Padamkan pasukan ini?

source: Deleting a team is permanent and cannot be undone.All members are removed from the team, and team discussions can no longer be accessed.
ms_my: Pemadaman pasukan adalah kekal dan tidak boleh dibuat asal. Semua ahli dialih keluar daripada pasukan dan perbincangan pasukan tidak boleh diakses lagi.

source: Team "{team}" successfully deleted.
ms_my: Pasukan "{team}" berjaya dipadamkan.

source: Manage
ms_my: Urus

source: You are not currently a member of any team.
ms_my: Anda bukan ahli mana-mana pasukan pada masa ini.

source: and others
ms_my: dan lain-lain

source: Last activity {date}
ms_my: Aktiviti terakhir {date}

source: View {span_start} {team_name} {span_end}
ms_my: Lihat {span_start} {team_name} {span_end}

source: An error occurred. Try again.
ms_my: Ralat berlaku. Cuba lagi.

source: No assignments for team
ms_my: Tiada tugasan untuk pasukan

source: Leave this team?
ms_my: Tinggalkan pasukan ini?

source: If you leave, you can no longer post in this team's discussions.Your place will be available to another learner.
ms_my: Jika anda keluar, anda tidak boleh membuat siaran dalam perbincangan pasukan ini lagi. Tempat anda akan tersedia kepada pelajar lain.

source: Confirm
ms_my: sahkan

source: You already belong to another team in this team set.
ms_my: Anda sudah pun menjadi ahli pasukan lain dalam set pasukan ini.

source: This team is full.
ms_my: Pasukan ini penuh.

source: Cannot join instructor managed team
ms_my: Tidak boleh menyertai pasukan terurus pengajar

source: Member
ms_my: ahli

source: All teams
ms_my: Semua pasukan

source: Teams Pagination
ms_my: Penomboran Pasukan

source: Topics
ms_my: Topik

source: My Teams
ms_my: Pasukan Saya

source: Browse
ms_my: Semak imbas

source: Your request could not be completed. Reload the page and try again.
ms_my: Permintaan anda tidak dapat diselesaikan. Muat semula halaman dan cuba lagi.

source: Your request could not be completed due to a server problem. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
ms_my: Permintaan anda tidak dapat diselesaikan kerana masalah pelayan. Muat semula halaman dan cuba lagi. Jika isu berterusan, klik tab Bantuan untuk melaporkan masalah.

source: Team Search
ms_my: Carian Pasukan

source: Create a New Team
ms_my: Buat Pasukan Baharu

source: Create a new team if you can't find an existing team to join, or if you would like to learn with friends you know.
ms_my: Cipta pasukan baharu jika anda tidak menemui pasukan sedia ada untuk disertai atau jika anda ingin belajar dengan rakan yang anda kenali.

source: Edit Team
ms_my: Edit Pasukan

source: If you make significant changes, make sure you notify members of the team before making these changes.
ms_my: Jika anda membuat perubahan ketara, pastikan anda memaklumkan ahli pasukan sebelum membuat perubahan ini.

source: Membership
ms_my: Keahlian

source: You can remove members from this team, especially if they have not participated in the team's activity.
ms_my: Anda boleh mengalih keluar ahli daripada pasukan ini, terutamanya jika mereka tidak mengambil bahagian dalam aktiviti pasukan.

source: Showing results for "{searchString}"
ms_my: Menunjukkan hasil untuk "{searchString}"

source: Search teams
ms_my: Pasukan carian

source: See all teams you belong to and all public teams in your course, organized by topic. Join an open public team to collaborate with other learners who are interested in the same topic as you are.
ms_my: Lihat semua pasukan yang anda sertai dan semua pasukan awam dalam kursus anda, disusun mengikut topik. Sertai pasukan awam terbuka untuk bekerjasama dengan pelajar lain yang berminat dengan topik yang sama seperti anda.

source: See all teams you belong to and all public teams in your course, organized by topic.
ms_my: Lihat semua pasukan yang anda sertai dan semua pasukan awam dalam kursus anda, disusun mengikut topik.

source: See all teams you belong to.
ms_my: Lihat semua pasukan yang anda sertai.

source: All Topics
ms_my: Semua Topik

source: The page "{route}" could not be found.
ms_my: Halaman "{route}" tidak ditemui.

source: The topic "{topic}" could not be found.
ms_my: Topik "{topic}" tidak ditemui.

source: The team "{team}" could not be found.
ms_my: Pasukan "{team}" tidak ditemui.

source: {team_count} Team
ms_my: {team_count} Pasukan

source: Topic
ms_my: Topik

source: View Teams in the {topic_name} Topic
ms_my: Lihat Pasukan dalam Topik {topic_name}.

source: {browse_span_start}Browse teams in other topics{span_end} or {search_span_start}search teams{span_end} in this topic. If you still can't find a team to join, {create_span_start}create a new team in this topic{span_end}.
ms_my: {browse_span_start}Semak imbas pasukan dalam topik lain{span_end} atau {search_span_start}pasukan carian{span_end} dalam topik ini. Jika anda masih tidak menemui pasukan untuk disertai, {create_span_start}buat pasukan baharu dalam topik ini{span_end}.

source: An error occurred while looking up team membership. Try refreshing the page.
ms_my: Ralat berlaku semasa mencari keahlian pasukan. Cuba muat semula halaman.

source: All topics
ms_my: Semua Topik

source: Insert Hyperlink
ms_my: Masukkan Hiperpautan

source: e.g. 'http://google.com'
ms_my: cth. 'http://google.com'

source: Link Description
ms_my: Penerangan Pautan

source: e.g. 'google'
ms_my: cth. 'google'

source: Please provide a description of the link destination.
ms_my: Sila berikan penerangan tentang destinasi pautan.

source: Insert Image (upload file or type URL)
ms_my: Sisipkan Imej (muat naik fail atau taip URL)

source: Type in a URL or use the "Choose File" button to upload a file from your machine. (e.g. 'http://example.com/img/clouds.jpg')
ms_my: Taipkan URL atau gunakan butang "Pilih Fail" untuk memuat naik fail daripada mesin anda. (cth. 'http://example.com/img/clouds.jpg')

source: Image Description
ms_my: Penerangan Imej

source: Please describe this image or agree that it has no contextual value by checking the checkbox.
ms_my: Sila huraikan imej ini atau bersetuju bahawa ia tidak mempunyai nilai kontekstual dengan menandai kotak pilihan.

source: e.g. 'Sky with clouds'. The description is helpful for users who cannot see the image.
ms_my: cth. 'Langit dengan awan'. Penerangan berguna untuk pengguna yang tidak dapat melihat imej.

source: How to create useful text alternatives.
ms_my: Bagaimana untuk mencipta alternatif teks yang berguna.

source: This image is for decorative purposes only and does not require a description.
ms_my: Imej ini adalah untuk tujuan hiasan sahaja dan tidak memerlukan penerangan.

source: Markdown Editing Help
ms_my: Bantuan Pengeditan Markdown

source: Please provide a valid URL.
ms_my: Sila berikan URL yang sah.

source: %(errorCount)s error found in form.
ms_my: %(errorCount)s ralat ditemui dalam borang.

source: Bold (Ctrl+B)
ms_my: Tebal (Ctrl+B)

source: Hyperlink (Ctrl+L)
ms_my: Hiperpautan (Ctrl+L)

source: Blockquote (Ctrl+Q)
ms_my: Petikan Sekat (Ctrl+Q)

source: Code Sample (Ctrl+K)
ms_my: Contoh Kod (Ctrl+K)

source: Image (Ctrl+G)
ms_my: Imej (Ctrl+G)

source: Numbered List (Ctrl+O)
ms_my: Senarai Bernombor (Ctrl+O)

source: Bulleted List (Ctrl+U)
ms_my: Senarai Berbulet (Ctrl+U)

source: Heading (Ctrl+H)
ms_my: Tajuk (Ctrl+H)

source: Horizontal Rule (Ctrl+R)
ms_my: Peraturan Mendatar (Ctrl+R)

source: Undo (Ctrl+Z)
ms_my: Buat asal (Ctrl+Z)

source: Redo (Ctrl+Y)
ms_my: Buat semula (Ctrl+Y)

source: Redo (Ctrl+Shift+Z)
ms_my: Buat Semula (Ctrl+Shift+Z)

source: strong text
ms_my: teks yang kuat

source: emphasized text
ms_my: teks yang ditekankan

source: enter link description here
ms_my: masukkan penerangan pautan di sini

source: Blockquote
ms_my: Sebut harga

source: enter code here
ms_my: masukkan kod di sini

source: List item
ms_my: Item senarai

source: Heading
ms_my: Tajuk

source: You have been logged out of your account. Click Okay to log in again now. Click Cancel to stay on this page (you must log in again to save your work).
ms_my: Anda telah log keluar daripada akaun anda. Klik Okay untuk log masuk semula sekarang. Klik Batal untuk kekal di halaman ini (anda mesti log masuk semula untuk menyimpan kerja anda).

source: Preview this query
ms_my: Pratonton pertanyaan ini

source: Open Calculator
ms_my: Buka Kalkulator

source: Close Calculator
ms_my: Tutup Kalkulator

source: All subsections
ms_my: Semua subseksyen

source: All units
ms_my: Semua unit

source: Click to change
ms_my: Klik untuk menukar

source: Select a chapter
ms_my: Pilih bab

source: Save changes
ms_my: Simpan perubahan

source: Please enter valid start date and time.
ms_my: Sila masukkan tarikh dan masa mula yang sah.

source: Due date cannot be before start date.
ms_my: Tarikh akhir tidak boleh sebelum tarikh mula.

source: Enter Due Date and Time
ms_my: Masukkan Tarikh dan Masa Tamat

source: Enter Start Date and Time
ms_my: Masukkan Tarikh dan Masa Mula

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
ms_my: Medan nama pengguna/e-mel pelajar diperlukan dan tidak boleh kosong. Sila isikan nama pengguna/e-mel dan kemudian tekan butang "Tambah ke Senarai Pengecualian".

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
ms_my: Medan nama pengguna/e-mel pelajar diperlukan dan tidak boleh kosong. Sila isikan nama pengguna/e-mel dan kemudian tekan butang "Sijil Tidak Sah".

source: Student Removed from certificate allowlist successfully.
ms_my: Pelajar berjaya dikeluarkan daripada senarai dibenarkan sijil.

source: Could not find Certificate Exception in the allowlist. Please refresh the page and try again
ms_my: Tidak dapat mencari Pengecualian Sijil dalam senarai yang dibenarkan. Sila muat semula halaman dan cuba lagi

source: Server Error, Please refresh the page and try again.
ms_my: Ralat Pelayan, Sila muat semula halaman dan cuba lagi.

source: <%- user %> already in exception list.
ms_my: <%- pengguna %> sudah berada dalam senarai pengecualian.

source: <%- user %> has been successfully added to the exception list. Click Generate Exception Certificate below to send the certificate.
ms_my: <%- user %> telah berjaya ditambahkan ke senarai pengecualian. Klik Jana Sijil Pengecualian di bawah untuk menghantar sijil.

source: learners were successfully added to exception list
ms_my: pelajar berjaya ditambahkan ke senarai pengecualian

source: learner was successfully added to the exception list
ms_my: pelajar telah berjaya ditambahkan ke senarai pengecualian

source: records are not in the correct format and have not been added to the exception list
ms_my: rekod tidak dalam format yang betul dan belum ditambah ke senarai pengecualian

source: record is not in the correct format and has not been added to the exception list
ms_my: rekod tidak dalam format yang betul dan belum ditambah ke senarai pengecualian

source: learner accounts cannot be found and have not been added to the exception list
ms_my: akaun pelajar tidak ditemui dan belum ditambahkan ke senarai pengecualian

source: learner account cannot be found and has not been added to the exception list
ms_my: akaun pelajar tidak ditemui dan belum ditambahkan ke senarai pengecualian

source: learners already appear on the exception list in this course
ms_my: pelajar telah pun muncul dalam senarai pengecualian dalam kursus ini

source: learner already appears on the exception list in this course
ms_my: pelajar sudah muncul pada senarai pengecualian dalam kursus ini

source: learners are not enrolled in this course and have not added to the exception list
ms_my: pelajar tidak didaftarkan dalam kursus ini dan belum ditambah ke senarai pengecualian

source: learner is not enrolled in this course and has not been added to the exception list
ms_my: pelajar tidak didaftarkan dalam kursus ini dan belum ditambah ke senarai pengecualian

source: learners have an active certificate invalidation in this course and have not been added to the exception list
ms_my: pelajar mempunyai sijil tidak sah aktif dalam kursus ini dan belum ditambah ke senarai pengecualian

source: learner has an active certificate invalidation in this course and has not been added to the exception list
ms_my: pelajar mempunyai sijil tidak sah aktif dalam kursus ini dan belum ditambah ke senarai pengecualian

source: learners encountered unknown errors
ms_my: pelajar mengalami ralat yang tidak diketahui

source: learner encountered an unknown error
ms_my: pelajar mengalami ralat yang tidak diketahui

source: Uploaded file issues. Click on "+" to view.
ms_my: Isu fail yang dimuat naik. Klik pada "+" untuk melihat.

source: Certificate of <%= user %> has already been invalidated. Please check your spelling and retry.
ms_my: Sijil <%= pengguna %> telah pun tidak sah. Sila semak ejaan anda dan cuba semula.

source: Certificate has been successfully invalidated for <%= user %>.
ms_my: Sijil telah berjaya dibatalkan untuk <%= pengguna %>.

source: The certificate for this learner has been re-validated and the system is re-running the grade for this learner.
ms_my: Sijil untuk pelajar ini telah disahkan semula dan sistem sedang menjalankan semula gred untuk pelajar ini.

source: Could not find Certificate Invalidation in the list. Please refresh the page and try again
ms_my: Tidak dapat mencari Pembatalan Sijil dalam senarai. Sila muat semula halaman dan cuba lagi

source: There has been an error processing your survey.
ms_my: Terdapat ralat semasa memproses tinjauan anda.

source: More
ms_my: Lagi

source: Less
ms_my: Kurang

source: HTML preview of post
ms_my: Pratonton HTML siaran

source: Preview
ms_my: Pratonton

source: Your question or idea (required)
ms_my: Soalan atau idea anda (diperlukan)

source: Please enter a valid donation amount.
ms_my: Sila masukkan jumlah derma yang sah.

source: Your donation could not be submitted.
ms_my: Derma anda tidak dapat diserahkan.

source: You will be refunded the amount you paid.
ms_my: Anda akan dikembalikan jumlah yang anda bayar.

source: You will not be refunded the amount you paid.
ms_my: Anda tidak akan dikembalikan jumlah yang anda bayar.

source: Are you sure you want to unenroll from the purchased course {courseName} ({courseNumber})?
ms_my: Adakah anda pasti mahu membatalkan pendaftaran kursus {courseName} ({courseNumber}) yang dibeli?

source: Are you sure you want to unenroll from {courseName} ({courseNumber})?
ms_my: Adakah anda pasti mahu membatalkan pendaftaran daripada {courseName} ({courseNumber})?

source: Are you sure you want to unenroll from the verified {certNameLong} track of {courseName} ({courseNumber})?
ms_my: Adakah anda pasti mahu menyahdaftar daripada runut {certNameLong} yang disahkan bagi {courseName} ({courseNumber})?

source: Are you sure you want to unenroll from the verified {certNameLong} track of {courseName} ({courseNumber})?
ms_my: Adakah anda pasti mahu menyahdaftar daripada runut {certNameLong} yang disahkan bagi {courseName} ({courseNumber})?

source: The refund deadline for this course has passed, so you will not receive a refund.
ms_my: Tarikh akhir bayaran balik untuk kursus ini telah berlalu, jadi anda tidak akan menerima bayaran balik.

source: Unable to determine whether we should give you a refund because of System Error. Please try again later.
ms_my: Tidak dapat menentukan sama ada kami patut memberi anda bayaran balik kerana Ralat Sistem. Sila cuba lagi kemudian.

source: Viewing %s course
ms_my: Melihat %s kursus

source: We couldn't find any results for "%s".
ms_my: Kami tidak dapat mencari sebarang hasil untuk "%s".

source: There was an error, try searching again.
ms_my: Terdapat ralat, cuba cari lagi.

source: Not divided
ms_my: Tidak berbelah bahagi

source: Discussions are unified; all learners interact with posts from other learners, regardless of the group they are in.
ms_my: Perbincangan disatukan; semua pelajar berinteraksi dengan siaran daripada pelajar lain, tanpa mengira kumpulan mereka berada.

source: Enrollment Tracks
ms_my: Jejak Pendaftaran

source: Use enrollment tracks as the basis for dividing discussions. All learners, regardless of their enrollment track, see the same discussion topics, but within divided topics, only learners who are in the same enrollment track see and respond to each others’ posts.
ms_my: Gunakan runut pendaftaran sebagai asas untuk membahagikan perbincangan. Semua pelajar, tanpa mengira trek pendaftaran mereka, melihat topik perbincangan yang sama, tetapi dalam topik yang dibahagikan, hanya pelajar yang berada dalam trek pendaftaran yang sama melihat dan membalas siaran satu sama lain.

source: Cohorts
ms_my: Kohort

source: Use cohorts as the basis for dividing discussions. All learners, regardless of cohort, see the same discussion topics, but within divided topics, only members of the same cohort see and respond to each others’ posts.
ms_my: Gunakan kohort sebagai asas untuk membahagikan perbincangan. Semua pelajar, tanpa mengira kohort, melihat topik perbincangan yang sama, tetapi dalam topik yang dibahagikan, hanya ahli kohort yang sama melihat dan membalas siaran satu sama lain.

source: Discussion topics in the course are not divided.
ms_my: Topik perbincangan dalam kursus tidak dibahagikan.

source: Any divided discussion topics are divided based on enrollment track.
ms_my: Sebarang topik perbincangan yang dibahagikan dibahagikan berdasarkan trek pendaftaran.

source: Any divided discussion topics are divided based on cohort.
ms_my: Sebarang topik perbincangan yang dibahagikan dibahagikan berdasarkan kohort.

source: Your changes have been saved. {details}
ms_my: Perubahan anda telah disimpan. {details}

source: We have encountered an error. Refresh your browser and then try again.
ms_my: Kami telah mengalami ralat. Muat semula penyemak imbas anda dan kemudian cuba lagi.

source: We've encountered an error. Refresh your browser and then try again.
ms_my: Kami telah mengalami ralat. Muat semula penyemak imbas anda dan kemudian cuba lagi.

source: An error has occurred. Make sure that you are connected to the Internet, and then try refreshing the page.
ms_my: Ralat telah berlaku. Pastikan anda disambungkan ke Internet, kemudian cuba muat semula halaman.

source: Hide notes
ms_my: Sembunyikan nota

source: Notes visible
ms_my: Nota kelihatan

source: Show notes
ms_my: Tunjukkan nota

source: Notes hidden
ms_my: Nota tersembunyi

source: Please enter a term in the {anchorStart} search field{anchorEnd}.
ms_my: Sila masukkan istilah dalam medan carian {anchorStart}{anchorEnd}.

source: Current tab
ms_my: Tab semasa

source: Location in Course
ms_my: Lokasi dalam Kursus

source: Recent Activity
ms_my: Aktiviti Terkini

source: No results found for "{query_string}". Please try searching again.
ms_my: Tiada hasil ditemui untuk "{query_string}". Sila cuba cari semula.

source: Search Results
ms_my: Hasil Carian

source: Tags
ms_my: Tag

source: Unable to submit application
ms_my: Tidak dapat menyerahkan permohonan

source: An error has occurred. Check your Internet connection and try again.
ms_my: Ralat telah berlaku. Semak sambungan Internet anda dan cuba lagi.

source: Choose one
ms_my: Pilih satu

source: Selected tab
ms_my: Tab yang dipilih

source: Saved cohort
ms_my: kohort disimpan

source: Error adding learners.
ms_my: Ralat menambah pelajar.

source: Enter a username or email.
ms_my: Masukkan nama pengguna atau e-mel.

source: {numUsersAdded} learner has been added to this cohort.
ms_my: {numUsersAdded} pelajar telah ditambahkan pada kohort ini.

source: {numMoved} learner was moved from {prevCohort}
ms_my: {numMoved} pelajar telah dialihkan dari {prevCohort}

source: {numPresent} learner was already in the cohort
ms_my: {numPresent} pelajar telah pun berada dalam kohort

source: {numPreassigned} learner was pre-assigned for this cohort. This learner will automatically be added to the cohort when they enroll in the course.
ms_my: {numPreassigned} pelajar telah ditetapkan terlebih dahulu untuk kohort ini. Pelajar ini akan ditambahkan secara automatik pada kohort apabila mereka mendaftar dalam kursus.

source: Unknown username: {user}
ms_my: Nama pengguna tidak diketahui: {user}

source: Invalid email address: {email}
ms_my: Alamat e-mel tidak sah: {email}

source: Cohort assignment not allowed: {email_or_username}
ms_my: Tugasan kohort tidak dibenarkan: {email_or_username}

source: There was an error when trying to add learners:
ms_my: {numErrors} pelajar tidak dapat ditambahkan pada kohort ini:

source: View all errors
ms_my: Lihat semua ralat

source: You must specify a name for the cohort
ms_my: Anda mesti menyatakan nama untuk kohort

source: You did not select a content group
ms_my: Anda tidak memilih kumpulan kandungan

source: The selected content group does not exist
ms_my: Kumpulan kandungan yang dipilih tidak wujud

source: The cohort cannot be saved
ms_my: Kohort tidak boleh disimpan

source: The cohort cannot be added
ms_my: Kohort tidak boleh ditambah

source: You currently have no cohorts configured
ms_my: Pada masa ini anda tidak mempunyai kohort yang dikonfigurasikan

source: Add Cohort
ms_my: Tambah Kohort

source: The {cohortGroupName} cohort has been created. You can manually add students to this cohort below.
ms_my: Kohort {cohortGroupName} telah dibuat. Anda boleh menambah pelajar secara manual pada kohort ini di bawah.

source: Assign students to cohorts by uploading a CSV file.
ms_my: Tugaskan pelajar ke kohort dengan memuat naik fail CSV.

source: Choose a .csv file
ms_my: Pilih fail .csv

source: Only properly formatted .csv files will be accepted.
ms_my: Hanya fail .csv yang diformat dengan betul akan diterima.

source: Upload File and Assign Students
ms_my: Muat Naik Fail dan Tugaskan Pelajar

source: Your file '{file}' has been uploaded. Allow a few minutes for processing.
ms_my: Fail anda '{file}' telah dimuat naik. Biarkan beberapa minit untuk diproses.

source: Cohorts Enabled
ms_my: Kohort Didayakan

source: Cohorts Disabled
ms_my: Kohort Dilumpuhkan

source: Allow students to generate certificates for this course?
ms_my: Benarkan pelajar menjana sijil untuk kursus ini?

source: Prevent students from generating certificates in this course?
ms_my: Menghalang pelajar daripada menjana sijil dalam kursus ini?

source: Start generating certificates for all students in this course?
ms_my: Mula menjana sijil untuk semua pelajar dalam kursus ini?a

source: Error while generating certificates. Please try again.
ms_my: Ralat semasa menjana sijil. Sila cuba lagi.

source: Start regenerating certificates for students in this course?
ms_my: Mula menjana semula sijil untuk pelajar dalam kursus ini?

source: Error while regenerating certificates. Please try again.
ms_my: Ralat semasa menjana semula sijil. Sila cuba lagi.

source: Loading data...
ms_my: Memuatkan data...

source: Error getting issued certificates list.
ms_my: Ralat mendapatkan senarai sijil yang dikeluarkan.

source: Error generating anonymous IDs. Please try again.
ms_my: Ralat menjana ID tanpa nama. Sila cuba lagi.
