Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: The number of {type} assignments in the course matches the number defined here.
ms_my: Bilangan tugasan {type} dalam kursus sepadan dengan nombor yang ditakrifkan di sini.

source: Course Handouts
ms_my: Edaran Kursus

source: You have no handouts defined
ms_my: Anda tidak mempunyai edaran yang ditentukan

source: There is invalid code in your content. Please check to make sure it is valid HTML.
ms_my: Terdapat kod tidak sah dalam kandungan anda. Sila semak untuk memastikan ia adalah HTML yang sah.

source: Date
ms_my: tarikh

source: Post
ms_my: Pos

source: Discussion
ms_my: Perbincangan

source: Enable discussion
ms_my: Dayakan perbincangan

source: Topics for unpublished units would not be created
ms_my: Topik untuk unit yang tidak diterbitkan tidak akan dibuat

source: Please enable discussions for graded units from the
ms_my: Sila dayakan perbincangan untuk unit gred daripada

source: Discussion Configuration
ms_my: Konfigurasi Perbincangan

source: Due Date:
ms_my: Tarikh Akhir:

source: Due Time in UTC:
ms_my: Masa Tamat dalam UTC:

source: Clear Grading Due Date
ms_my: Jelas Tarikh Akhir Penggredan

source: Chapter Name
ms_my: Nama Bab

source: Chapter {order}
ms_my: Bab {order}

source: provide the title/name of the chapter that will be used in navigating
ms_my: berikan tajuk/nama bab yang akan digunakan dalam pelayaran

source: Chapter Asset
ms_my: Aset Bab

source: upload a PDF file or provide the path to a Studio asset file
ms_my: muat naik fail PDF atau berikan laluan ke fail aset Studio

source: Upload PDF
ms_my: Muat naik PDF

source: delete chapter
ms_my: padam bab

source: Textbook information
ms_my: Maklumat buku teks

source: Textbook Name
ms_my: Nama Buku Teks

source: Introduction to Cookie Baking
ms_my: Pengenalan kepada Pembakaran Kuki

source: provide the title/name of the text book as you would like your students to see it
ms_my: berikan tajuk/nama buku teks seperti yang anda mahu pelajar anda lihat

source: Chapter information
ms_my: Maklumat bab

source: Add a Chapter
ms_my: Tambah Bab

source: Edit Title
ms_my: Edit Tajuk

source: You are editing content from a Library.
ms_my: Anda sedang mengedit kandungan daripada Perpustakaan.

source: Edits made here will only be reflected in this course. These edits may be overridden later if updates are accepted.
ms_my: Pengeditan yang dibuat di sini hanya akan ditunjukkan dalam kursus ini. Pengeditan ini mungkin akan diganti kemudian jika kemas kini diterima.

source: View in Library
ms_my: Lihat dalam Perpustakaan

source: Embed your subsection content directly on a page using an iframe, and view it without the LMS header and footer.
ms_my: Benamkan kandungan subseksyen anda secara langsung pada halaman menggunakan iframe dan lihatnya tanpa pengepala dan pengaki LMS.

source: Click to copy link to clipboard
ms_my: Klik untuk menyalin pautan ke papan keratan

source: Copy link
ms_my: Salin pautan

source: When sharing this link with your learners, they will see the content of the subsection along with the header and footer of your LMS.
ms_my: Apabila berkongsi pautan ini dengan pelajar anda, mereka akan melihat kandungan subbahagian itu bersama-sama dengan pengepala dan pengaki LMS anda.

source: Grading
ms_my: Penggredan

source: Grade as:
ms_my: Gred sebagai:

source: Not Graded
ms_my: Tidak Digred

source: Cannot delete when in use by an experiment
ms_my: Tidak boleh memadam apabila digunakan oleh percubaan

source: This Group Configuration is used in:
ms_my: Konfigurasi Kumpulan ini digunakan dalam:

source: This Group Configuration is not in use. Start by adding a content experiment to any Unit via the {linkStart}Course Outline{linkEnd}.
ms_my: Konfigurasi Kumpulan ini tidak digunakan. Mulakan dengan menambahkan percubaan kandungan pada mana-mana Unit melalui {linkStart}Kerangka Kursus{linkEnd}.

source: Group Configuration information
ms_my: Maklumat Konfigurasi Kumpulan

source: Group Configuration Name
ms_my: Nama Konfigurasi Kumpulan

source: Group Configuration ID
ms_my: ID Konfigurasi Kumpulan

source: This is the Name of the Group Configuration
ms_my: Ini ialah Nama Konfigurasi Kumpulan

source: Name or short description of the configuration
ms_my: Nama atau penerangan ringkas konfigurasi

source: This is the Description of the Group Configuration
ms_my: Ini ialah Penerangan Konfigurasi Kumpulan

source: Optional long description
ms_my: Penerangan panjang pilihan

source: Group information
ms_my: Maklumat kumpulan

source: Name of the groups that students will be assigned to, for example, Control, Video, Problems. You must have two or more groups.
ms_my: Nama kumpulan yang akan ditugaskan kepada pelajar, contohnya, Kawalan, Video, Masalah. Anda mesti mempunyai dua atau lebih kumpulan.

source: Add another group
ms_my: Tambah kumpulan lain

source: This configuration is currently used in content experiments. If you make changes to the groups, you may need to edit those experiments.
ms_my: Konfigurasi ini sedang digunakan dalam percubaan kandungan. Jika anda membuat perubahan pada kumpulan, anda mungkin perlu mengedit percubaan tersebut.

source: delete group
ms_my: memadam kumpulan

source: Enter 3-5 highlights to include in the email message that learners receive for this section (250 character limit).
ms_my: Masukkan 3-5 sorotan untuk disertakan dalam mesej e-mel yang pelajar terima untuk bahagian ini (had 250 aksara).

source: Highlight {highlight_index}
ms_my: Serlahkan {highlight_index}

source: A highlight to look forward to this week.
ms_my: Sorotan yang ditunggu-tunggu minggu ini.

source: License Type
ms_my: Jenis Lesen

source: Learn more about {license_name}
ms_my: Ketahui lebih lanjut tentang {license_name}

source: Options for {license_name}
ms_my: Pilihan untuk {license_name}

source: The following options are available for the {license_name} license.
ms_my: Pilihan berikut tersedia untuk lesen {license_name}.

source: License Display
ms_my: Paparan Lesen

source: The following message will be displayed at the bottom of the courseware pages within your course:
ms_my: Mesej berikut akan dipaparkan di bahagian bawah halaman perisian kursus dalam kursus anda:

source: Creative Commons licensed content, with terms as follow:
ms_my: Kandungan berlesen Creative Commons, dengan syarat seperti berikut:

source: Some Rights Reserved
ms_my: Beberapa Hak Terpelihara

source: New %(item_type)s
ms_my: %(item_type)s baharu

source: Clear
ms_my: Jelas

source: Clear Value
ms_my: Nilai Jelas

source: Download
ms_my: Muat turun

source: {categoryText} in {parentDisplayname}
ms_my: {categoryText} dalam {parentDisplayname}

source: Current location
ms_my: Lokasi semasa

source: Currently selected
ms_my: Dipilih pada masa ini

source: You haven't added any textbooks to this course yet.
ms_my: Anda belum menambah sebarang buku teks pada kursus ini.

source: Add your first textbook
ms_my: Tambah buku teks pertama anda

source: Previous
ms_my: Sebelumnya

source: This group controls access to:
ms_my: Kumpulan ini mengawal akses kepada:

source: In the {linkStart}Course Outline{linkEnd}, use this group to control access to a component.
ms_my: Dalam {linkStart}Kerangka Kursus{linkEnd}, gunakan kumpulan ini untuk mengawal akses kepada komponen.

source: Previous Uploads
ms_my: Muat Naik Sebelumnya

source: Download available encodings (.csv)
ms_my: Muat turun pengekodan tersedia (.csv)

source: Thumbnail
ms_my: Gambar kecil

source: Video ID
ms_my: ID Video

source: Transcripts
ms_my: Transkrip

source: Video Status
ms_my: Status Video

source: Action
ms_my: Tindakan

source: Remove this video
ms_my: Alih keluar video ini

source: Remove {video_name} video
ms_my: Alih keluar video {video_name}.

source: Never published
ms_my: Tidak pernah diterbitkan

source: Last published %(last_published_date)s by %(publish_username)s
ms_my: Terakhir diterbitkan %(last_published_date)s oleh %(publish_username)s

source: Previously published
ms_my: Sebelum ini diterbitkan

source: Draft (Never published)
ms_my: Draf (Tidak pernah diterbitkan)

source: Visible to Staff Only
ms_my: Kelihatan kepada Kakitangan Sahaja

source: Published and Live
ms_my: Diterbitkan dan Langsung

source: Published (not yet released)
ms_my: Diterbitkan (belum dikeluarkan)

source: Draft (Unpublished changes)
ms_my: Draf (Perubahan tidak diterbitkan)

source: Release:
ms_my: Keluaran:

source: Publishing Status
ms_my: Status Penerbitan

source: Draft saved on {lastSavedStart}{editedOn}{lastSavedEnd} by {editedByStart}{editedBy}{editedByEnd}
ms_my: Draf disimpan pada {lastSavedStart}{editedOn}{lastSavedEnd} oleh {editedByStart}{editedBy}{editedByEnd}

source: Last published {lastPublishedStart}{publishedOn}{lastPublishedEnd} by {publishedByStart}{publishedBy}{publishedByEnd}
ms_my: Terakhir diterbitkan {lastPublishedStart}{publishedOn}{lastPublishedEnd} oleh {publishedByStart}{publishedBy}{publishedByEnd}

source: with %(release_date_from)s
ms_my: dengan %(release_date_from)s

source: Is Visible To:
ms_my: Kelihatan Kepada:

source: Will Be Visible To:
ms_my: Akan Kelihatan Kepada:

source: Staff Only
ms_my: Kakitangan Sahaja

source: with %(section_or_subsection)s
ms_my: dengan %(section_or_subsection)s

source: Staff and Learners
ms_my: Kakitangan dan Pelajar

source: Hide from learners
ms_my: Sembunyi daripada pelajar

source: Note: Do not hide graded assignments after they have been released.
ms_my: Nota: Jangan sembunyikan tugasan yang dinilai selepas ia dikeluarkan.

source: Copy Unit
ms_my: Unit Salin

source: Release Date and Time
ms_my: Tarikh dan Masa Tayangan

source: Release Date:
ms_my: Tarikh Keluaran:

source: Release Time in UTC:
ms_my: Masa Tayangan dalam UTC:

source: Clear Release Date/Time
ms_my: Kosongkan Tarikh/Masa Keluaran

source: Due in:
ms_my: Diperuntukkan dalam:

source: weeks from learner enrollment date
ms_my: minggu dari tarikh pendaftaran pelajar

source: If a learner starts on {startDate}, this subsection will be due on {projectedDueIn}.
ms_my: Jika pelajar bermula pada {startDate}, subseksyen ini akan tamat tempoh pada {projectedDueIn}.

source: The minimum number of weeks this subsection can be due in is 1 week from the learner enrollment date.
ms_my: Bilangan minimum minggu subseksyen ini boleh tamat tempoh ialah 1 minggu dari tarikh pendaftaran pelajar.

source: Assessment Results Visibility
ms_my: Keterlihatan Keputusan Penilaian

source: Always show assessment results
ms_my: Sentiasa tunjukkan hasil penilaian

source: When learners submit an answer to an assessment, they immediately see whether the answer is correct or incorrect, and the score received.
ms_my: Apabila pelajar menyerahkan jawapan kepada penilaian, mereka segera melihat sama ada jawapan itu betul atau salah, dan markah diterima.

source: Never show assessment results
ms_my: Jangan sekali-kali menunjukkan hasil penilaian

source: Learners never see whether their answers to assessments are correct or incorrect, nor the score received.
ms_my: Pelajar tidak pernah melihat sama ada jawapan mereka kepada penilaian adalah betul atau salah, mahupun markah yang diterima.

source: Show assessment results when subsection is past due
ms_my: Tunjukkan hasil penilaian apabila subseksyen telah lewat

source: Learners do not see whether their answers to assessments were correct or incorrect, nor the score received, until after the due date for the subsection has passed.
ms_my: Pelajar tidak melihat sama ada jawapan mereka kepada pentaksiran adalah betul atau salah, mahupun markah yang diterima, sehingga selepas tarikh akhir untuk subseksyen itu berlalu.

source: If the subsection does not have a due date, learners always see their scores when they submit answers to assessments.
ms_my: Jika subseksyen tidak mempunyai tarikh akhir, pelajar sentiasa melihat markah mereka apabila mereka menyerahkan jawapan kepada penilaian.

source: PDF Chapters
ms_my: Bab PDF

source: View Live
ms_my: Lihat Langsung

source: Signatory
ms_my: Penandatangan

source: Signature Image
ms_my: Imej Tandatangan

source: Certificate Signatory Configuration
ms_my: Konfigurasi Penandatangan Sijil

source: Name
ms_my: nama:

source: Name of the signatory
ms_my: Nama penandatangan

source: Title
ms_my: Tajuk

source: Title of the signatory
ms_my: Tajuk penandatangan

source: Titles more than 100 characters may prevent students from printing their certificate on a single page.
ms_my: Tajuk lebih daripada 100 aksara mungkin menghalang pelajar daripada mencetak sijil mereka pada satu halaman.

source: Organization
ms_my: Organisasi

source: Organization of the signatory
ms_my: Organisasi penandatangan

source: The organization that this signatory belongs to, as it should appear on certificates.
ms_my: Organisasi milik penandatangan ini, seperti yang sepatutnya tertera pada sijil.

source: Path to Signature Image
ms_my: Laluan ke Imej Tandatangan

source: Image must be in PNG format
ms_my: Imej mestilah dalam format PNG

source: Upload Signature Image
ms_my: Muat Naik Imej Tandatangan

source: Section Visibility
ms_my: Keterlihatan Bahagian

source: Visible to learners
ms_my: Kelihatan kepada pelajar

source: It is visible to learners, ensuring that all learners can view its contents.
ms_my: Ia kelihatan kepada pelajar, memastikan semua pelajar boleh melihat kandungannya.

source: Hide in Course Outline, accessible via Link
ms_my: Sembunyikan dalam Rangka Kursus, boleh diakses melalui Pautan

source: It is intentionally hidden from standard navigation, ensuring that only individuals with the link can view its contents.
ms_my: Ia sengaja disembunyikan daripada navigasi standard, memastikan bahawa hanya individu yang mempunyai pautan boleh melihat kandungannya.

source: If you make this section visible in the table of content, learners will be able to see its content.
ms_my: Jika anda menjadikan bahagian ini kelihatan dalam jadual kandungan, pelajar akan dapat melihat kandungannya.

source: It is intentionally hidden from learners, ensuring that only the course staff can view its contents.
ms_my: Ia sengaja disembunyikan daripada pelajar, memastikan hanya kakitangan kursus boleh melihat kandungannya.

source: If the unit was previously published and released to learners, any changes you made to the unit when it was hidden will now be visible to learners.
ms_my: Jika unit itu sebelum ini diterbitkan dan dikeluarkan kepada pelajar, sebarang perubahan yang anda buat pada unit apabila ia disembunyikan kini akan kelihatan kepada pelajar.

source: If you make this %(xblockType)s visible to learners, learners will be able to see its content after the release date has passed and you have published the unit. Only units that are explicitly hidden from learners will remain hidden after you clear this option for the %(xblockType)s.
ms_my: Jika anda menjadikan %(xblockType)s ini kelihatan kepada pelajar, pelajar akan dapat melihat kandungannya selepas tarikh keluaran berlalu dan anda telah menerbitkan unit tersebut. Hanya unit yang tersembunyi secara eksplisit daripada pelajar akan kekal tersembunyi selepas anda mengosongkan pilihan ini untuk %(xblockType)s.

source: Xpert unit summaries
ms_my: Ringkasan unit Xpert

source: Enable summaries
ms_my: Dayakan ringkasan

source: Current Role:
ms_my: Peranan Semasa:

source: You!
ms_my: awak!

source: send an email message to {email}
ms_my: hantar mesej e-mel ke {email}

source: Add {role} Access
ms_my: Tambahkan {role} Akses

source: Remove {role} Access
ms_my: Alih keluar Akses {role}.

source: Delete the user, {username}
ms_my: Padamkan pengguna, {username}

source: Set as a Special Exam
ms_my: Tetapkan sebagai Peperiksaan Khas

source: Exam Types
ms_my: Jenis Peperiksaan

source: This subsection was released to learners as a proctored exam, but was reverted back to a basic or timed exam. You may not configure it as a proctored exam now. Contact edX Support for assistance.
ms_my: Subseksyen ini dikeluarkan kepada pelajar sebagai peperiksaan terkawal, tetapi telah dikembalikan semula kepada peperiksaan asas atau bermasa. Anda mungkin tidak mengkonfigurasinya sebagai peperiksaan terkawal sekarang. Hubungi Sokongan edX untuk mendapatkan bantuan.

source: This proctored exam has been released to learners. You may not convert it to another type of special exam. You may revert this subsection back to being a basic exam by selecting 'None', or a timed exam, but you will NOT be able to configure it as a proctored exam in the future.
ms_my: Peperiksaan terkawal ini telah dikeluarkan kepada pelajar. Anda tidak boleh menukarnya kepada jenis peperiksaan khas yang lain. Anda boleh mengembalikan subseksyen ini kepada peperiksaan asas dengan memilih 'Tiada', atau peperiksaan bermasa, tetapi anda TIDAK akan dapat mengkonfigurasinya sebagai peperiksaan terkawal pada masa hadapan.

source: Timed
ms_my: Ditetapkan masa

source: Use a timed exam to limit the time learners can spend on problems in this subsection. Learners must submit answers before the time expires. You can allow additional time for individual learners through the Instructor Dashboard.
ms_my: Gunakan peperiksaan bermasa untuk mengehadkan masa pelajar boleh menghabiskan masalah dalam subseksyen ini. Pelajar mesti menyerahkan jawapan sebelum masa tamat. Anda boleh memberi masa tambahan untuk pelajar individu melalui Papan Pemuka Pengajar.

source: Proctored
ms_my: Dilindungi

source: Proctored exams are timed and they record video of each learner taking the exam. The videos are then reviewed to ensure that learners follow all examination rules. Please note that setting this exam as proctored will change the visibility settings to "Hide content after due date."
ms_my: Peperiksaan yang dikawal ditetapkan masa dan mereka merakam video setiap pelajar yang mengambil peperiksaan. Video tersebut kemudiannya disemak untuk memastikan pelajar mematuhi semua peraturan peperiksaan. Sila ambil perhatian bahawa menetapkan peperiksaan ini sebagai terkawal akan menukar tetapan keterlihatan kepada "Sembunyikan kandungan selepas tarikh tamat."

source: Use Onboarding to introduce learners to proctoring, verify their identity, and create an onboarding profile. Learners must complete the onboarding profile step prior to taking a proctored exam. Profile reviews take 2+ business days.
ms_my: Gunakan Onboarding untuk memperkenalkan pelajar kepada proctoring, mengesahkan identiti mereka dan membuat profil onboarding. Pelajar mesti melengkapkan langkah profil onboarding sebelum mengambil peperiksaan terkawal. Semakan profil mengambil masa 2+ hari perniagaan.

source: Practice Proctored
ms_my: Amalan Dilindungi

source: Use a practice proctored exam to introduce learners to the proctoring tools and processes. Results of a practice exam do not affect a learner's grade.
ms_my: Gunakan peperiksaan terkawal amalan untuk memperkenalkan pelajar kepada alatan dan proses pengawas. Keputusan peperiksaan amalan tidak menjejaskan gred pelajar.

source: Time Allotted (HH:MM):
ms_my: Masa Diperuntukkan (HH:MM):

source: Select a time allotment for the exam. If it is over 24 hours, type in the amount of time. You can grant individual learners extra time to complete the exam through the Instructor Dashboard.
ms_my: Pilih peruntukan masa untuk peperiksaan. Jika melebihi 24 jam, taipkan jumlah masa. Anda boleh memberi masa tambahan kepada pelajar individu untuk menyelesaikan peperiksaan melalui Papan Pemuka Pengajar.

source: Review Rules
ms_my: Semakan Peraturan

source: Specify any rules or rule exceptions that the proctoring review team should enforce when reviewing the videos. For example, you could specify that calculators are allowed. These specified rules are visible to learners before the learners start the exam, along with the {linkStart}general proctored exam rules{linkEnd}.
ms_my: Nyatakan sebarang peraturan atau pengecualian peraturan yang perlu dikuatkuasakan oleh pasukan penyemakan pengawas semasa menyemak video. Sebagai contoh, anda boleh menentukan bahawa kalkulator dibenarkan. Peraturan yang ditentukan ini boleh dilihat oleh pelajar sebelum pelajar memulakan peperiksaan, bersama-sama dengan {linkStart}peraturan peperiksaan am terkawal{linkEnd}.

source: General Proctored Exam Rules
ms_my: Peraturan Peperiksaan Terkawal Am

source: Specify any rules or rule exceptions that the proctoring review team should enforce when reviewing the videos. For example, you could specify that calculators are allowed. These specified rules are visible to learners before the learners start the exam.
ms_my: Nyatakan sebarang peraturan atau pengecualian peraturan yang perlu dikuatkuasakan oleh pasukan penyemakan pengawas semasa menyemak video. Sebagai contoh, anda boleh menentukan bahawa kalkulator dibenarkan. Peraturan yang ditentukan ini boleh dilihat oleh pelajar sebelum pelajar memulakan peperiksaan.

source: Account
ms_my: Akaun

source: This action updates the {provider} information for your entire organization.
ms_my: Tindakan ini mengemas kini maklumat {provider} untuk keseluruhan organisasi anda.

source: Enter the account information for your organization.
ms_my: Masukkan maklumat akaun untuk organisasi anda.

source: API Key
ms_my: Kunci API

source: API Secret
ms_my: Rahsia API

source: Unit Access
ms_my: Akses Unit

source: Restrict access to:
ms_my: Hadkan akses kepada:

source: Select a group type
ms_my: Pilih jenis kumpulan

source: Select one or more groups:
ms_my: Pilih satu atau lebih kumpulan:

source: Deleted Group
ms_my: Kumpulan Dipadamkan

source: This group no longer exists. Choose another group or do not restrict access to this unit.
ms_my: Kumpulan ini tidak lagi wujud. Pilih kumpulan lain atau jangan hadkan akses kepada unit ini.

source: File upload succeeded
ms_my: Muat naik fail berjaya

source: Verification Checkpoint
ms_my: Pusat Pemeriksaan Pengesahan

source: Must complete verification checkpoint
ms_my: Mesti melengkapkan pusat pemeriksaan pengesahan

source: Verification checkpoint to be completed
ms_my: Pusat pemeriksaan pengesahan akan dilengkapkan

source: Learners who require verification must pass the selected checkpoint to see the content in this unit. Learners who do not require verification see this content by default.
ms_my: Pelajar yang memerlukan pengesahan mesti melepasi pusat pemeriksaan yang dipilih untuk melihat kandungan dalam unit ini. Pelajar yang tidak memerlukan pengesahan melihat kandungan ini secara lalai.

source: Recommended image resolution is {imageResolution}, maximum image file size should be {maxFileSize} and format must be one of {supportedImageFormats}.
ms_my: Peleraian imej yang disyorkan ialah {imageResolution}, saiz fail imej maksimum hendaklah {maxFileSize} dan format mestilah salah satu daripada {supportedImageFormats}.

source: Read more
ms_my: Baca lagi

source: No transcript uploaded.
ms_my: Tiada transkrip dimuat naik.

source: Show transcripts ({totalTranscripts})
ms_my: Tunjukkan transkrip ({totalTranscripts})

source: Set Access
ms_my: Tetapkan Akses

source: Edit %(display_name)s (required)
ms_my: Edit %(display_name)s (diperlukan)

source: You have done a dry run of force publishing the course. Nothing has changed. Had you run it, the following course versions would have been change.
ms_my: Anda telah melakukan kerja keras menerbitkan kursus. Tiada apa yang berubah. Sekiranya anda menjalankannya, versi kursus berikut akan berubah.

source: The published branch version, {published}, was reset to the draft branch version, {draft}.
ms_my: Versi cawangan yang diterbitkan, {published}, telah ditetapkan semula kepada versi cawangan draf, {draft}.

source: Add URLs for additional versions
ms_my: Tambah URL untuk versi tambahan
