Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Show Sent Email History
ms_my: Tunjukkan Sejarah E-mel Dihantar

source: To read a sent email message, click its subject.
ms_my: Untuk membaca mesej e-mel yang dihantar, klik subjeknya.

source: To see the status for all email tasks submitted for this course, click this button:
ms_my: Untuk melihat status bagi semua tugasan e-mel yang diserahkan untuk kursus ini, klik butang ini:

source: Show Email Task History
ms_my: Tunjukkan Sejarah Tugasan E-mel

source: Set Course Mode Price
ms_my: Tetapkan Harga Mod Kursus

source: Please enter Course Mode detail below
ms_my: Sila masukkan butiran Mod Kursus di bawah

source: Course Price
ms_my: Harga Kursus

source: Currency
ms_my: mata wang

source: Set Price
ms_my: Tetapkan Harga

source: Proctortrack Escalation Email:
ms_my: E-mel Peningkatan Proctortrack:

source: Allowance Section
ms_my: Bahagian Elaun

source: Student Onboarding Status
ms_my: Status Penyertaan Pelajar

source: Student Special Exam Attempts
ms_my: Percubaan Peperiksaan Khas Pelajar

source: Review Dashboard
ms_my: Semak Papan Pemuka

source: View gradebook for enrolled learners
ms_my: Lihat buku gred untuk pelajar yang mendaftar

source: View Gradebook
ms_my: Lihat Buku Gred

source: Note: This feature is available only to courses with a small number of enrolled learners.
ms_my: Nota: Ciri ini hanya tersedia untuk kursus dengan bilangan pelajar yang berdaftar yang kecil.

source: View a specific learner's enrollment status
ms_my: Lihat status pendaftaran pelajar tertentu

source: Learner's {platform_name} email address or username *
ms_my: Alamat e-mel atau nama pengguna {platform_name} pelajar *

source: Learner email address or username
ms_my: Alamat e-mel atau nama pengguna pelajar

source: View Enrollment Status
ms_my: Lihat Status Pendaftaran

source: View a specific learner's grades and progress
ms_my: Lihat gred dan kemajuan pelajar tertentu

source: Learner's {platform_name} email address or username
ms_my: Alamat e-mel atau nama pengguna {platform_name} pelajar

source: View Progress Page
ms_my: Lihat Halaman Kemajuan

source: Adjust a learner's grade for a specific problem
ms_my: Laraskan gred pelajar untuk masalah tertentu

source: Location of problem in course
ms_my: Lokasi masalah dalam kursus

source: Example
ms_my: Contoh

source: Problem location
ms_my: Lokasi masalah

source: Attempts
ms_my: Percubaan

source: Allow a learner who has used up all attempts to work on the problem again.
ms_my: Benarkan pelajar yang telah menggunakan semua percubaan untuk menyelesaikan masalah itu semula.

source: Reset Attempts to Zero
ms_my: Tetapkan Semula Percubaan kepada Sifar

source: Rescore
ms_my: Skor semula

source: For the specified problem, rescore the learner's responses. The 'Rescore Only If Score Improves' option updates the learner's score only if it improves in the learner's favor.
ms_my: Untuk masalah yang dinyatakan, nilai semula jawapan pelajar. Pilihan 'Skor Semula Hanya Jika Skor Meningkatkan' mengemas kini skor pelajar hanya jika ia bertambah baik memihak kepada pelajar.

source: Score Override
ms_my: Penggantian Skor

source: For the specified problem, override the learner's score.
ms_my: Untuk masalah yang dinyatakan, tolak skor pelajar.

source: New score for problem, out of the total points available for the problem
ms_my: Skor baharu untuk masalah, daripada jumlah mata yang tersedia untuk masalah itu

source: Score
ms_my: skor

source: Override Learner's Score
ms_my: Gantikan Skor Pelajar

source: Problem History
ms_my: Sejarah Masalah

source: For the specified problem, permanently and completely delete the learner's answers and scores from the database.
ms_my: Untuk masalah yang dinyatakan, padamkan jawapan dan markah pelajar secara kekal dan sepenuhnya daripada pangkalan data.

source: Task Status
ms_my: Status Tugas

source: Show the status for the rescoring tasks that you submitted for this learner and problem.
ms_my: Tunjukkan status untuk tugasan penskoran yang anda serahkan untuk pelajar dan masalah ini.

source: Show Task Status
ms_my: Tunjukkan Status Tugas

source: Adjust a learner's entrance exam results
ms_my: Laraskan keputusan peperiksaan kemasukan pelajar

source: Allow the learner to take the exam again.
ms_my: Benarkan pelajar mengambil peperiksaan semula.

source: Allow Skip
ms_my: Benarkan Langkau

source: Waive the requirement for the learner to take the exam.
ms_my: Ketepikan keperluan pelajar untuk mengambil peperiksaan.

source: Let Learner Skip Entrance Exam
ms_my: Biarkan Pelajar Ponteng Peperiksaan Masuk

source: Rescore any responses that have been submitted. The 'Rescore All Problems Only If Score Improves' option updates the learner's scores only if it improves in the learner's favor.
ms_my: Skor semula sebarang respons yang telah diserahkan. Pilihan 'Skor Semula Semua Masalah Hanya Jika Skor Meningkatkan' mengemas kini markah pelajar hanya jika ia bertambah baik memihak kepada pelajar.

source: Rescore All Problems
ms_my: Semula Semua Masalah

source: Rescore All Problems Only If Score Improves
ms_my: Skor Semula Semua Masalah Hanya Jika Markah Bertambah

source: Entrance Exam History
ms_my: Sejarah Peperiksaan Kemasukan

source: For the entire entrance exam, permanently and completely delete the learner's answers and scores from the database.
ms_my: Untuk keseluruhan peperiksaan kemasukan, padamkan jawapan dan markah pelajar secara kekal dan sepenuhnya daripada pangkalan data.

source: Show the status for the rescoring tasks that you submitted for this learner and entrance exam.
ms_my: Tunjukkan status untuk tugasan pemarkahan yang anda serahkan untuk pelajar dan peperiksaan kemasukan ini.

source: Adjust all enrolled learners' grades for a specific problem
ms_my: Laraskan semua gred pelajar yang didaftarkan untuk masalah tertentu

source: Allows all learners to work on the problem again.
ms_my: Membenarkan semua pelajar untuk menyelesaikan masalah itu semula.

source: Rescore submitted responses. The 'Rescore Only If Scores Improve' option updates a learner's score only if it improves in the learner's favor.
ms_my: Skor semula jawapan yang diserahkan. Pilihan 'Rescore Only If Scores Improve' mengemas kini skor pelajar hanya jika ia bertambah baik memihak kepada pelajar.

source: Rescore All Learners' Submissions
ms_my: Skor Semula Semua Penyerahan Pelajar

source: Rescore Only If Scores Improve
ms_my: Skor semula Hanya Jika Markah Bertambah

source: Show the status for the tasks that you submitted for this problem.
ms_my: Tunjukkan status untuk tugasan yang anda serahkan untuk masalah ini.

source: Note
ms_my: Nota

source: Click to download a CSV of anonymized student IDs:
ms_my: Klik untuk memuat turun CSV ID pelajar tanpa nama:

source: My Courses
ms_my: Kursus Saya

source: There was an error when loading this module!
ms_my: Terdapat ralat semasa memuatkan modul ini!

source: This module is available only for users who are signed into {platform}. Kindly sign in and refresh this page to load the content.
ms_my: Modul ini tersedia hanya untuk pengguna yang log masuk ke {platform}. Sila log masuk dan muat semula halaman ini untuk memuatkan kandungan.

source: NOTE:
ms_my: NOTA:

source: The email used to sign into this platform and {platform} should be the same.
ms_my: E-mel yang digunakan untuk log masuk ke platform ini dan {platform} hendaklah sama.

source: Change Preferred Language
ms_my: Tukar Bahasa Pilihan

source: Please choose your preferred language
ms_my: Sila pilih bahasa pilihan anda

source: Save Language Settings
ms_my: Simpan Tetapan Bahasa

source: Don't see your preferred language? {link_start}Volunteer to become a translator!{link_end}
ms_my: Tidak melihat bahasa pilihan anda? {link_start}Sukarelawan untuk menjadi penterjemah!{link_end}

source: Explore Courses
ms_my: Terokai Kursus

source: Peer Grading
ms_my: Penggredan Rakan Sebaya

source: Here is a list of problems that need to be peer graded for this course.
ms_my: Berikut adalah senarai masalah yang perlu digredkan rakan sebaya untuk kursus ini.

source: Problem Name
ms_my: Nama Masalah

source: Due date
ms_my: Tarikh Akhir

source: Graded
ms_my: Digredkan

source: Available
ms_my: Tersedia

source: Required
ms_my: Diperlukan

source: No due date
ms_my: Tiada tarikh akhir

source: The due date has passed, and peer grading for this problem is closed at this time.
ms_my: Tarikh tamat telah berlalu dan penggredan rakan sebaya untuk masalah ini ditutup pada masa ini.

source: The due date has passed, and peer grading is closed at this time.
ms_my: Tarikh tamat telah berlalu dan penggredan rakan sebaya ditutup pada masa ini.

source: Learning to Grade
ms_my: Belajar untuk Gred

source: Hide Question
ms_my: Sembunyikan Soalan

source: Student Response
ms_my: Respon Pelajar

source: Written Feedback
ms_my: Maklum Balas Bertulis

source: Please include some written feedback as well.
ms_my: Sila sertakan beberapa maklum balas bertulis juga.

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
ms_my: Penyerahan ini mempunyai kandungan yang eksplisit, menyinggung perasaan atau (saya mengesyaki) diciplak.

source: How did I do?
ms_my: Bagaimana saya lakukan?

source: Ready to grade!
ms_my: Bersedia untuk gred!

source: You have finished learning to grade, which means that you are now ready to start grading.
ms_my: Anda telah selesai belajar untuk menggred, yang bermaksud bahawa anda kini bersedia untuk memulakan penggredan.

source: Start Grading!
ms_my: Mulakan Penggredan!

source: Learning to grade
ms_my: Belajar untuk gred

source: You have not yet finished learning to grade this problem.
ms_my: Anda masih belum habis belajar untuk menilai masalah ini.

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
ms_my: Anda kini akan ditunjukkan satu siri esei yang diberi skor pengajar, dan akan diminta untuk menjaringkannya sendiri.

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
ms_my: Sebaik sahaja anda boleh menjaringkan esei sama seperti pengajar, anda akan bersedia untuk menilai rakan sebaya anda.

source: Start learning to grade
ms_my: Mula belajar untuk gred

source: Are you sure that you want to flag this submission?
ms_my: Adakah anda pasti mahu membenderakan penyerahan ini?

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
ms_my: Anda akan membenderakan penyerahan. Anda hanya perlu membenderakan penyerahan yang mengandungi kandungan yang eksplisit, menyinggung perasaan atau (disyaki) diciplak. Jika penyerahan tidak ditujukan kepada soalan atau tidak betul, anda harus memberikannya skor sifar dan maklum balas yang disertakan dan bukannya membenderakannya.

source: Remove Flag
ms_my: Keluarkan Bendera

source: Keep Flag
ms_my: Simpan Bendera

source: Go Back
ms_my: Pergi Balik

source: Account Activation Info
ms_my: Maklumat Pengaktifan Akaun

source: Your Password Reset is Complete
ms_my: Tetapan Semula Kata Laluan Anda Selesai

source: Password Reset Complete
ms_my: Set Semula Kata Laluan Selesai

source: Your password has been reset. {start_link}Sign-in to your account.{end_link}
ms_my: Kata laluan anda telah ditetapkan semula. {start_link}Log masuk ke akaun anda.{end_link}

source: Reset Your {platform_name} Password
ms_my: Tetapkan Semula Kata Laluan {platform_name} Anda

source: Invalid Password Reset Link
ms_my: Pautan tetapan semula kata laluan tidak sah

source: This password reset link is invalid. It may have been used already. To reset your password, go to the {start_link}sign-in{end_link} page and select {start_strong}Forgot password{end_strong}.
ms_my: Pautan tetapan semula kata laluan ini tidak sah. Ia mungkin telah digunakan. Untuk menetapkan semula kata laluan anda, pergi ke halaman {start_link}log masuk{end_link} dan pilih {start_strong}Lupa kata laluan{end_strong}.

source: Password reset successful
ms_my: Penetapan semula kata laluan berjaya

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
ms_my: Kami telah menghantar e-mel kepada anda arahan untuk menetapkan kata laluan anda ke alamat e-mel yang anda serahkan. Anda sepatutnya menerimanya tidak lama lagi.

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} .
ms_my: Halaman yang anda cari tidak ditemui. Kembali ke {link_start}halaman utama{link_end} .

source: Too Many Requests
ms_my: Terlalu Banyak Permintaan

source: Your request has been rate-limited. Please try again later.
ms_my: Permintaan anda telah dihadkan kadar. Sila cuba lagi kemudian.

source: This page left intentionally blank. Feel free to add your own content.
ms_my: Halaman ini sengaja dibiarkan kosong. Jangan ragu untuk menambah kandungan anda sendiri.

source: Our system indicates that you are trying to access this {platform_name} course from a country or region currently subject to U.S. economic and trade sanctions. Unfortunately, because {platform_name} is required to comply with export controls, we cannot allow you to access this course at this time.
ms_my: Sistem kami menunjukkan bahawa anda cuba mengakses kursus {platform_name} ini dari negara atau wilayah yang kini tertakluk pada sekatan ekonomi dan perdagangan A.S. Malangnya, kerana {platform_name} diperlukan untuk mematuhi kawalan eksport, kami tidak boleh membenarkan anda mengakses kursus ini pada masa ini.

source: FAQ
ms_my: Soalan Lazim

source: Jobs
ms_my: Pekerjaan

source: In the Press
ms_my: Dalam Akhbar

source: Currently the {platform_name} servers are down
ms_my: Pada masa ini pelayan {platform_name} tidak berfungsi

source: Our staff is currently working to get the site back up as soon as possible.
ms_my: Kakitangan kami sedang berusaha untuk memulihkan tapak secepat mungkin.

source: There has been a 500 error on the {platform_name} servers
ms_my: Terdapat ralat 500 pada pelayan {platform_name}.

source: Please wait a few seconds and then reload the page.
ms_my: Sila tunggu beberapa saat dan kemudian muat semula halaman.

source: Currently the {platform_name} servers are overloaded
ms_my: Pada masa ini pelayan {platform_name} terlebih muatan

source: Account Settings
ms_my: Tetapan Akaun

source: and access to private sites offered by MIT Open Learning, Wharton Executive Education, and Harvard Medical School
ms_my: dan akses kepada tapak peribadi yang ditawarkan oleh MIT Open Learning, Wharton Executive Education, dan Harvard Medical School

source: Please Wait
ms_my: Sila tunggu

source: Sign in or Register
ms_my: Log masuk atau Daftar

source: Student Support
ms_my: Sokongan Pelajar

source: Contact {platform_name} Support
ms_my: Hubungi Sokongan {platform_name}.

source: Student Support: Enrollment
ms_my: Sokongan Pelajar: Pendaftaran

source: Student Support: Feature Based Enrollments
ms_my: Sokongan Pelajar: Pendaftaran Berdasarkan Ciri

source: Content Type Gating
ms_my: Jenis Kandungan Gating

source: Course Duration Limits
ms_my: Had Tempoh Kursus

source: Is Enabled
ms_my: Didayakan

source: No results found
ms_my: Tiada hasil ditemui

source: Student Support: Manage User
ms_my: Sokongan Pelajar: Urus Pengguna

source: Program Enrollments Inspector
ms_my: Pemeriksa Pendaftaran Program

source: User Survey
ms_my: Tinjauan Pengguna

source: Pre-Course Survey
ms_my: Tinjauan Pra-Kursus

source: You can begin your course as soon as you complete the following form. Required fields are marked with an asterisk (*). This information is for the use of {platform_name} only. It will not be linked to your public profile in any way.
ms_my: Anda boleh memulakan kursus anda sebaik sahaja anda melengkapkan borang berikut. Medan yang diperlukan ditandakan dengan asterisk (*). Maklumat ini adalah untuk kegunaan {platform_name} sahaja. Ia tidak akan dipautkan ke profil awam anda dalam apa jua cara.

source: You are missing the following required fields:
ms_my: Anda tiada medan yang diperlukan berikut:

source: Cancel and Return to Dashboard
ms_my: Batal dan Kembali ke Papan Pemuka

source: Why do I need to complete this information?
ms_my: Mengapa saya perlu melengkapkan maklumat ini?

source: We use the information you provide to improve our course for both current and future students. The more we know about your specific needs, the better we can make your course experience.
ms_my: Kami menggunakan maklumat yang anda berikan untuk menambah baik kursus kami untuk pelajar semasa dan akan datang. Lebih banyak kami tahu tentang keperluan khusus anda, lebih baik kami boleh membuat pengalaman kursus anda.

source: Who can I contact if I have questions?
ms_my: Siapa yang boleh saya hubungi jika saya mempunyai soalan?

source: If you have any questions about this course or this form, you can contact {link_start}{mail_to_link}{link_end}.
ms_my: Jika anda mempunyai sebarang soalan tentang kursus ini atau borang ini, anda boleh menghubungi {link_start}{mail_to_link}{link_end}.

source: Skeleton Page
ms_my: Halaman Rangka

source: Search the course
ms_my: Cari kursus

source: Start Course
ms_my: Mulakan Kursus

source: Have questions?
ms_my: Ada soalan?

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
ms_my: Sila baca {a_start}Soalan Lazim kami untuk melihat soalan lazim tentang sijil kami{a_end}.

source: Re-Verify for {course_name}
ms_my: Sahkan Semula untuk {course_name}

source: Verification Deadline Has Passed
ms_my: Tarikh Akhir Pengesahan Telah Lulus

source: Upgrade Deadline Has Passed
ms_my: ATarikh Akhir Naik Taraf Telah Berlalu

source: The verification deadline for {course_name} was {{date}}. Verification is no longer available.
ms_my: Tarikh akhir pengesahan untuk {course_name} ialah {{date}}. Pengesahan tidak lagi tersedia.

source: The deadline to upgrade to a verified certificate for this course has passed.
ms_my: Tarikh akhir untuk menaik taraf kepada sijil yang disahkan untuk kursus ini telah berlalu.

source: Enroll In {course_name}
ms_my: Daftar Dalam {course_name}

source: Technical Requirements
ms_my: Keperluan Teknikal

source: Please make sure your browser is updated to the {strong_start}{a_start}most recent version possible{a_end}{strong_end}. Also, please make sure your {strong_start}webcam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings).{strong_end}
ms_my: Sila pastikan penyemak imbas anda dikemas kini kepada {strong_start}{a_start}versi terbaharu yang mungkin{a_end}{strong_end}. Selain itu, sila pastikan {strong_start}kamera web anda dipalamkan, dihidupkan dan dibenarkan untuk berfungsi dalam penyemak imbas web anda (biasanya boleh dilaraskan dalam tetapan penyemak imbas anda).{strong_end}

source: Re-Verification
ms_my: Pengesahan Semula

source: Identity Verification
ms_my: Pengesahan Identiti

source: You have already submitted your verification information. You will see a message on your dashboard when the verification process is complete (usually within 5-7 days).
ms_my: Anda telah pun menyerahkan maklumat pengesahan anda. Anda akan melihat mesej pada papan pemuka anda apabila proses pengesahan selesai (biasanya dalam masa 5-7 hari).

source: You cannot verify your identity at this time.
ms_my: Anda tidak boleh mengesahkan identiti anda pada masa ini.

source: Return to Your Dashboard
ms_my: Kembali ke Papan Pemuka Anda

source: This website uses cookies to ensure you get the best experience on our website. If you continue browsing this site, we understand that you accept the use of cookies.
ms_my: Laman web ini menggunakan kuki untuk memastikan anda mendapat pengalaman terbaik di laman web kami. Jika anda terus melayari tapak ini, kami faham bahawa anda menerima penggunaan kuki.

source: Got it!
ms_my: faham!

source: Learn more
ms_my: Ketahui lebih lanjut

source: {span_start}active{span_end}
ms_my: {span_start}aktif{span_end}

source: Course Wiki
ms_my: Wiki Kursus

source: Preview Language Setting
ms_my: Pratonton Tetapan Bahasa

source: Language Code
ms_my: Kod Bahasa

source: e.g. en for English
ms_my: cth. en untuk bahasa Inggeris

source: Preview Theme
ms_my: Pratonton Tema

source: All Rights Reserved
ms_my: Hak Cipta Terpelihara

source: Attribution
ms_my: Atribusi

source: Noncommercial
ms_my: Bukan komersial

source: No Derivatives
ms_my: Tiada Derivatif

source: Share Alike
ms_my: Kongsi Sama

source: Creative Commons licensed content, with terms as follow:
ms_my: Kandungan berlesen Creative Commons, dengan syarat seperti berikut:

source: Some Rights Reserved
ms_my: Beberapa Hak Terpelihara

source: Upcoming Dates
ms_my: Tarikh Akan Datang

source: View all course dates
ms_my: Lihat semua tarikh kursus

source: Learn About Verified Certificates
ms_my: Ketahui Tentang Sijil Disahkan

source: {platform_name} Verified Certificate
ms_my: {platform_name} Sijil Disahkan

source: Why upgrade?
ms_my: Kenapa naik taraf?

source: Official proof of completion
ms_my: Bukti rasmi siap

source: Easily shareable certificate
ms_my: Sijil yang boleh dikongsi dengan mudah

source: Proven motivator to complete the course
ms_my: Motivator yang terbukti untuk menamatkan kursus

source: Certificate purchases help {platform_name} continue to offer free courses
ms_my: Pembelian sijil membantu {platform_name} terus menawarkan kursus percuma

source: How it works
ms_my: Bagaimana ia berfungsi

source: Pay the Verified Certificate upgrade fee
ms_my: Bayar yuran peningkatan Sijil Disahkan

source: Verify your identity with a webcam and government-issued ID
ms_my: Sahkan identiti anda dengan kamera web dan ID keluaran kerajaan

source: Study hard and pass the course
ms_my: Belajar bersungguh-sungguh dan lulus kursus

source: Share your certificate with friends, employers, and others
ms_my: Kongsi sijil anda dengan rakan, majikan dan orang lain

source: Upgrade ({course_price})
ms_my: Naik taraf ({course_price})

source: This course does not have any updates.
ms_my: Kursus ini tidak mempunyai sebarang kemas kini.

source: Connected Accounts
ms_my: Akaun Bersambung

source: Linked
ms_my: Dipautkan

source: Not Linked
ms_my: Tidak Berpaut

source: Unlink
ms_my: Nyahpaut

source: Link
ms_my: Pautan

source: Completed {completion_date_html}
ms_my: Selesai {completion_date_html}

source: {course_mode} certificate
ms_my: sijil {course_mode}.

source: You haven't earned any certificates yet.
ms_my: Anda belum memperoleh sebarang sijil lagi.

source: Explore New Courses
ms_my: Terokai Kursus Baharu

source: Learner Profile
ms_my: Profil Pelajar

source: View My Records
ms_my: Lihat Rekod Saya

source: My Profile
ms_my: Profil Saya

source: Build out your profile to personalize your identity on {platform_name}.
ms_my: Bina profil anda untuk memperibadikan identiti anda pada {platform_name}.

source: An error occurred. Try loading the page again.
ms_my: Ralat berlaku. Cuba muatkan halaman sekali lagi.

source: {tos_link_start}Terms of Service{tos_link_end} and {honor_link_start}Honor Code{honor_link_end}
ms_my: {tos_link_start}Syarat Perkhidmatan{tos_link_end} dan {honor_link_start}Kod Kehormatan{honor_link_end}

source: Copyright
ms_my: Hak Cipta

source: Copyright {year}. All rights reserved.
ms_my: Hak cipta {year}. Semua hak terpelihara.

source: For anyone, anywhere, anytime
ms_my: Untuk sesiapa sahaja, di mana sahaja, pada bila-bila masa
