Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Click to add a new section
ms_my: Klik untuk menambah bahagian baharu

source: New Section
ms_my: Bahagian Baru

source: Reindex current course
ms_my: Indeks semula kursus semasa

source: Reindex
ms_my: Indeks semula

source: Collapse All Sections
ms_my: Runtuhkan Semua Bahagian

source: Expand All Sections
ms_my: Kembangkan Semua Bahagian

source: Click to open the courseware in the LMS in a new tab
ms_my: Klik untuk membuka perisian kursus dalam LMS dalam tab baharu

source: View Live
ms_my: Lihat Langsung

source: Creating your course organization
ms_my: Mewujudkan organisasi kursus anda

source: You add sections, subsections, and units directly in the outline.
ms_my: Anda menambah bahagian, subseksyen dan unit secara langsung dalam garis besar.

source: Create a section, then add subsections and units. Open a unit to add course components.
ms_my: Buat bahagian, kemudian tambahkan subbahagian dan unit. Buka unit untuk menambah komponen kursus.

source: Reorganizing your course
ms_my: Menyusun semula kursus anda

source: Drag sections, subsections, and units to new locations in the outline.
ms_my: Seret bahagian, subbahagian dan unit ke lokasi baharu dalam garis besar.

source: Learn more about the course outline
ms_my: Ketahui lebih lanjut tentang rangka kursus

source: Setting release dates and grading policies
ms_my: Menetapkan tarikh keluaran dan dasar penggredan

source: Select the Configure icon for a section or subsection to set its release date. When you configure a subsection, you can also set the grading policy and due date.
ms_my: Pilih ikon Konfigurasikan untuk bahagian atau subseksyen untuk menetapkan tarikh keluarannya. Apabila anda mengkonfigurasi subseksyen, anda juga boleh menetapkan dasar penggredan dan tarikh tamat tempoh.

source: Learn more about grading policy settings
ms_my: Ketahui lebih lanjut tentang tetapan dasar penggredan

source: Changing the content learners see
ms_my: Menukar kandungan yang dilihat oleh pelajar

source: To publish draft content, select the Publish icon for a section, subsection, or unit.
ms_my: Untuk menerbitkan kandungan draf, pilih ikon Terbitkan untuk bahagian, subseksyen atau unit.

source: To make a section, subsection, or unit unavailable to learners, select the Configure icon for that level, then select the appropriate {em_start}Hide{em_end} option. Grades for hidden sections, subsections, and units are not included in grade calculations.
ms_my: Untuk menjadikan bahagian, subseksyen atau unit tidak tersedia kepada pelajar, pilih ikon Konfigurasikan untuk tahap itu, kemudian pilih pilihan {em_start}Sembunyikan{em_end} yang sesuai. Gred untuk bahagian tersembunyi, subseksyen dan unit tidak termasuk dalam pengiraan gred.

source: To hide the content of a subsection from learners after the subsection due date has passed, select the Configure icon for a subsection, then select {em_start}Hide content after due date{em_end}. Grades for the subsection remain included in grade calculations.
ms_my: Untuk menyembunyikan kandungan subseksyen daripada pelajar selepas tarikh tamat subseksyen berlalu, pilih ikon Konfigurasikan untuk subseksyen, kemudian pilih {em_start}Sembunyikan kandungan selepas tarikh tamat{em_end}. Gred untuk subseksyen kekal termasuk dalam pengiraan gred.

source: Learn more about content visibility settings
ms_my: Ketahui lebih lanjut tentang tetapan keterlihatan kandungan

source: Pages & Resources
ms_my: Halaman & Sumber

source: Pages
ms_my: muka surat

source: New Page
ms_my: Halaman Baharu

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
ms_my: Nota: Halaman boleh dilihat secara umum. Jika pengguna mengetahui URL halaman, mereka boleh melihat halaman itu walaupun mereka tidak berdaftar atau log masuk ke kursus anda.

source: Show this page
ms_my: Tunjukkan halaman ini

source: This page cannot be reordered
ms_my: Halaman ini tidak boleh disusun semula

source: You can add additional custom pages to your course.
ms_my: Anda boleh menambah halaman tersuai tambahan pada kursus anda.

source: Add a New Page
ms_my: Tambah Halaman Baharu

source: What are pages?
ms_my: Apakah halaman?

source: Pages are listed horizontally at the top of your course. Default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
ms_my: Halaman disenaraikan secara mendatar di bahagian atas kursus anda. Halaman lalai (Rumah, Kursus, Perbincangan, Wiki dan Kemajuan) diikuti oleh buku teks dan halaman tersuai yang anda buat.

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
ms_my: Anda boleh membuat dan mengedit halaman tersuai untuk menyediakan pelajar kandungan kursus tambahan. Contohnya, anda boleh membuat halaman untuk dasar penggredan, slaid kursus dan kalendar kursus.

source: How do pages look to students in my course?
ms_my: Bagaimanakah halaman kelihatan kepada pelajar dalam kursus saya?

source: Students see the default and custom pages at the top of your course and use these links to navigate.
ms_my: Pelajar melihat halaman lalai dan tersuai di bahagian atas kursus anda dan menggunakan pautan ini untuk menavigasi.

source: See an example
ms_my: Lihat contoh

source: What are custom pages?
ms_my: Apakah halaman tersuai?

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course syllabus, and a course calendar.
ms_my: Anda boleh membuat dan mengedit halaman tersuai untuk menyediakan pelajar kandungan kursus tambahan. Contohnya, anda boleh membuat halaman untuk dasar penggredan, sukatan pelajaran kursus dan kalendar kursus.

source: How do custom pages look to students in my course?
ms_my: Bagaimanakah halaman tersuai kelihatan kepada pelajar dalam kursus saya?

source: Custom pages are listed horizontally at the top of your course after default pages.
ms_my: Halaman tersuai disenaraikan secara mendatar di bahagian atas kursus anda selepas halaman lalai.

source: Pages in Your Course
ms_my: Halaman dalam Kursus Anda

source: Preview of Pages in your course
ms_my: Pratonton Halaman dalam kursus anda

source: Pages appear in your course's top navigation bar. The default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
ms_my: Halaman muncul dalam bar navigasi teratas kursus anda. Halaman lalai (Rumah, Kursus, Perbincangan, Wiki, dan Kemajuan) diikuti oleh buku teks dan halaman tersuai.

source: close modal
ms_my: tutup modal

source: Internal Server Error
ms_my: Ralat Pelayan Dalaman

source: The Page You Requested Page Cannot be Found
ms_my: Halaman Yang Anda Minta Halaman Tidak Dapat Ditemui

source: We're sorry. We couldn't find the {studio_name} page you're looking for. You may want to return to the {studio_name} Dashboard and try again.
ms_my: Kami minta maaf. Kami tidak menemui halaman {studio_name} yang anda cari. Anda mungkin mahu kembali ke Papan Pemuka {studio_name} dan cuba lagi.

source: The Server Encountered an Error
ms_my: Pelayan Menghadapi Ralat

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the {studio_name} Dashboard or try this request again.
ms_my: Kami minta maaf. Terdapat masalah dengan pelayan semasa cuba memproses permintaan terakhir anda. Anda mungkin mahu kembali ke Papan Pemuka {studio_name} atau cuba permintaan ini sekali lagi.

source: Back to dashboard
ms_my: Kembali ke papan pemuka

source: Library Export
ms_my: Eksport Perpustakaan

source: Course Export
ms_my: Eksport Kursus

source: About Exporting Libraries
ms_my: Perihal Mengeksport Perpustakaan

source: You can export libraries and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the library structure and content. You can also re-import libraries that you've exported.
ms_my: Anda boleh mengeksport perpustakaan dan mengeditnya di luar {studio_name}. Fail yang dieksport ialah fail .tar.gz (iaitu, fail .tar yang dimampatkan dengan GNU Zip) yang mengandungi struktur dan kandungan perpustakaan. Anda juga boleh mengimport semula perpustakaan yang telah anda eksport.

source: About Exporting Courses
ms_my: Mengenai Mengeksport Kursus

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
ms_my: Anda boleh mengeksport kursus dan mengeditnya di luar {studio_name}. Fail yang dieksport ialah fail .tar.gz (iaitu, fail .tar yang dimampatkan dengan GNU Zip) yang mengandungi struktur dan kandungan kursus. Anda juga boleh mengimport semula kursus yang telah anda eksport.

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
ms_my: {em_start}Awas:{em_end} Apabila anda mengeksport kursus, maklumat seperti kunci API MATLAB, pasport LTI, rentetan token rahsia anotasi dan URL storan anotasi disertakan dalam data yang dieksport. Jika anda berkongsi fail anda yang dieksport, anda juga mungkin berkongsi maklumat sensitif atau khusus lesen.

source: Export My Library Content
ms_my: Eksport Kandungan Pustaka Saya

source: Export My Course Content
ms_my: Eksport Kandungan Kursus Saya

source: Export Library Content
ms_my: Eksport Kandungan Perpustakaan

source: Export Course Content
ms_my: Eksport Kandungan Kursus

source: Library Export Status
ms_my: Status Eksport Perpustakaan

source: Course Export Status
ms_my: Status Eksport Kursus

source: Preparing
ms_my: Bersedia

source: Preparing to start the export
ms_my: Bersedia untuk memulakan eksport

source: Exporting
ms_my: Mengeksport

source: Creating the export data files (You can now leave this page safely, but avoid making drastic changes to content until this export is complete)
ms_my: Mencipta fail data eksport (Kini anda boleh meninggalkan halaman ini dengan selamat, tetapi elakkan membuat perubahan drastik pada kandungan sehingga eksport ini selesai)

source: Compressing
ms_my: Memampatkan

source: Compressing the exported data and preparing it for download
ms_my: Memampatkan data yang dieksport dan menyediakannya untuk dimuat turun

source: Your exported library can now be downloaded
ms_my: Pustaka anda yang dieksport kini boleh dimuat turun

source: Your exported course can now be downloaded
ms_my: Kursus anda yang dieksport kini boleh dimuat turun

source: Download Exported Library
ms_my: Muat turun Perpustakaan yang Dieksport

source: Download Exported Course
ms_my: Muat turun Kursus yang Dieksport

source: Data {em_start}exported with{em_end} your course:
ms_my: Data {em_start}dieksport dengan{em_end} kursus anda:

source: Values from Advanced Settings, including MATLAB API keys and LTI passports
ms_my: Nilai daripada Tetapan Lanjutan, termasuk kunci API MATLAB dan pasport LTI

source: Course Structure
ms_my: Struktur Kursus

source: Individual Problems
ms_my: Masalah Individu

source: Course Assets
ms_my: Aset Kursus

source: Course Settings
ms_my: Tetapan Kursus

source: Data {em_start}not exported{em_end} with your course:
ms_my: Data {em_start}tidak dieksport{em_end} dengan kursus anda:

source: User Data
ms_my: Data Pengguna

source: Course Team Data
ms_my: Data Pasukan Kursus

source: Why export a library?
ms_my: Mengapa mengeksport perpustakaan?

source: You may want to edit the XML in your library directly, outside of {studio_name}. You may want to create a backup copy of your library. Or, you may want to create a copy of your library that you can later import into another library instance and customize.
ms_my: Anda mungkin mahu mengedit XML dalam pustaka anda secara langsung, di luar {studio_name}. Anda mungkin mahu membuat salinan sandaran pustaka anda. Atau, anda mungkin mahu membuat salinan pustaka anda yang kemudian anda boleh import ke dalam contoh pustaka lain dan sesuaikan.

source: Opening the downloaded file
ms_my: Membuka fail yang dimuat turun

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the library.xml file, as well as subfolders that contain library content.
ms_my: Gunakan program arkib untuk mengekstrak data daripada fail .tar.gz. Data yang diekstrak termasuk fail library.xml, serta subfolder yang mengandungi kandungan perpustakaan.

source: Learn more about exporting a library
ms_my: Ketahui lebih lanjut tentang mengeksport perpustakaan

source: Why export a course?
ms_my: Mengapa mengeksport kursus?

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
ms_my: Anda mungkin mahu mengedit XML dalam kursus anda secara langsung, di luar {studio_name}. Anda mungkin ingin membuat salinan sandaran kursus anda. Atau, anda mungkin ingin membuat salinan kursus anda yang kemudian anda boleh import ke dalam contoh kursus lain dan sesuaikan.

source: What content is exported?
ms_my: Apakah kandungan yang dieksport?

source: The following content is exported.
ms_my: Kandungan berikut dieksport.

source: Course content and structure
ms_my: Kandungan dan struktur kursus

source: Course dates
ms_my: Tarikh kursus

source: Grading policy
ms_my: Dasar penggredan

source: Any group configurations
ms_my: Sebarang konfigurasi kumpulan

source: Settings on the Advanced Settings page, including MATLAB API keys and LTI passports
ms_my: Tetapan pada halaman Tetapan Lanjutan, termasuk kunci API MATLAB dan pasport LTI

source: The following content is not exported.
ms_my: Kandungan berikut tidak dieksport.

source: Learner-specific content, such as learner grades and discussion forum data
ms_my: Kandungan khusus pelajar, seperti gred pelajar dan data forum perbincangan

source: The course team
ms_my: Pasukan kursus

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
ms_my: Gunakan program arkib untuk mengekstrak data daripada fail .tar.gz. Data yang diekstrak termasuk fail course.xml, serta subfolder yang mengandungi kandungan kursus.

source: Learn more about exporting a course
ms_my: Ketahui lebih lanjut tentang mengeksport kursus

source: Export Course to Git
ms_my: Eksport Kursus ke Git

source: Export to Git
ms_my: Eksport ke Git

source: About Export to Git
ms_my: Mengenai Eksport ke Git

source: Use this to export your course to its git repository.
ms_my: Gunakan ini untuk mengeksport kursus anda ke repositori gitnya.

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
ms_my: Ini kemudiannya akan mencetuskan kemas kini automatik tapak LMS utama dan mengemas kini kandungan kursus anda yang kelihatan di sana kepada pelajar jika import git automatik dikonfigurasikan.

source: Export Course to Git:
ms_my: Eksport Kursus ke Git:

source: giturl must be defined in your course settings before you can export to git.
ms_my: giturl mesti ditakrifkan dalam tetapan kursus anda sebelum anda boleh mengeksport ke git.

source: Export Failed
ms_my: Eksport Gagal

source: Export Succeeded
ms_my: Eksport Berjaya

source: Your course:
ms_my: Kursus anda:

source: Course git url:
ms_my: Url git kursus:

source: Experiment Group Configurations
ms_my: Eksperimen Konfigurasi Kumpulan

source: This module is disabled at the moment.
ms_my: Modul ini dilumpuhkan pada masa ini.

source: Enrollment track groups allow you to offer different course content to learners in each enrollment track. Learners enrolled in each enrollment track in your course are automatically included in the corresponding enrollment track group.
ms_my: Kumpulan trek pendaftaran membolehkan anda menawarkan kandungan kursus yang berbeza kepada pelajar dalam setiap trek pendaftaran. Pelajar yang mendaftar dalam setiap trek pendaftaran dalam kursus anda dimasukkan secara automatik dalam kumpulan trek pendaftaran yang sepadan.

source: On unit pages in the course outline, you can restrict access to components to learners based on their enrollment track.
ms_my: Pada halaman unit dalam rangka kursus, anda boleh mengehadkan akses kepada komponen kepada pelajar berdasarkan trek pendaftaran mereka.

source: You cannot edit enrollment track groups, but you can expand each group to view details of the course content that is designated for learners in the group.
ms_my: Anda tidak boleh mengedit kumpulan runut pendaftaran, tetapi anda boleh mengembangkan setiap kumpulan untuk melihat butiran kandungan kursus yang ditetapkan untuk pelajar dalam kumpulan.

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
ms_my: Jika anda mendayakan kohort dalam kursus anda, anda boleh menggunakan kumpulan kandungan untuk mencipta perisian kursus khusus kohort. Dengan kata lain, anda boleh menyesuaikan kandungan yang dilihat oleh kohort tertentu dalam kursus anda.

source: Each content group that you create can be associated with one or more cohorts. In addition to making course content available to all learners, you can restrict access to some content to learners in specific content groups. Only learners in the cohorts that are associated with the specified content groups see the additional content.
ms_my: Setiap kumpulan kandungan yang anda buat boleh dikaitkan dengan satu atau lebih kohort. Selain menyediakan kandungan kursus kepada semua pelajar, anda boleh menyekat akses kepada sesetengah kandungan kepada pelajar dalam kumpulan kandungan tertentu. Hanya pelajar dalam kohort yang dikaitkan dengan kumpulan kandungan yang ditentukan melihat kandungan tambahan.

source: Click {em_start}New content group{em_end} to add a new content group. To edit the name of a content group, hover over its box and click {em_start}Edit{em_end}. You can delete a content group only if it is not in use by a unit. To delete a content group, hover over its box and click the delete icon.
ms_my: Klik {em_start}Kumpulan kandungan baharu{em_end} untuk menambah kumpulan kandungan baharu. Untuk mengedit nama kumpulan kandungan, tuding pada kotaknya dan klik {em_start}Edit{em_end}. Anda boleh memadamkan kumpulan kandungan hanya jika ia tidak digunakan oleh unit. Untuk memadamkan kumpulan kandungan, tuding pada kotaknya dan klik ikon padam.

source: Use experiment group configurations if you are conducting content experiments, also known as A/B testing, in your course. Experiment group configurations define how many groups of learners are in a content experiment. When you create a content experiment for a course, you select the group configuration to use.
ms_my: Gunakan konfigurasi kumpulan percubaan jika anda menjalankan percubaan kandungan, juga dikenali sebagai ujian A/B, dalam kursus anda. Konfigurasi kumpulan percubaan menentukan bilangan kumpulan pelajar dalam percubaan kandungan. Apabila anda membuat percubaan kandungan untuk kursus, anda memilih konfigurasi kumpulan untuk digunakan.

source: Click {em_start}New Group Configuration{em_end} to add a new configuration. To edit a configuration, hover over its box and click {em_start}Edit{em_end}. You can delete a group configuration only if it is not in use in an experiment. To delete a configuration, hover over its box and click the delete icon.
ms_my: Klik {em_start}Konfigurasi Kumpulan Baharu{em_end} untuk menambah konfigurasi baharu. Untuk mengedit konfigurasi, tuding pada kotaknya dan klik {em_start}Edit{em_end}. Anda boleh memadamkan konfigurasi kumpulan hanya jika ia tidak digunakan dalam percubaan. Untuk memadamkan konfigurasi, tuding pada kotaknya dan klik ikon padam.

source: Welcome
ms_my: Selamat datang

source: Welcome to {studio_name}
ms_my: Selamat datang ke {studio_name}

source: {studio_name} helps manage your online courses, so you can focus on teaching them
ms_my: {studio_name} membantu mengurus kursus dalam talian anda, supaya anda boleh menumpukan pada mengajarnya

source: {studio_name}'s Many Features
ms_my: Banyak Ciri {studio_name}.

source: {studio_name} Helps You Keep Your Courses Organized
ms_my: {studio_name} Membantu Anda Memastikan Kursus Anda Teratur

source: Enlarge image
ms_my: Besarkan imej

source: Keeping Your Course Organized
ms_my: Memastikan Kursus Anda Teratur

source: The backbone of your course is how it is organized. {studio_name} offers an {strong_start}Outline{strong_end} editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
ms_my: Tulang belakang kursus anda adalah bagaimana ia dianjurkan. {studio_name} menawarkan editor {strong_start}Outline{strong_end}, menyediakan hierarki yang mudah serta seret dan lepas mudah untuk membantu anda dan pelajar anda kekal teratur.

source: Simple Organization For Content
ms_my: Organisasi Mudah Untuk Kandungan

source: {studio_name} uses a simple hierarchy of {strong_start}sections{strong_end} and {strong_start}subsections{strong_end} to organize your content.
ms_my: {studio_name} menggunakan hierarki ringkas {strong_start}bahagian{strong_end} dan {strong_start}subseksyen{strong_end} untuk menyusun kandungan anda.

source: Change Your Mind Anytime
ms_my: Ubah Fikiran Anda Pada Bila-bila Masa

source: Draft your outline and build content anywhere. Simple drag and drop tools let you reorganize quickly.
ms_my: Draf garis besar anda dan bina kandungan di mana-mana sahaja. Alat seret dan lepas yang mudah membolehkan anda menyusun semula dengan cepat.

source: Go A Week Or A Semester At A Time
ms_my: Pergi Seminggu Atau Semester Pada Satu Masa

source: Build and release {strong_start}sections{strong_end} to your students incrementally. You don't have to have it all done at once.
ms_my: Bina dan keluarkan {strong_start}bahagian{strong_end} kepada pelajar anda secara berperingkat. Anda tidak perlu melakukan semuanya sekaligus.

source: Learning is More than Just Lectures
ms_my: Belajar Bukan Sekadar Kuliah

source: {studio_name} lets you weave your content together in a way that reinforces learning. Insert videos, discussions, and a wide variety of exercises with just a few clicks.
ms_my: {studio_name} membolehkan anda menganyam kandungan anda dengan cara yang mengukuhkan pembelajaran. Sisipkan video, perbincangan dan pelbagai jenis latihan dengan hanya beberapa klik.

source: Create Learning Pathways
ms_my: Cipta Laluan Pembelajaran

source: Help your students understand one concept at a time with multimedia, HTML, and exercises.
ms_my: Bantu pelajar anda memahami satu konsep pada satu masa dengan multimedia, HTML dan latihan.

source: Work Visually, Organize Quickly
ms_my: Bekerja Secara Visual, Atur Cepat

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
ms_my: Bekerja secara visual dan lihat dengan tepat apa yang pelajar anda akan lihat. Susun semula semua kandungan anda dengan seret dan lepas.
