Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: This user does not have access to this content because the content start date is in the future
ms_my: Pengguna ini tidak mempunyai akses kepada kandungan ini kerana tarikh mula kandungan adalah pada masa hadapan

source: This type of component cannot be shown while viewing the course as a specific student.
ms_my: Komponen jenis ini tidak boleh ditunjukkan semasa melihat kursus sebagai pelajar tertentu.

source: Number of days a learner has to upgrade after content is made available
ms_my: Bilangan hari pelajar perlu menaik taraf selepas kandungan disediakan

source: Disable the dynamic upgrade deadline for this course run.
ms_my: Lumpuhkan tarikh akhir naik taraf dinamik untuk kursus ini dijalankan.

source: Disable the dynamic upgrade deadline for this organization.
ms_my: Lumpuhkan tarikh akhir naik taraf dinamik untuk organisasi ini.

source: Internal API Base URL
ms_my: URL Pangkalan API Dalaman

source: Financial Assistance Backend API Base URL.
ms_my: URL Pangkalan API Bahagian Belakang Bantuan Kewangan.

source: Username created for Financial Assistance Backend, e.g. financial_assistance_service_user.
ms_my: Nama pengguna dibuat untuk Bahagian Belakang Bantuan Kewangan, mis. pengguna_perkhidmatan_bantuan_kewangan.

source: Percentage of courses allowed to use edx-financial-assistance
ms_my: Peratusan kursus dibenarkan menggunakan edx-financial-assistance

source: Progress
ms_my: Kemajuan

source: Keep learners engaged and on track throughout the course.
ms_my: Pastikan pelajar terlibat dan berada di landasan yang betul sepanjang kursus.

source: Textbooks
ms_my: Buku teks

source: Create and manage a library of course readings, textbooks, and chapters.
ms_my: Cipta dan urus perpustakaan bacaan kursus, buku teks dan bab.

source: Calculator
ms_my: Kalkulator

source: Provide an in-course calculator for simple and complex calculations.
ms_my: Sediakan kalkulator dalam kursus untuk pengiraan yang mudah dan kompleks.

source: Proctoring
ms_my: Pengawasan

source: Maintain exam integrity by enabling a proctoring solution for your course
ms_my: Kekalkan integriti peperiksaan dengan mendayakan penyelesaian proctoring untuk kursus anda

source: Custom pages
ms_my: Halaman tersuai

source: Provide additional course content and resources with custom pages
ms_my: Sediakan kandungan dan sumber kursus tambahan dengan halaman tersuai

source: Flexible Peer Grading for ORAs
ms_my: Penggredan Rakan Sebaya Fleksibel untuk ORA

source: Course level settings for Flexible Peer Grading Open Response Assessments.
ms_my: Tetapan peringkat kursus untuk Penilaian Respons Terbuka Penggredan Rakan Sebaya Fleksibel.

source: Course
ms_my: Kursus

source: Syllabus
ms_my: Sukatan pelajaran

source: Dates
ms_my: kurma

source: You are not signed in. To see additional course content, {sign_in_link} or {register_link}, and enroll in this course.
ms_my: Anda tidak melog masuk. Untuk melihat kandungan kursus tambahan, {sign_in_link} atau {register_link} dan daftar dalam kursus ini.

source: sign in
ms_my: daftar masuk

source: register
ms_my: mendaftar

source: Your enrollment: Audit track
ms_my: Pendaftaran anda: Jejak audit

source: You are enrolled in the audit track for this course. The audit track does not include a certificate.
ms_my: Anda telah mendaftar dalam trek audit untuk kursus ini. Jejak audit tidak termasuk sijil.

source: Your enrollment: Honor track
ms_my: Pendaftaran anda: Trek kehormatan

source: You are enrolled in the honor track for this course. The honor track does not include a certificate.
ms_my: Anda telah mendaftar dalam trek penghormatan untuk kursus ini. Trek penghormatan tidak termasuk sijil.

source: We're working on it...
ms_my: Kami sedang mengusahakannya...

source: We're creating your certificate. You can keep working in your courses and a link to it will appear here and on your Dashboard when it is ready.
ms_my: Kami sedang mencipta sijil anda. Anda boleh terus bekerja dalam kursus anda dan pautan kepadanya akan dipaparkan di sini dan pada Papan Pemuka anda apabila ia sudah sedia.

source: Your certificate has been invalidated
ms_my: Sijil anda telah tidak sah

source: Please contact your course team if you have any questions.
ms_my: Sila hubungi pasukan kursus anda jika anda mempunyai sebarang pertanyaan.

source: Congratulations, you qualified for a certificate!
ms_my: Tahniah, anda layak mendapat sijil!

source: You've earned a certificate for this course.
ms_my: Anda telah memperoleh sijil untuk kursus ini.

source: Your certificate will be available soon!
ms_my: Sijil anda akan tersedia tidak lama lagi!

source: After this course officially ends, you will receive an email notification with your certificate.
ms_my: Selepas kursus ini tamat secara rasmi, anda akan menerima pemberitahuan e-mel bersama sijil anda.

source: Your certificate is available
ms_my: Sijil anda tersedia

source: Certificate unavailable
ms_my: Sijil tidak tersedia

source: You have not received a certificate because you do not have a current {platform_name} verified identity.
ms_my: Anda belum menerima sijil kerana anda tidak mempunyai identiti yang disahkan {platform_name} semasa.

source: To see course content, {sign_in_link} or {register_link}.
ms_my: Untuk melihat kandungan kursus, {sign_in_link} atau {register_link}.

source: {sign_in_link} or {register_link}.
ms_my: {sign_in_link} atau {register_link}.

source: Sign in
ms_my: Log masuk

source: You must be enrolled in the course to see course content. {enroll_link_start}Enroll now{enroll_link_end}.
ms_my: Anda mesti mendaftar dalam kursus untuk melihat kandungan kursus. {enroll_link_start}Daftar sekarang{enroll_link_end}.

source: You must be enrolled in the course to see course content.
ms_my: Anda mesti mendaftar dalam kursus untuk melihat kandungan kursus.

source: User does not exist.
ms_my: Pengguna tidak wujud.

source: Invalid location.
ms_my: Lokasi tidak sah.

source: User {username} has never accessed problem {location}
ms_my: Pengguna {username} tidak pernah mengakses masalah {location}

source: You must be signed in to {platform_name} to create a certificate.
ms_my: Anda mesti log masuk ke {platform_name} untuk membuat sijil.

source: Course is not valid
ms_my: Kursus tidak sah

source: Your certificate will be available when you pass the course.
ms_my: Sijil anda akan tersedia apabila anda lulus kursus.

source: Certificate has already been created.
ms_my: Sijil telah pun dibuat.

source: Certificate is being created.
ms_my: Sijil sedang dibuat.

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
ms_my: Pilih kursus yang anda ingin memperoleh sijil yang disahkan. Jika kursus tidak muncul dalam senarai, pastikan anda telah mendaftar dalam trek audit untuk kursus tersebut.

source: I certify that:
ms_my: Saya memperakui bahawa:

source: Paying the verified certificate fee for the above course would cause me economic hardship
ms_my: Membayar yuran sijil yang disahkan untuk kursus di atas akan menyebabkan saya mengalami kesukaran ekonomi

source: I will work diligently to complete the course work and receive a certificate
ms_my: Saya akan berusaha bersungguh-sungguh untuk menyiapkan kerja kursus dan menerima sijil

source: I have read, understand, and will abide by the {honor_code_link} for the edX Site
ms_my: Saya telah membaca, memahami dan akan mematuhi {honor_code_link} untuk Tapak edX

source: Title can't be empty
ms_my: Tajuk tidak boleh kosong

source: Body can't be empty
ms_my: Badan tidak boleh kosong

source: Topic doesn't exist
ms_my: Topik tidak wujud

source: Comment level too deep
ms_my: Tahap ulasan terlalu mendalam

source: Error uploading file. Please contact the site administrator. Thank you.
ms_my: Ralat memuat naik fail. Sila hubungi pentadbir tapak. terima kasih.

source: Good
ms_my: bagus

source: your
ms_my: awak

source: their
ms_my: mereka

source: %(comment_username)s commented to %(thread_title)s:
ms_my: %(comment_username)s mengulas kepada %(thread_title)s:

source: Comment to %(thread_title)s
ms_my: Komen kepada %(thread_title)s

source: Go to Discussion
ms_my: Pergi ke Perbincangan

source: %(course_name)s: Reported content awaits review
ms_my: %(course_name)s: Kandungan yang dilaporkan menunggu semakan

source: %(course_name)s %(course_id)s moderator content for review
ms_my: %(course_name)s %(course_id)s kandungan moderator untuk semakan

source: %(comment_username)s replied to {start_tag}%(thread_title)s{end_tag}:
ms_my: %(comment_username)s membalas {start_tag}%(thread_title)s{end_tag}:

source: View discussion
ms_my: Lihat perbincangan

source: %(comment_username)s replied to <b>%(thread_title)s</b>:
ms_my: %(comment_username)s membalas kepada <b>%(thread_title)s</b>:

source: Response to %(thread_title)s
ms_my: Respons kepada %(thread_title)s

source: %(comment_username)s replied to %(thread_title)s: %(comment_body|truncatechars:200)s
ms_my: %(comment_username)s membalas %(thread_title)s: %(comment_body|truncatechars:200)s

source: Access to this discussion is restricted to team members and staff.
ms_my: Akses kepada perbincangan ini terhad kepada ahli pasukan dan kakitangan.

source: EdxNotes Service is unavailable. Please try again in a few minutes.
ms_my: Perkhidmatan EdxNotes tidak tersedia. Sila cuba lagi dalam beberapa minit.

source: Invalid JSON response received from notes api.
ms_my: Respons JSON tidak sah diterima daripada api nota.

source: Incorrect data received from notes api.
ms_my: Data tidak betul diterima daripada nota api.

source: No endpoint was provided for EdxNotes.
ms_my: Tiada titik akhir disediakan untuk EdxNotes.

source: Notes
ms_my: Nota

source: Allow learners to highlight passages and make notes right in the course.
ms_my: Benarkan pelajar menyerlahkan petikan dan membuat nota tepat dalam kursus.

source: Cannot override subsection grade: subsection is not available for target learner.
ms_my: Tidak boleh mengatasi gred subseksyen: subseksyen tidak tersedia untuk pelajar sasaran.

source: Proctored Exam Review: {review_status}
ms_my: Semakan Peperiksaan Berkawal: {review_status}

source: A proctored exam attempt for {exam_name} in {course_name} by username: {student_username} was reviewed as {review_status} by the proctored exam review provider. Review link: {review_url}
ms_my: Percubaan peperiksaan terkawal untuk {exam_name} dalam {course_name} dengan nama pengguna: {student_username} telah disemak sebagai {review_status} oleh penyedia semakan peperiksaan terkawal. Semak pautan: {review_url}

source: Your Platform Insights
ms_my: Cerapan Platform Anda

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below.
ms_my: Laporan {report_type} sedang dibuat. Untuk melihat status laporan, lihat Tugas Tertunda di bawah.

source: Found a conflict with given identifier. Please try an alternative identifier
ms_my: Menemui konflik dengan pengecam yang diberikan. Sila cuba pengecam alternatif

source: Make sure that the file you upload is in CSV format with no extraneous characters or rows.
ms_my: Pastikan fail yang anda muat naik adalah dalam format CSV tanpa aksara atau baris asing.

source: Could not read uploaded file.
ms_my: Tidak dapat membaca fail yang dimuat naik.

source: Course is not cohorted but cohort provided. Ignoring cohort assignment for all users.
ms_my: Kursus bukan kohort tetapi kohort disediakan. Mengabaikan penetapan kohort untuk semua pengguna.

source: Cohort name not found: {cohort}. Ignoring cohort assignment for all users.
ms_my: Nama kohort tidak ditemui: {cohort}. Mengabaikan penetapan kohort untuk semua pengguna.

source: Invalid course mode: {mode}. Falling back to the default mode, or keeping the current mode in case the user is already enrolled.
ms_my: Mod kursus tidak sah: {mode}. Kembali ke mod lalai, atau mengekalkan mod semasa sekiranya pengguna sudah mendaftar.

source: Invalid course mode: {mode}. Failling back to {default_mode}, or resetting to {default_mode} in case the user is already enrolled.
ms_my: Mod kursus tidak sah: {mode}. Gagal kembali ke {default_mode} atau menetapkan semula kepada {default_mode} sekiranya pengguna sudah mendaftar.

source: Invalid email {email_address}.
ms_my: {email_address} e-mel tidak sah.

source: An account with email {email} exists but the provided username {username} is different. Enrolling anyway with {email}.
ms_my: Akaun dengan e-mel {email} wujud tetapi nama pengguna yang diberikan {username} adalah berbeza. Mendaftar juga dengan {email}.

source: File is not attached.
ms_my: Fail tidak dilampirkan.

source: Username {user} already exists.
ms_my: Nama pengguna {user} sudah wujud.

source: A usage key location for a section or a problem. If the location is a block that contains other blocks, (such as the course, section, subsection, or unit blocks) then all blocks under that block will be included in the report.
ms_my: Lokasi utama penggunaan untuk bahagian atau masalah. Jika lokasi ialah blok yang mengandungi blok lain, (seperti kursus, bahagian, subseksyen atau blok unit) maka semua blok di bawah blok itu akan disertakan dalam laporan.

source: A list of usage keys for the blocks to include in the report.
ms_my: Senarai kunci penggunaan untuk blok untuk disertakan dalam laporan.

source: A list of problem/block types to generate the report for. This field can be omitted if the report should include details of allblock types.
ms_my: Senarai jenis masalah/blok untuk menjana laporan. Medan ini boleh diabaikan jika laporan harus mengandungi butiran semua jenis sekatan.

source: User-friendly text describing current status of report generation.
ms_my: Teks mesra pengguna yang menerangkan status semasa penjanaan laporan.

source: A unique id for the report generation task. It can be used to query the latest report generation status.
ms_my: Id unik untuk tugas penjanaan laporan. Ia boleh digunakan untuk menanyakan status penjanaan laporan terkini.

source: The provided parameters were invalid. Make sure you've provided at least one valid usage key for `problem_locations`.
ms_my: Parameter yang diberikan adalah tidak sah. Pastikan anda telah memberikan sekurang-kurangnya satu kunci penggunaan yang sah untuk `problem_locations`.

source: The requesting user is not authenticated.
ms_my: Pengguna yang meminta tidak disahkan.

source: The requesting user lacks access to the course.
ms_my: Pengguna yang meminta tidak mempunyai akses kepada kursus.

source: problem responses
ms_my: tindak balas masalah

source: Could not find problem with this location.
ms_my: Tidak dapat mencari masalah dengan lokasi ini.

source: Certificate Type
ms_my: Jenis Sijil

source: Total Certificates Issued
ms_my: Jumlah Sijil Dikeluarkan

source: Date Report Run
ms_my: Laporan Tarikh Dijalankan

source: enrolled learner profile
ms_my: profil pelajar yang didaftarkan

source: User ID
ms_my: ID pengguna

source: Username
ms_my: Nama pengguna

source: Email
ms_my: E-mel

source: Language
ms_my: Bahasa

source: Location
ms_my: Lokasi

source: Gender
ms_my: Jantina

source: Level of Education
ms_my: Tahap Pendidikan

source: Mailing Address
ms_my: Alamat Surat Menyurat

source: Goals
ms_my: Matlamat

source: Enrollment Mode
ms_my: Mod Pendaftaran

source: Last Login
ms_my: Log Masuk Terakhir

source: Date Joined
ms_my: Tarikh Menyertai

source: External User Key
ms_my: Kunci Pengguna Luaran

source: Cohort
ms_my: kohort

source: Team
ms_my: Pasukan

source: City
ms_my: Bandar

source: Country
ms_my: Negara

source: enrollment
ms_my: pendaftaran

source: The file must contain a 'cohort' column containing cohort names.
ms_my: Fail mesti mengandungi lajur 'kohort' yang mengandungi nama kohort.

source: The file must contain a 'username' column, an 'email' column, or both.
ms_my: Fail mesti mengandungi lajur 'nama pengguna', lajur 'e-mel' atau kedua-duanya.

source: survey
ms_my: tinjauan

source: proctored exam results
ms_my: keputusan peperiksaan terkawal

source: Anonymized User IDs
ms_my: ID Pengguna Tanpa Nama

source: Enrollment status for {student}: active
ms_my: Status pendaftaran untuk {pelajar}: aktif

source: Enrollment status for {student}: inactive
ms_my: Status pendaftaran untuk {pelajar}: tidak aktif

source: Enrollment status for {student}: pending
ms_my: Status pendaftaran untuk {pelajar}: belum selesai

source: Enrollment status for {student}: never enrolled
ms_my: Status pendaftaran untuk {pelajar}: tidak pernah didaftarkan

source: Module does not exist.
ms_my: Modul tidak wujud.

source: An error occurred while deleting the score.
ms_my: Ralat berlaku semasa memadamkan skor.

source: An error occurred while attempting to reset for all students.
ms_my: Ralat berlaku semasa cuba menetapkan semula untuk semua pelajar.

source: Course has no entrance exam section.
ms_my: Kursus tidak mempunyai bahagian peperiksaan kemasukan.

source: all_students and unique_student_identifier are mutually exclusive.
ms_my: all_students dan unique_student_identifier adalah saling eksklusif.

source: all_students and delete_module are mutually exclusive.
ms_my: all_students dan delete_module adalah saling eksklusif.

source: Requires instructor access.
ms_my: Memerlukan akses pengajar.

source: Course has no valid entrance exam section.
ms_my: Kursus tidak mempunyai bahagian peperiksaan kemasukan yang sah.

source: All Students
ms_my: Semua Pelajar

source: Cannot rescore with all_students and unique_student_identifier.
ms_my: Tidak boleh membuat skor dengan semua_pelajar dan pengecam_pelajar_unik.

source: Current status of task.
ms_my: Status tugas semasa.

source: Identifies the kind of task being performed, e.g. rescoring.
ms_my: Mengenal pasti jenis tugas yang dijalankan, cth. menjaringkan gol.

source: The celery ID for the task.
ms_my: ID saderi untuk tugas itu.

source: The date and time when the task was created.
ms_my: Tarikh dan masa apabila tugasan dibuat.

source: The input parameters for the task. The format and content of this data will depend on the kind of task being performed. For instanceit may contain the problem locations for a problem resources task.
ms_my: Parameter input untuk tugas. Format dan kandungan data ini bergantung pada jenis tugas yang dilakukan. Sebagai contoh, ia mungkin mengandungi lokasi masalah untuk tugas sumber masalah.

source: The username of the user who initiated this task.
ms_my: Nama pengguna pengguna yang memulakan tugas ini.

source: The last knows state of the celery task.
ms_my: Yang terakhir mengetahui keadaan tugas saderi.

source: Task duration information, if known
ms_my: Maklumat tempoh tugas, jika diketahui

source: User-friendly task status information, if available.
ms_my: Maklumat status tugas mesra pengguna, jika ada.

source: List of instructor tasks.
ms_my: Senarai tugas pengajar.

source: The requested course does not exist.
ms_my: Kursus yang diminta tidak wujud.

source: URL from which report can be downloaded.
ms_my: URL dari mana laporan boleh dimuat turun.

source: Name of report.
ms_my: Nama laporan.

source: HTML anchor tag that contains the name and link.
ms_my: Tag anchor HTML yang mengandungi nama dan pautan.

source: List of report downloads
ms_my: Senarai muat turun laporan

source: ID for the course whose reports need to be listed.
ms_my: ID untuk kursus yang laporannya perlu disenaraikan.

source: Filter results to only return details of for the report with the specified name.
ms_my: Tapis hasil untuk hanya mengembalikan butiran untuk laporan dengan nama yang ditentukan.

source: ORA data
ms_my: data ORA

source: ORA summary
ms_my: ringkasan ORA

source: Attachments archive is being created.
ms_my: Arkib lampiran sedang dibuat.

source: grade
ms_my: gred

source: problem grade
ms_my: gred masalah

source: Successfully changed due date for student {0} for {1} to {2}
ms_my: Berjaya menukar tarikh akhir pelajar {0} untuk {1} kepada {2}

source: Successfully removed invalid due date extension (unit has no due date).
ms_my: Berjaya mengalih keluar pelanjutan tarikh akhir yang tidak sah (unit tidak mempunyai tarikh akhir).

source: Successfully reset due date for student {0} for {1} to {2}
ms_my: Berjaya menetapkan semula tarikh akhir pelajar {0} untuk {1} hingga {2}

source: This student (%s) will skip the entrance exam.
ms_my: Pelajar ini (%s) akan melangkau peperiksaan kemasukan.

source: This student (%s) is already allowed to skip the entrance exam.
ms_my: Pelajar ini (%s) sudah dibenarkan melangkau peperiksaan kemasukan.

source: Certificate generation task for all students of this course has been started. You can view the status of the generation task in the "Pending Tasks" section.
ms_my: Tugas penjanaan sijil untuk semua pelajar kursus ini telah dimulakan. Anda boleh melihat status tugas penjanaan dalam bahagian "Tugas Belum Selesai".

source: Please select certificate statuses from the list only.
ms_my: Sila pilih status sijil daripada senarai sahaja.

source: Certificate regeneration task has been started. You can view the status of the generation task in the "Pending Tasks" section.
ms_my: Tugas penjanaan semula sijil telah dimulakan. Anda boleh melihat status tugas penjanaan dalam bahagian "Tugas Belum Selesai".

source: The record is not in the correct format. Please add a valid username or email address.
ms_my: Rekod tidak dalam format yang betul. Sila tambah nama pengguna atau alamat e-mel yang sah.

source: Student {user} is not enrolled in this course. Please check your spelling and retry.
ms_my: Pelajar {user} tidak didaftarkan dalam kursus ini. Sila semak ejaan anda dan cuba semula.

source: Student {user} is already on the certificate invalidation list and cannot be added to the certificate exception list.
ms_my: Pelajar {user} sudah pun berada dalam senarai pembatalan sijil dan tidak boleh ditambahkan pada senarai pengecualian sijil.

source: Student (username/email={user}) already in certificate exception list.
ms_my: Pelajar (nama pengguna/e-mel={user}) sudah berada dalam senarai pengecualian sijil.

source: Error occurred removing the allowlist entry for student {student}. Please refresh the page and try again
ms_my: Ralat berlaku semasa mengalih keluar masukan senarai dibenarkan untuk pelajar {pelajar}. Sila muat semula halaman dan cuba lagi

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
ms_my: Medan nama pengguna/e-mel pelajar diperlukan dan tidak boleh kosong. Sila isikan nama pengguna/e-mel dan kemudian tekan butang "Tambah ke Senarai Pengecualian".

source: {user} does not exist in the LMS. Please check your spelling and retry.
ms_my: {user} tidak wujud dalam LMS. Sila semak ejaan anda dan cuba semula.

source: Invalid data, generate_for must be "new" or "all".
ms_my: Data tidak sah, generate_for mestilah "baharu" atau "semua".

source: Certificate generation started for students on the allowlist.
ms_my: Penjanaan sijil bermula untuk pelajar dalam senarai dibenarkan.

source: The student {student} appears on the Certificate Exception list in course {course}. Please remove them from the Certificate Exception list before attempting to invalidate their certificate.
ms_my: Pelajar {pelajar} muncul pada senarai Pengecualian Sijil dalam kursus {course}. Sila alih keluar mereka daripada senarai Pengecualian Sijil sebelum cuba membatalkan sijil mereka.

source: Certificate of {user} has already been invalidated. Please check your spelling and retry.
ms_my: Sijil {user} telah pun tidak sah. Sila semak ejaan anda dan cuba semula.
