Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: To be sure all students can access the video, we recommend providing both an .mp4 and a .webm version of your video. Click below to add a URL for another version. These URLs cannot be YouTube URLs. The first listed video that's compatible with the student's computer will play.
ms_my: Untuk memastikan semua pelajar boleh mengakses video, kami mengesyorkan menyediakan kedua-dua versi .mp4 dan .webm video anda. Klik di bawah untuk menambah URL untuk versi lain. URL ini tidak boleh menjadi URL YouTube. Video tersenarai pertama yang serasi dengan komputer pelajar akan dimainkan.

source: Default Timed Transcript
ms_my: Transkrip Bermasa Lalai

source: Timed Transcript Conflict
ms_my: Konflik Transkrip Bermasa

source: The timed transcript for the first video file does not appear to be the same as the timed transcript for the second video file.
ms_my: Transkrip bermasa untuk fail video pertama nampaknya tidak sama dengan transkrip bermasa untuk fail video kedua.

source: Which timed transcript would you like to use?
ms_my: Transkrip bermasa yang manakah ingin anda gunakan?

source: Error.
ms_my: ralat.

source: Timed Transcript from %(filename)s
ms_my: Transkrip Bermasa daripada %(filename)s

source: Timed Transcript Found
ms_my: Transkrip Bermasa Ditemui

source: EdX has a timed transcript for this video. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript. If you want to replace this transcript, upload a new .srt transcript file.
ms_my: EdX mempunyai transkrip bermasa untuk video ini. Jika anda ingin mengedit transkrip ini, anda boleh memuat turun, mengedit dan memuat naik semula transkrip sedia ada. Jika anda ingin menggantikan transkrip ini, muat naik fail transkrip .srt baharu.

source: Upload New Transcript
ms_my: Muat Naik Transkrip Baharu

source: Upload New .srt Transcript
ms_my: Muat Naik Transkrip .srt Baharu

source: Download Transcript for Editing
ms_my: Muat turun Transkrip untuk Penyuntingan

source: No EdX Timed Transcript
ms_my: Tiada Transkrip Bermasa EdX

source: EdX doesn't have a timed transcript for this video in Studio, but we found a transcript on YouTube. You can import the YouTube transcript or upload your own .srt transcript file.
ms_my: EdX tidak mempunyai transkrip bermasa untuk video ini di Studio, tetapi kami menemui transkrip di YouTube. Anda boleh mengimport transkrip YouTube atau memuat naik fail transkrip .srt anda sendiri.

source: Import YouTube Transcript
ms_my: Import Transkrip YouTube

source: No Timed Transcript
ms_my: Tiada Transkrip Bermasa

source: EdX doesn\'t have a timed transcript for this video. Please upload an .srt file.
ms_my: EdX tidak mempunyai transkrip bermasa untuk video ini. Sila muat naik fail .srt.

source: The timed transcript for this video on edX is out of date, but YouTube has a current timed transcript for this video.
ms_my: Transkrip bermasa untuk video ini di edX sudah lapuk, tetapi YouTube mempunyai transkrip bermasa semasa untuk video ini.

source: Do you want to replace the edX transcript with the YouTube transcript?
ms_my: Adakah anda mahu menggantikan transkrip edX dengan transkrip YouTube?

source: Yes, replace the edX transcript with the YouTube transcript
ms_my: Ya, gantikan transkrip edX dengan transkrip YouTube

source: Timed Transcript Uploaded Successfully
ms_my: Transkrip Bermasa Berjaya Dimuat Naik

source: EdX has a timed transcript for this video. If you want to replace this transcript, upload a new .srt transcript file. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript.
ms_my: EdX mempunyai transkrip bermasa untuk video ini. Jika anda ingin menggantikan transkrip ini, muat naik fail transkrip .srt baharu. Jika anda ingin mengedit transkrip ini, anda boleh memuat turun, mengedit dan memuat naik semula transkrip sedia ada.

source: Confirm Timed Transcript
ms_my: Sahkan Transkrip Bermasa

source: You changed a video URL, but did not change the timed transcript file. Do you want to use the current timed transcript or upload a new .srt transcript file?
ms_my: Anda menukar URL video, tetapi tidak menukar fail transkrip bermasa. Adakah anda mahu menggunakan transkrip bermasa semasa atau memuat naik fail transkrip .srt baharu?

source: Use Current Transcript
ms_my: Gunakan Transkrip Semasa

source: Large
ms_my: besar

source: Zoom In
ms_my: Zum Masuk

source: Zoom Out
ms_my: Zum Keluar

source: Page number out of %(total_pages)s
ms_my: Nombor halaman daripada %(total_pages)s

source: Enter the page number you'd like to quickly navigate to.
ms_my: Masukkan nombor halaman yang anda ingin navigasi dengan cepat.

source: Sorted by
ms_my: Disusun mengikut

source: Clear search
ms_my: Kosongkan carian

source: Search
ms_my: Cari

source: Add a Response
ms_my: Tambah Jawapan

source: This thread is closed.
ms_my: benang ini ditutup.

source: Add a response:
ms_my: Tambah jawapan:

source: Submit
ms_my: Hantar

source: discussion posted %(time_ago)s by %(author)s
ms_my: perbincangan disiarkan %(time_ago)s oleh %(author)s

source: question posted %(time_ago)s by %(author)s
ms_my: soalan disiarkan %(time_ago)s oleh %(author)s

source: Pinned
ms_my: Disemat

source: Reported
ms_my: Dilaporkan

source: Closed
ms_my: tertutup

source: Related to: %(courseware_title_linked)s
ms_my: Berkaitan dengan: %(courseware_title_linked)s

source: This post is visible only to %(group_name)s.
ms_my: Siaran ini hanya kelihatan kepada %(group_name)s.

source: This post is visible to everyone.
ms_my: Siaran ini boleh dilihat oleh semua orang.

source: Editing post
ms_my: Mengedit siaran

source: Add a clear and descriptive title to encourage participation. (Required)
ms_my: Tambah tajuk yang jelas dan deskriptif untuk menggalakkan penyertaan. (Diperlukan)

source: Edit your post below.
ms_my: Edit siaran anda di bawah.

source: Update post
ms_my: Kemas kini siaran

source: Show Comment (%(num_comments)s)
ms_my: Tunjukkan Ulasan (%(num_comments)s)

source: Add a comment
ms_my: Tambah ulasan

source: marked as answer %(time_ago)s by %(user)s
ms_my: ditandakan sebagai jawapan %(time_ago)s oleh %(user)s

source: marked as answer %(time_ago)s
ms_my: ditandakan sebagai jawapan %(time_ago)s

source: endorsed %(time_ago)s by %(user)s
ms_my: disahkan %(time_ago)s oleh %(user)s

source: endorsed %(time_ago)s
ms_my: disahkan %(time_ago)s

source: Editing response
ms_my: Mengedit respons

source: Update response
ms_my: Kemas kini respons

source: posted %(time_ago)s by %(author)s
ms_my: disiarkan %(time_ago)s oleh %(author)s

source: Editing comment
ms_my: Mengedit ulasan

source: Update comment
ms_my: Kemas kini ulasan

source: discussion
ms_my: Perbincangan

source: answered question
ms_my: menjawab soalan

source: unanswered question
ms_my: soalan tak terjawab

source: Following
ms_my: Mengikuti

source: Community TA
ms_my: TA komuniti

source: {unread_comments_count} new
ms_my: {unread_comments_count} baharu

source: %(comments_count)s %(span_sr_open)scomments (%(unread_comments_count)s unread comments)%(span_close)s
ms_my: %(comments_count)s %(span_sr_open)s ulasan (%(unread_comments_count)s komen yang belum dibaca)%(span_close)s

source: %(comments_count)s %(span_sr_open)scomments %(span_close)s
ms_my: %(comments_count)s %(span_sr_open)s komen%(span_close)s

source: Add a Post
ms_my: Tambah Siaran

source: Visible to
ms_my: Kelihatan kepada

source: Discussion admins, moderators, and TAs can make their posts visible to all students or specify a single group.
ms_my: Pentadbir perbincangan, moderator dan TA boleh membuat siaran mereka kelihatan kepada semua pelajar atau menentukan satu kumpulan.

source: All Groups
ms_my: Semua Kumpulan

source: follow this post
ms_my: ikuti siaran ini

source: post anonymously to classmates
ms_my: hantar tanpa nama kepada rakan sekelas

source: Error posting your message.
ms_my: Ralat menyiarkan mesej anda.

source: This post will be visible only to %(group_name)s.
ms_my: Siaran ini akan kelihatan hanya kepada %(group_name)s.

source: This post will be visible to everyone.
ms_my: Siaran ini akan dapat dilihat oleh semua orang.

source: Topic area
ms_my: Bidang topik

source: Add your post to a relevant topic to help others find it. (Required)
ms_my: Tambahkan siaran anda pada topik yang berkaitan untuk membantu orang lain menemuinya. (Diperlukan)

source: (Community TA)
ms_my: (TA Komuniti)

source: (Staff)
ms_my: (Kakitangan)

source: All Posts
ms_my: Semua Siaran

source: Return to all posts
ms_my: Kembali ke semua siaran

source: View discussion
ms_my: Lihat perbincangan

source: Load more
ms_my: Muatkan lagi

source: Post type
ms_my: Jenis siaran

source: Questions raise issues that need answers. Discussions share ideas and start conversations. (Required)
ms_my: Soalan menimbulkan isu yang memerlukan jawapan. Perbincangan berkongsi idea dan memulakan perbualan. (Diperlukan)

source: Question
ms_my: soalan

source: Endorse
ms_my: menyokong

source: Unendorse
ms_my: Batalkan pengesahan

source: Mark as Answer
ms_my: Tandakan sebagai Jawapan

source: Follow
ms_my: Ikut

source: Unfollow
ms_my: nyahikut

source: Vote for this post,
ms_my: Undi untuk siaran ini,

source: Report abuse
ms_my: Laporkan penyalahgunaan

source: Report
ms_my: Laporan

source: Unreport
ms_my: Nyahlaporkan

source: Unpin
ms_my: Nyahsemat

source: Open
ms_my: Buka

source: Discussion Home
ms_my: Rumah Perbincangan

source: How to use %(platform_name)s discussions
ms_my: Cara menggunakan perbincangan %(platform_name)s

source: Find discussions
ms_my: Cari perbincangan

source: Use the All Topics menu to find specific topics.
ms_my: Gunakan menu Semua Topik untuk mencari topik tertentu.

source: Search all posts
ms_my: Cari semua siaran

source: Filter and sort topics
ms_my: Tapis dan susun topik

source: Engage with posts
ms_my: Berinteraksi dengan siaran

source: Vote for good posts and responses
ms_my: Undi untuk siaran dan respons yang baik

source: Report abuse, topics, and responses
ms_my: Laporkan penyalahgunaan, topik dan respons

source: Follow or unfollow posts
ms_my: Ikuti atau nyahikut siaran

source: Receive updates
ms_my: Terima kemas kini

source: Toggle Notifications Setting
ms_my: Togol Tetapan Pemberitahuan

source: Check this box to receive an email digest once a day notifying you about new, unread activity from posts you are following.
ms_my: Tandai kotak ini untuk menerima ringkasan e-mel sekali sehari yang memberitahu anda tentang aktiviti baharu yang belum dibaca daripada siaran yang anda ikuti.

source: username or email
ms_my: nama pengguna atau e-mel

source: course id
ms_my: id kursus

source: No results
ms_my: Tiada hasil

source: Course Key
ms_my: Kunci Kursus

source: Grade
ms_my: Gred

source: Last Updated
ms_my: Kemas Kini Terakhir

source: Regenerate
ms_my: Menjana semula

source: Regenerate the user's certificate
ms_my: Menjana semula sijil pengguna

source: Generate
ms_my: Menjana

source: Generate the user's certificate
ms_my: Hasilkan sijil pengguna

source: Current enrollment mode:
ms_my: Mod pendaftaran semasa:

source: New enrollment mode:
ms_my: Mod pendaftaran baharu:

source: Reason for change:
ms_my: Sebab perubahan:

source: Choose One
ms_my: Pilih Satu

source: Explain if other.
ms_my: Terangkan jika lain.

source: Submit enrollment change
ms_my: Serahkan perubahan pendaftaran

source: Username or email address
ms_my: Nama pengguna atau alamat e-mel

source: Course ID
ms_my: ID Kursus

source: Course Start
ms_my: Permulaan Kursus

source: Course End
ms_my: Tamat Kursus

source: Upgrade Deadline
ms_my: Tarikh Akhir Naik Taraf

source: Verification Deadline
ms_my: Tarikh Akhir Pengesahan

source: Enrollment Date
ms_my: Tarikh Pendaftaran

source: Enrollment Mode
ms_my: Mod Pendaftaran

source: Verified mode price
ms_my: Harga mod yang disahkan

source: Reason
ms_my: Sebab

source: Last modified by
ms_my: Terakhir diubah suai oleh

source: Active
ms_my: Aktif

source: N/A
ms_my: T/A

source: Change Enrollment
ms_my: Tukar Pendaftaran

source: Date Joined
ms_my: Tarikh Menyertai

source: Password Status
ms_my: Status Kata Laluan

source: Toggle Account Password (Usable/Unusable)
ms_my: Togol Kata Laluan Akaun (Boleh Digunakan/Tidak Boleh Digunakan)

source: Your team could not be created.
ms_my: Pasukan anda tidak dapat dibuat.

source: Your team could not be updated.
ms_my: Pasukan anda tidak dapat dikemas kini.

source: Enter information to describe your team. You cannot change these details after you create the team.
ms_my: Masukkan maklumat untuk menerangkan pasukan anda. Anda tidak boleh menukar butiran ini selepas anda membuat pasukan.

source: Optional Characteristics
ms_my: Ciri Pilihan

source: Help other learners decide whether to join your team by specifying some characteristics for your team. Choose carefully, because fewer people might be interested in joining your team if it seems too restrictive.
ms_my: Bantu pelajar lain memutuskan sama ada untuk menyertai pasukan anda dengan menyatakan beberapa ciri untuk pasukan anda. Pilih dengan berhati-hati, kerana lebih sedikit orang mungkin berminat untuk menyertai pasukan anda jika nampaknya terlalu ketat.

source: Create team.
ms_my: Buat pasukan.

source: Update team.
ms_my: Kemas kini pasukan.

source: Cancel team creating.
ms_my: Batalkan penciptaan pasukan.

source: Cancel team updating.
ms_my: Batalkan kemas kini pasukan.

source: Instructor tools
ms_my: Alat pengajar

source: Delete Team
ms_my: Padam Pasukan

source: Edit Membership
ms_my: Edit Keahlian

source: View Current Team Memberships
ms_my: Lihat Keahlian Pasukan Semasa

source: Download Memberships
ms_my: Muat turun Keahlian

source: Assign Team Memberships
ms_my: Tetapkan Keahlian Pasukan

source: Upload Memberships
ms_my: Muat naik Keahlian

source: Error assigning team memberships
ms_my: Ralat menetapkan keahlian pasukan

source: Are you having trouble finding a team to join?
ms_my: Adakah anda menghadapi masalah mencari pasukan untuk disertai?

source: Join Team
ms_my: Sertai Pasukan

source: Team Assignments
ms_my: Tugasan Pasukan

source: Team Details
ms_my: Butiran Pasukan

source: You are a member of this team.
ms_my: Anda adalah ahli pasukan ini.

source: Team member profiles
ms_my: Profil ahli pasukan

source: Team capacity
ms_my: Kapasiti pasukan

source: Leave Team
ms_my: Tinggalkan Pasukan

source: Donate
ms_my: Menderma

source: There was an error retrieving preview results for this catalog. Please check that your query is correct and try again.
ms_my: Terdapat ralat semasa mendapatkan semula hasil pratonton untuk katalog ini. Sila pastikan pertanyaan anda betul dan cuba lagi.

source: This catalog's courses:
ms_my: Kursus katalog ini:

source: Expand All
ms_my: Kembangkan Semua

source: Collapse All
ms_my: Runtuhkan Semua

source: Start Date
ms_my: Tarikh Mula

source: Due Date
ms_my: Tarikh Akhir

source: remove all
ms_my: keluarkan semua

source: toggle chapter %(displayName)s
ms_my: togol bab %(displayName)s

source: Section
ms_my: Bahagian

source: Remove chapter %(chapterDisplayName)s
ms_my: Alih keluar bab %(chapterDisplayName)s

source: remove
ms_my: keluarkan

source: toggle subsection %(displayName)s
ms_my: togol subseksyen %(displayName)s

source: Subsection
ms_my: Subseksyen

source: Remove subsection %(subsectionDisplayName)s
ms_my: Alih keluar subseksyen %(subsectionDisplayName)s

source: Remove unit %(unitName)s
ms_my: Alih keluar unit %(unitName)s

source: Mark Exam As Completed
ms_my: Tandakan Peperiksaan Sebagai Selesai

source: Exam timer and end exam button
ms_my: Pemasa peperiksaan dan butang tamat peperiksaan

source: End My Exam
ms_my: Tamat Peperiksaan Saya

source: Hide Timer
ms_my: Sembunyikan Pemasa

source: You are taking "{exam_link}" as {exam_type}.
ms_my: Anda mengambil "{exam_link}" sebagai {exam_type}.

source: a timed exam
ms_my: peperiksaan bermasa

source: The timer on the right shows the time remaining in the exam.
ms_my: Pemasa di sebelah kanan menunjukkan baki masa dalam peperiksaan.

source: To receive credit for problems, you must select "Submit" for each problem before you select "End My Exam".
ms_my: Untuk menerima kredit untuk masalah, anda mesti memilih "Serah" untuk setiap masalah sebelum anda memilih "Tamatkan Peperiksaan Saya".

source: Show More
ms_my: Tunjukkan Lagi

source: Show Less
ms_my: Tunjukkan Kurang

source: LEARN MORE
ms_my: KETAHUI LEBIH LANJUT

source: Starts: %(start_date)s
ms_my: Bermula: %(start_date)s

source: Starts
ms_my: Bermula

source: Clear All
ms_my: Kosongkan Semua

source: Highlighted text
ms_my: Teks yang diserlahkan

source: Note
ms_my: Nota

source: You commented...
ms_my: Anda mengulas...

source: Noted in:
ms_my: Tercatat dalam:

source: Last Edited:
ms_my: Terakhir Diedit:

source: Tags:
ms_my: Tag:

source: Clear search results
ms_my: Kosongkan hasil carian

source: Click to edit
ms_my: Klik untuk mengedit

source: Order Number
ms_my: Nombor Pesanan

source: Date Placed
ms_my: Tarikh Diletakkan

source: Cost
ms_my: kos

source: Order Details
ms_my: Butiran Pesanan

source: for
ms_my: untuk

source: Product Name
ms_my: Nama Produk

source: {currentCountOpeningTag}{currentCharacterCount}{currentCountClosingTag} of {maxCharacters}
ms_my: {currentCountOpeningTag}{currentCharacterCount}{currentCountClosingTag} daripada {maxCharacters}

source: Financial Assistance Application
ms_my: Permohonan Bantuan Kewangan

source: Profile Information
ms_my: Maklumat Profil

source: The following information is already a part of your {platform} profile and is required for your application. To edit this information go to
ms_my: Maklumat berikut sudah pun menjadi sebahagian daripada profil {platform} anda dan diperlukan untuk permohonan anda. Untuk mengedit maklumat ini pergi ke

source: Email address
ms_my: Alamat e-mel

source: Legal name
ms_my: Nama sah

source: Country of residence
ms_my: Negara tempat tinggal

source: Application Details
ms_my: Butiran Permohonan

source: Submit Application
ms_my: Hantar Permohonan

source: Thank you for submitting your financial assistance application for {course_name}! You can expect a response in 2-4 business days.
ms_my: Terima kasih kerana menyerahkan permohonan bantuan kewangan anda untuk {course_name}! Anda boleh mengharapkan balasan dalam 2-4 hari perniagaan.

source: Go to Dashboard
ms_my: Pergi ke Papan Pemuka

source: Individual Exceptions
ms_my: Pengecualian Individu

source: Enter the username or email address of each learner that you want to add as an exception.
ms_my: Masukkan nama pengguna atau alamat e-mel setiap pelajar yang ingin anda tambahkan sebagai pengecualian.

source: Student email or username
ms_my: E-mel atau nama pengguna pelajar

source: Free text notes
ms_my: Nota teks percuma

source: Add to Exception List
ms_my: Tambahkan ke Senarai Pengecualian

source: Generate Exception Certificates
ms_my: Jana Sijil Pengecualian

source: Certificate exceptions group selection
ms_my: Pemilihan kumpulan pengecualian sijil

source: All users on the Exception list who do not yet have a certificate
ms_my: Semua pengguna dalam senarai Pengecualian yang belum mempunyai sijil

source: All users on the Exception list
ms_my: Semua pengguna dalam senarai Pengecualian

source: User Email
ms_my: E-mel Pengguna

source: Exception Granted
ms_my: Pengecualian Diberikan

source: Certificate Generated
ms_my: Sijil Dijana

source: Notes
ms_my: Nota

source: Remove from List
ms_my: Alih keluar daripada Senarai

source: Bulk Exceptions
ms_my: Pengecualian Pukal

source: Upload a comma separated values (.csv) file that contains the usernames or email addresses of learners who have been given exceptions. Include the username or email address in the first comma separated field. You can include an optional note describing the reason for the exception in the second comma separated field.
ms_my: Muat naik fail nilai dipisahkan koma (.csv) yang mengandungi nama pengguna atau alamat e-mel pelajar yang telah diberi pengecualian. Sertakan nama pengguna atau alamat e-mel dalam medan dipisahkan koma pertama. Anda boleh memasukkan nota pilihan yang menerangkan sebab pengecualian dalam medan dipisahkan koma kedua.

source: Upload a CSV file
ms_my: Muat naik fail CSV

source: To invalidate a certificate for a particular learner, add the username or email address below.
ms_my: Untuk membatalkan sijil bagi pelajar tertentu, tambah nama pengguna atau alamat e-mel di bawah.

source: Add notes about this learner
ms_my: Tambah nota tentang pelajar ini

source: Invalidate Certificate
ms_my: Sijil Batal

source: Student
ms_my: Pelajar

source: Invalidated By
ms_my: Dibatalkan Oleh

source: Invalidated
ms_my: Tidak sah

source: Remove from Invalidation Table
ms_my: Alih keluar daripada Jadual Pembatalan

source: Divided
ms_my: Terbahagi

source: Manage Learners
ms_my: Urus Pelajar

source: Add learners to this cohort
ms_my: Tambahkan pelajar pada kohort ini

source: Note: Learners can be in only one cohort. Adding learners to this group overrides any previous group assignment.
ms_my: Nota: Pelajar boleh berada dalam satu kohort sahaja. Menambahkan pelajar pada kumpulan ini mengatasi sebarang tugasan kumpulan sebelumnya.

source: Enter email addresses and/or usernames, separated by new lines or commas, for the learners you want to add. *
ms_my: Masukkan alamat e-mel dan/atau nama pengguna, dipisahkan dengan baris atau koma baharu, untuk pelajar yang ingin anda tambahkan. *

source: (Required Field)
ms_my: (Medan Diperlukan)

source: e.g. johndoe@example.com, JaneDoe, joeydoe@example.com
ms_my: cth. johndoe@example.com, JaneDoe, joeydoe@example.com

source: You will not receive notification for emails that bounce, so double-check your spelling.
ms_my: Anda tidak akan menerima pemberitahuan untuk e-mel yang melantun, jadi semak semula ejaan anda.

source: Add Learners
ms_my: Tambah Pelajar

source: Add a New Cohort
ms_my: Tambah Kohort Baharu

source: Enter the name of the cohort
ms_my: Masukkan nama kohort

source: Cohort Name
ms_my: Nama Kohort

source: Cohort Assignment Method
ms_my: Kaedah Tugasan Kohort

source: Automatic
ms_my: Automatik

source: There must be one cohort to which students can automatically be assigned.
ms_my: Mesti ada satu kohort yang pelajar boleh ditugaskan secara automatik.

source: Associated Content Group
ms_my: Kumpulan Kandungan Berkaitan

source: No Content Group
ms_my: Tiada Kumpulan Kandungan

source: Select a Content Group
ms_my: Pilih Kumpulan Kandungan

source: Choose a content group to associate
ms_my: Pilih kumpulan kandungan untuk dikaitkan

source: Not selected
ms_my: Tidak dipilih

source: Deleted Content Group
ms_my: Kumpulan Kandungan Dipadamkan

source: {screen_reader_start}Warning:{screen_reader_end} The previously selected content group was deleted. Select another content group.
ms_my: {screen_reader_start}Amaran:{screen_reader_end} Kumpulan kandungan yang dipilih sebelum ini telah dipadamkan. Pilih kumpulan kandungan lain.

source: {screen_reader_start}Warning:{screen_reader_end} No content groups exist.
ms_my: {screen_reader_start}Amaran:{screen_reader_end} Tiada kumpulan kandungan wujud.

source: Only the parent course staff of a CCX can create content groups.
ms_my: Hanya kakitangan kursus induk CCX boleh membuat kumpulan kandungan.

source: Create a content group
ms_my: Buat kumpulan kandungan

source: (contains %(student_count)s student)
ms_my: (mengandungi %(student_count)s pelajar)

source: Learners are added to this cohort only when you provide their email addresses or usernames on this page.
ms_my: Pelajar ditambahkan pada kohort ini hanya apabila anda memberikan alamat e-mel atau nama pengguna mereka pada halaman ini.

source: What does this mean?
ms_my: Apakah maksud ini?
