Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: You have been enrolled in %(course_name)s at %(site_name)s. This course will now appear on your %(site_name)s dashboard.
ms_my: Anda telah didaftarkan dalam %(course_name)s di %(site_name)s. Kursus ini kini akan muncul pada papan pemuka%(site_name)sanda.

source: You have been invited to register for %(course_name)s.
ms_my: Anda telah dijemput untuk mendaftar untuk %(course_name)s.

source: You have been unenrolled from %(course_name)s
ms_my: Anda telah dinyahdaftarkan daripada %(course_name)s

source: You have been unenrolled from the course %(course_name)s by a member of the course staff. Please disregard the invitation previously sent.
ms_my: Anda telah dinyahdaftarkan daripada kursus %(course_name)s oleh ahli kakitangan kursus. Sila abaikan jemputan yang dihantar sebelum ini.

source: Dear Student,
ms_my: Pelajar yang dihormati,

source: You have been unenrolled from the course %(course_name)s. Please disregard the invitation previously sent.
ms_my: Anda telah dinyahdaftarkan daripada kursus %(course_name)s. Sila abaikan jemputan yang dihantar sebelum ini.

source: You have been unenrolled from %(course_name)s at %(site_name)s by a member of the course staff. This course will no longer appear on your %(site_name)s dashboard.
ms_my: Anda telah dinyahdaftarkan daripada %(course_name)s di %(site_name)s oleh ahli kakitangan kursus. Kursus ini tidak lagi akan muncul pada papan pemuka %(site_name)sanda.

source: Your other courses have not been affected.
ms_my: Kursus anda yang lain tidak terjejas.

source: This email was automatically sent from %(site_name)s to %(full_name)s
ms_my: E-mel ini dihantar secara automatik daripada %(site_name)s kepada %(full_name)s

source: You have been unenrolled from %(course_name)s at %(site_name)s. This course will no longer appear on your %(site_name)s dashboard.
ms_my: Anda telah dinyahdaftarkan daripada %(course_name)s di %(site_name)s. Kursus ini tidak lagi akan muncul pada papan pemuka %(site_name)s anda.

source: You have been enrolled in %(course_name)s at %(site_name)s by a member of the course staff. This course will now appear on your %(site_name)s dashboard.
ms_my: Anda telah didaftarkan dalam %(course_name)s di %(site_name)s oleh ahli kakitangan kursus. Kursus ini kini akan muncul pada papan pemuka %(site_name)s anda.

source: Access the Course Materials Now
ms_my: Akses Bahan Kursus Sekarang

source: You have been invited to join %(course_name)s at %(site_name)s.
ms_my: Anda telah dijemput untuk menyertai %(course_name)s di %(site_name)s.

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s
ms_my: Anda telah dialih keluar sebagai penguji beta untuk %(course_name)s di %(site_name)s

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
ms_my: Anda telah dialih keluar sebagai penguji beta untuk %(course_name)s di %(site_name)s oleh ahli kakitangan kursus.

source: This course will remain on your dashboard, but you will no longer be part of the beta testing group.
ms_my: Kursus ini akan kekal pada papan pemuka anda, tetapi anda tidak akan menjadi sebahagian daripada kumpulan ujian beta lagi.

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff. This course will remain on your dashboard, but you will no longer be part of the beta testing group.
ms_my: Anda telah dialih keluar sebagai penguji beta untuk %(course_name)s di %(site_name)s oleh ahli kakitangan kursus. Kursus ini akan kekal pada papan pemuka anda, tetapi anda tidak akan menjadi sebahagian daripada kumpulan ujian beta lagi.

source: You have been removed from a beta test for %(course_name)s
ms_my: Anda telah dialih keluar daripada ujian beta untuk %(course_name)s

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s. This course will remain on your dashboard, but you will no longer be part of the beta testing group.
ms_my: Anda telah dialih keluar sebagai penguji beta untuk %(course_name)s di %(site_name)s. Kursus ini akan kekal pada papan pemuka anda, tetapi anda tidak akan menjadi sebahagian daripada kumpulan ujian beta lagi.

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s.
ms_my: Anda telah dialih keluar sebagai penguji beta untuk %(course_name)s di %(site_name)s.

source: Signed Out
ms_my: Log Keluar

source: You have signed out.
ms_my: Anda telah log keluar.

source: {start_anchor}%(tpa_logout_url)s{middle_anchor}Click here{end_anchor} to delete your single signed on (SSO) session.
ms_my: {start_anchor}%(tpa_logout_url)s{middle_anchor}Klik di sini{end_anchor} untuk memadamkan sesi tunggal anda yang ditandatangani pada (SSO).

source: We are signing you in.
ms_my: Kami sedang melog masuk anda.

source: If you are not redirected within 5 seconds, {start_anchor}%(target)s{middle_anchor}click here to go to the home page{end_anchor}.
ms_my: Jika anda tidak diubah hala dalam masa 5 saat, {start_anchor}%(target)s{middle_anchor}klik di sini untuk pergi ke halaman utama{end_anchor}.

source: Skip to main content
ms_my: Langkau ke kandungan utama

source: Authorize
ms_my: membenarkan

source: The above application requests the following permissions from your account:
ms_my: Aplikasi di atas meminta kebenaran berikut daripada akaun anda:

source: These permissions will be granted for data from your courses associated with the following content providers:
ms_my: Kebenaran ini akan diberikan untuk data daripada kursus anda yang dikaitkan dengan penyedia kandungan berikut:

source: Please click the 'Allow' button to grant these permissions to the above application. Otherwise, to withhold these permissions, please click the 'Cancel' button.
ms_my: Sila klik butang 'Benarkan' untuk memberikan kebenaran ini kepada permohonan di atas. Jika tidak, untuk menahan kebenaran ini, sila klik butang 'Batal'.

source: Cancel
ms_my: Batal

source: Allow
ms_my: benarkan

source: Error
ms_my: ralat

source: The course %(course_title)s has been reset !
ms_my: Kursus %(course_title)s telah ditetapkan semula !

source: Hello %(full_name)s,
ms_my: Helo %(full_name)s,

source: Your progress in course %(course_title)s has been reset on your behalf.
ms_my: Kemajuan anda dalam kursus %(course_title)s telah ditetapkan semula bagi pihak anda.

source: You will be able to re-attempt this course and earn a verified certificate upon successful completion.
ms_my: Anda akan dapat mencuba semula kursus ini dan memperoleh sijil yang disahkan setelah berjaya disiapkan.

source: Best,
ms_my: terbaik,

source: ID Verification Approved
ms_my: Pengesahan ID Diluluskan

source: Your %(platform_name)s ID verification photos have been approved.
ms_my: Foto pengesahan ID %(platform_name)s anda telah diluluskan.

source: Your approval status remains valid for two years, and it will expire %(expiration_datetime)s.
ms_my: Status kelulusan anda kekal sah selama dua tahun dan ia akan tamat tempoh %(expiration_datetime)s.

source: Enjoy your studies,
ms_my: Selamat belajar,

source: Your %(platform_name)s ID verification was approved!
ms_my: Pengesahan ID %(platform_name)s anda telah diluluskan!

source: Expired ID Verification
ms_my: Pengesahan ID Tamat Tempoh

source: Your %(platform_name)s ID verification has expired.
ms_my: Pengesahan ID %(platform_name)s anda telah tamat tempoh.

source: You must have a valid ID verification to take proctored exams and qualify for certificates.
ms_my: Anda mesti mempunyai pengesahan ID yang sah untuk mengambil peperiksaan terkawal dan layak mendapat sijil.

source: Follow the link below to submit your photos and renew your ID verification.
ms_my: Ikuti pautan di bawah untuk menyerahkan foto anda dan memperbaharui pengesahan ID anda.

source: You can also do this from your dashboard.
ms_my: Anda juga boleh melakukan ini dari papan pemuka anda.

source: Resubmit Verification : %(lms_verification_link)s
ms_my: Serahkan semula Pengesahan : %(lms_verification_link)s

source: ID verification FAQ : %(help_center_link)s
ms_my: Soalan Lazim pengesahan ID : %(help_center_link)s

source: Your %(platform_name)s Verification has Expired
ms_my: Pengesahan %(platform_name)s anda telah Tamat

source: ID Verification Submitted
ms_my: Pengesahan ID Diserahkan

source: Thank you for submitting your photos for identity verification with %(platform_name)s.
ms_my: Terima kasih kerana menyerahkan foto anda untuk pengesahan identiti dengan %(platform_name)s.

source: We have received your photos and they will be reviewed within 3-5 days.
ms_my: Kami telah menerima foto anda dan ia akan disemak dalam masa 3-5 hari.

source: You may check the status on your dashboard: %(dashboard_link)s
ms_my: Anda boleh menyemak status pada papan pemuka anda: %(dashboard_link)s

source: Best regards,
ms_my: salam sejahtera,

source: Thank you for submitting your photos!
ms_my: Terima kasih kerana menyerahkan foto anda!

source: Last modified:
ms_my: Terakhir diubah suai:

source: See all children
ms_my: Lihat semua kanak-kanak

source: This article was last modified:
ms_my: Artikel ini terakhir diubah suai:

source: Add new article
ms_my: Tambah artikel baharu

source: Create article
ms_my: Buat artikel

source: Go back
ms_my: pergi balik

source: Delete article
ms_my: Padamkan artikel

source: Delete
ms_my: Padam

source: You cannot delete a root article.
ms_my: Anda tidak boleh memadamkan artikel akar.

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
ms_my: Anda tidak boleh memadamkan artikel ini kerana anda tidak mempunyai kebenaran untuk memadamkan artikel dengan kanak-kanak. Cuba keluarkan kanak-kanak secara manual satu demi satu.

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
ms_my: Anda sedang memadamkan artikel. Ini bermakna bahawa anak-anaknya akan dipadamkan juga. Jika anda memilih untuk membersihkan, kanak-kanak juga akan dibersihkan!

source: Articles that will be deleted
ms_my: Artikel yang akan dipadamkan

source: ...and more!
ms_my: ...dan banyak lagi!

source: You are deleting an article. Please confirm.
ms_my: Anda sedang memadamkan artikel. Sila sahkan.

source: Edit
ms_my: Sunting

source: Save changes
ms_my: Simpan perubahan

source: Preview
ms_my: Pratonton

source: Wiki Preview
ms_my: Pratonton Wiki

source: window open
ms_my: tingkap terbuka

source: Back to editor
ms_my: Kembali ke editor

source: History
ms_my: Sejarah

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
ms_my: Klik setiap semakan untuk melihat senarai baris yang diedit. Klik butang Pratonton untuk melihat bagaimana artikel dilihat pada peringkat ini. Di bahagian bawah halaman ini, anda boleh menukar kepada semakan tertentu atau menggabungkan semakan lama dengan semakan semasa.

source: (no log message)
ms_my: (tiada mesej log)

source: Preview this revision
ms_my: Pratonton semakan ini

source: Auto log:
ms_my: Log automatik:

source: Change
ms_my: Berubah

source: Merge selected with current...
ms_my: Gabung dipilih dengan semasa...

source: Switch to selected version
ms_my: Tukar kepada versi yang dipilih

source: Wiki Revision Preview
ms_my: Pratonton Semakan Wiki

source: Back to history view
ms_my: Kembali ke paparan sejarah

source: Switch to this version
ms_my: Tukar kepada versi ini

source: Merge Revision
ms_my: Gabungkan Semakan

source: Merge with current
ms_my: Bercantum dengan arus

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
ms_my: Apabila anda menggabungkan semakan dengan semasa, semua data akan dikekalkan daripada kedua-dua versi dan digabungkan di lokasi anggarannya daripada setiap semakan.

source: After this, it's important to do a manual review.
ms_my: Selepas ini, adalah penting untuk melakukan semakan manual.

source: Create new merged version
ms_my: Buat versi gabungan baharu

source: You need to {anchor_start_login}log in{anchor_end} or {anchor_start_signup}sign up{anchor_end} to use this function.
ms_my: Anda perlu {anchor_start_login}log masuk{anchor_end} atau {anchor_start_signup}signup{anchor_end} untuk menggunakan fungsi ini.

source: You need to log in or sign up to use this function.
ms_my: Anda perlu log masuk atau mendaftar untuk menggunakan fungsi ini.

source: Wiki Cheatsheet
ms_my: Lembaran Cheat Wiki

source: Wiki Syntax Help
ms_my: Bantuan Sintaks Wiki

source: This wiki uses {start_strong}Markdown{end_strong} for styling. There are several useful guides online. See any of the links below for in-depth details:
ms_my: Wiki ini menggunakan {start_strong}Markdown{end_strong} untuk penggayaan. Terdapat beberapa panduan berguna dalam talian. Lihat mana-mana pautan di bawah untuk butiran mendalam:

source: Markdown: Basics
ms_my: Markdown: Asas

source: Quick Markdown Syntax Guide
ms_my: Panduan Sintaks Markdown Pantas

source: Miniature Markdown Guide
ms_my: Panduan Miniatur Markdown

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
ms_my: Untuk mencipta artikel wiki baharu, buat pautan kepadanya. Mengklik pautan memberi anda halaman penciptaan.

source: [Article Name](wiki:ArticleName)
ms_my: [Nama Artikel](wiki:Nama Artikel)

source: %(platform_name)s Additions:
ms_my: %(platform_name)s Tambahan:

source: Math Expression
ms_my: Ungkapan Matematik

source: Useful examples:
ms_my: Contoh berguna:

source: Huge Header
ms_my: Tandukan Besar

source: Smaller Header
ms_my: Tajuk Lebih Kecil

source: Unordered List
ms_my: Senarai Tidak Tertib

source: Sub Item 1
ms_my: Sub Perkara 1

source: Sub Item 2
ms_my: Sub Perkara 2

source: Ordered
ms_my: Dipesan

source: List
ms_my: Senaraikan

source: Quotes
ms_my: Petikan

source: Markdown syntax is allowed. See the {start_link}cheatsheet{end_link} for help.
ms_my: Sintaks penurunan harga dibenarkan. Lihat {start_link}cheatsheet{end_link} untuk mendapatkan bantuan.

source: Attachments
ms_my: Lampiran

source: Upload new file
ms_my: Muat naik fail baharu

source: Search and add file
ms_my: Cari dan tambah fail

source: Upload File
ms_my: Muat Naik Fail

source: Upload file
ms_my: Muat naik fail

source: Search files and articles
ms_my: Cari fail dan artikel

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
ms_my: Anda boleh menggunakan semula fail daripada artikel lain. Fail ini tertakluk kepada kemas kini pada artikel lain yang mungkin atau mungkin bukan perkara yang baik.

source: Search
ms_my: Cari

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
ms_my: Fail berikut tersedia untuk artikel ini. Salin teg markdown untuk merujuk terus kepada fail daripada teks artikel.

source: Markdown tag
ms_my: Tag turun harga

source: Uploaded by
ms_my: Dimuat naik oleh

source: Size
ms_my: Saiz

source: File History
ms_my: Sejarah Fail

source: Detach
ms_my: Tanggalkan

source: Replace
ms_my: Gantikan

source: Restore
ms_my: Pulihkan

source: anonymous (IP logged)
ms_my: tanpa nama (IP dilog)

source: File history
ms_my: Sejarah fail

source: revisions
ms_my: semakan

source: There are no attachments for this article.
ms_my: Tiada lampiran untuk artikel ini.

source: Previewing revision:
ms_my: Mempratonton semakan:

source: Previewing a merge between two revisions:
ms_my: Pratonton gabungan antara dua semakan:

source: This revision has been deleted.
ms_my: Semakan ini telah dipadamkan.

source: Restoring to this revision will mark the article as deleted.
ms_my: Pemulihan kepada semakan ini akan menandakan artikel sebagai dipadamkan.

source: LMS Administration
ms_my: Pentadbiran LMS

source: ACE Common
ms_my: ACE Biasa

source: Go to %(platform_name)s Home Page
ms_my: Pergi ke Halaman Utama %(platform_name)s

source: Courses
ms_my: Kursus

source: My Account
ms_my: Akaun Saya

source: %(platform_name)s on Twitter
ms_my: %(platform_name)s di Twitter

source: %(platform_name)s on Facebook
ms_my: %(platform_name)s di Facebook

source: %(platform_name)s on Reddit
ms_my: %(platform_name)s pada Reddit

source: Download the iOS app on the Apple Store
ms_my: Muat turun apl iOS di Apple Store

source: Download the Android app on the Google Play Store
ms_my: Muat turun apl Android di Gedung Google Play

source: Our mailing address is:
ms_my: Alamat surat menyurat kami ialah:

source: Unsubscribe from these emails.
ms_my: Nyahlanggan e-mel ini.

source: %(platform_name)s Email
ms_my: %(platform_name)s E-mel

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate. Upgrade by %(user_schedule_upgrade_deadline_time)s.
ms_my: Jangan lepaskan peluang untuk menyerlahkan pengetahuan dan kemahiran baharu anda dengan memperoleh sijil yang disahkan. Naik taraf mengikut %(user_schedule_upgrade_deadline_time)s.

source: Upgrade Now
ms_my: Tingkatkan Sekarang

source: Once you have approved this request, go to {catalog_admin_url} to set up a catalog for this user.
ms_my: Setelah anda meluluskan permintaan ini, pergi ke {catalog_admin_url} untuk menyediakan katalog untuk pengguna ini.

source: Organization Name
ms_my: Nama Organisasi

source: Organization Address
ms_my: Alamat Organisasi

source: Describe what your application does.
ms_my: Terangkan apa yang dilakukan oleh aplikasi anda.

source: The URL of your organization's website.
ms_my: URL tapak web organisasi anda.

source: The name of your organization.
ms_my: Nama organisasi anda.

source: The contact address of your organization.
ms_my: Alamat hubungan organisasi anda.

source: The following users do not exist: {usernames}.
ms_my: Pengguna berikut tidak wujud: {usernames}.

source: Comma-separated list of usernames which will be able to view this catalog.
ms_my: Senarai nama pengguna yang dipisahkan koma yang akan dapat melihat katalog ini.

source: Denied
ms_my: dinafikan

source: Approved
ms_my: Diluluskan

source: Status of this API access request
ms_my: Status permintaan akses API ini

source: The URL of the website associated with this API user.
ms_my: URL tapak web yang dikaitkan dengan pengguna API ini.

source: The reason this user wants to access the API.
ms_my: Sebab pengguna ini ingin mengakses API.

source: I, and my organization, accept the {link_start}{platform_name} API Terms of Service{link_end}.
ms_my: Saya dan organisasi saya, menerima {link_start}{platform_name} Syarat Perkhidmatan API{link_end}.

source: '%s' is not a valid scope.
ms_my: '%s' bukan skop yang sah.

source: Bookmarks
ms_my: Penanda buku

source: An error has occurred. Please try again.
ms_my: Ralat telah berlaku. Sila cuba lagi.

source: No data provided.
ms_my: Tiada data disediakan.

source: Parameter usage_id not provided.
ms_my: Parameter usage_id tidak disediakan.

source: Invalid usage_id: {usage_id}.
ms_my: ID_penggunaan tidak sah: {id_penggunaan}.

source: Block with usage_id: {usage_id} not found.
ms_my: Sekat dengan usage_id: {usage_id} tidak ditemui.

source: You can create up to {max_num_bookmarks_per_course} bookmarks. You must remove some bookmarks before you can add new ones.
ms_my: Anda boleh membuat sehingga {max_num_bookmarks_per_course} penanda halaman. Anda mesti mengalih keluar beberapa penanda halaman sebelum anda boleh menambah yang baharu.

source: Bookmark with usage_id: {usage_id} does not exist.
ms_my: Penanda halaman dengan usage_id: {usage_id} tidak wujud.

source: Internal API URL
ms_my: URL API Dalaman

source: DEPRECATED: Use the setting COURSE_CATALOG_API_URL.
ms_my: DITAMATKAN: Gunakan tetapan COURSE_CATALOG_API_URL.

source: Specified in seconds. Enable caching of API responses by setting this to a value greater than 0.
ms_my: Dinyatakan dalam beberapa saat. Dayakan cache respons API dengan menetapkan ini kepada nilai yang lebih besar daripada 0.

source: Long Term Cache Time To Live
ms_my: Masa Cache Jangka Panjang Untuk Hidup

source: Specified in seconds (defaults to 86400s, 24hr). In some cases the cache does needs to be refreshed less frequently. Enable long term caching of API responses by setting this to a value greater than 0.
ms_my: Ditentukan dalam saat (lalai kepada 86400s, 24jam). Dalam sesetengah kes, cache perlu kurang kerap dimuat semula. Dayakan cache jangka panjang respons API dengan menetapkan ini kepada nilai yang lebih besar daripada 0.

source: Username created for Course Catalog Integration, e.g. lms_catalog_service_user.
ms_my: Nama pengguna dicipta untuk Penyepaduan Katalog Kursus, mis. lms_catalog_service_user.

source: Page Size
ms_my: Saiz Halaman

source: Maximum number of records in paginated response of a single request to catalog service.
ms_my: Bilangan maksimum rekod dalam respons bernombor satu permintaan untuk perkhidmatan katalog.

source: These define the context to enable this configuration on. If no values are set, then the configuration applies globally. If a single value is set, then the configuration applies to all courses within that context. At most one value can be set at a time.{br}If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
ms_my: Ini mentakrifkan konteks untuk membolehkan konfigurasi ini dihidupkan. Jika tiada nilai ditetapkan, maka konfigurasi digunakan secara global. Jika satu nilai ditetapkan, maka konfigurasi digunakan untuk semua kursus dalam konteks tersebut. Paling banyak satu nilai boleh ditetapkan pada satu masa.{br}Jika berbilang konteks digunakan pada kursus (contohnya, jika konfigurasi ditentukan untuk kursus secara khusus dan untuk org tempat kursus itu berada, maka konteks yang lebih khusus mengatasi konteks yang lebih umum.

source: %(value)s should have the form ORG+COURSE
ms_my: %(value)s hendaklah mempunyai borang ORG+COURSE

source: Enabled
ms_my: Didayakan

source: Configure values for all course runs associated with this site.
ms_my: Konfigurasikan nilai untuk semua larian kursus yang dikaitkan dengan tapak ini.

source: Configure values for all course runs associated with this Organization. This is the organization string (i.e. edX, MITx).
ms_my: Konfigurasikan nilai untuk semua larian kursus yang dikaitkan dengan Organisasi ini. Ini ialah rentetan organisasi (iaitu edX, MITx).

source: Course in Org
ms_my: Kursus dalam Org

source: Course Run
ms_my: Larian Kursus

source: Configuration may not be specified at more than one level at once.
ms_my: Konfigurasi mungkin tidak ditentukan pada lebih daripada satu tahap sekaligus.

source: Error Status
ms_my: Status Ralat

source: Courses with Errors
ms_my: Kursus dengan Ralat

source: Learning Sequences and Outlines
ms_my: Urutan dan Rangka Pembelajaran

source: Numeric ID for each Course / Library context. This ID will generally require fewer bits than the full LearningContextKey, allowing more courses and libraries to be represented in content search filters.
ms_my: ID berangka untuk setiap konteks Kursus / Perpustakaan. ID ini biasanya memerlukan lebih sedikit bit daripada LearningContextKey penuh, membenarkan lebih banyak kursus dan perpustakaan diwakili dalam penapis carian kandungan.

source: Cannot change or remove the access level for the only admin.
ms_my: Tidak boleh menukar atau mengalih keluar tahap akses untuk satu-satunya pentadbir.
