Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: Showing {currentItemRange} out of {totalItemsCount}, sorted by {sortName} ascending
ms_my: Menunjukkan {currentItemRange} daripada {totalItemsCount}, diisih mengikut {sortName} menaik

source: Showing {currentItemRange} out of {totalItemsCount}, sorted by {sortName} descending
ms_my: Menunjukkan {currentItemRange} daripada {totalItemsCount}, diisih mengikut {sortName} menurun

source: {totalItems} total
ms_my: {totalItems} jumlah

source: content group
ms_my: kumpulan kandungan

source: Add your first content group
ms_my: Tambahkan kumpulan kandungan pertama anda

source: You have not created any content groups yet.
ms_my: Anda belum membuat sebarang kumpulan kandungan lagi.

source: Are you sure you want to remove this video from the list?
ms_my: Adakah anda pasti mahu mengalih keluar video ini daripada senarai?

source: Removing a video from this list does not affect course content. Any content that uses a previously uploaded video ID continues to display in the course.
ms_my: Mengalih keluar video daripada senarai ini tidak menjejaskan kandungan kursus. Sebarang kandungan yang menggunakan ID video yang dimuat naik sebelum ini terus dipaparkan dalam kursus.

source: Removing
ms_my: Mengalih keluar

source: Your changes will not take effect until you save your progress. Take care with key and value formatting, as validation is not implemented.
ms_my: Perubahan anda tidak akan berkuat kuasa sehingga anda menyimpan kemajuan anda. Berhati-hati dengan pemformatan kunci dan nilai, kerana pengesahan tidak dilaksanakan.

source: Your policy changes have been saved.
ms_my: Perubahan dasar anda telah disimpan.

source: No validation is performed on policy keys or value pairs. If you are having difficulties, check your formatting.
ms_my: Tiada pengesahan dilakukan pada kunci dasar atau pasangan nilai. Jika anda menghadapi masalah, semak pemformatan anda.

source: For grading to work, you must change all {oldName} subsections to {newName}.
ms_my: Untuk penggredan berfungsi, anda mesti menukar semua subseksyen {oldName} kepada {newName}.

source: Course Credit Requirements
ms_my: Keperluan Kredit Kursus

source: The minimum grade for course credit is not set.
ms_my: Gred minimum untuk kredit kursus tidak ditetapkan.

source: Course pacing cannot be changed once a course has started.
ms_my: Langkah kursus tidak boleh diubah setelah kursus dimulakan.

source: {hours}:{minutes} (current UTC time)
ms_my: {hours}:{minutes} (waktu UTC semasa)

source: Upload your course image.
ms_my: Muat naik imej kursus anda.

source: Upload your banner image.
ms_my: Muat naik imej sepanduk anda.

source: Upload your video thumbnail image.
ms_my: Muat naik imej lakaran kecil video anda.

source: Delete “<%- name %>”?
ms_my: Padamkan ““<%- name %>”?

source: Deleting a textbook cannot be undone and once deleted any reference to it in your courseware's navigation will also be removed.
ms_my: Pemadaman buku teks tidak boleh dibuat asal dan apabila dipadamkan, sebarang rujukan kepadanya dalam navigasi perisian kursus anda juga akan dialih keluar.

source: Delete Page Confirmation
ms_my: Padamkan Pengesahan Halaman

source: Are you sure you want to delete this page? This action cannot be undone.
ms_my: Adakah anda pasti mahu memadamkan halaman ini? Tindakan ini tidak boleh dibuat asal.

source: Upload
ms_my: Muat naik

source: We're sorry, there was an error
ms_my: Harap maaf, terdapat ralat

source: The combined length of the organization, course number, and course run fields cannot be more than <%- limit %> characters.
ms_my: Panjang gabungan organisasi, nombor kursus dan medan larian kursus tidak boleh melebihi &lt <%- limit %> aksara.

source: The combined length of the organization and library code fields cannot be more than <%- limit %> characters.
ms_my: Panjang gabungan medan kod organisasi dan perpustakaan tidak boleh melebihi <%- limit %> aksara.

source: Success! "{displayName}" has been moved.
ms_my: Berjaya! "{displayName}" telah dialihkan.

source: Move cancelled. "{sourceDisplayName}" has been moved back to its original location.
ms_my: Pergerakan dibatalkan. "{sourceDisplayName}" telah dialihkan kembali ke lokasi asalnya.

source: Undo move
ms_my: Buat asal langkah

source: Take me to the new location
ms_my: Bawa saya ke lokasi baru

source: Duplicating
ms_my: Menduakan

source: Undo moving
ms_my: Buat asal pergerakan

source: Moving
ms_my: Bergerak

source: Deleting this {xblock_type} is permanent and cannot be undone.
ms_my: Memadamkan {xblock_type} ini adalah kekal dan tidak boleh dibuat asal.

source: Any content that has listed this content as a prerequisite will also have access limitations removed.
ms_my: Mana-mana kandungan yang telah menyenaraikan kandungan ini sebagai prasyarat juga akan mempunyai had akses yang dialih keluar.

source: Delete this {xblock_type} (and prerequisite)?
ms_my: Padamkan {xblock_type} ini (dan prasyarat)?

source: Yes, delete this {xblock_type}
ms_my: Ya, padamkan {xblock_type} ini

source: Delete this {xblock_type}?
ms_my: Padamkan {xblock_type} ini?

source: section
ms_my: bahagian

source: subsection
ms_my: subseksyen

source: You've made some changes
ms_my: Anda telah membuat beberapa perubahan

source: Your changes will not take effect until you save your progress.
ms_my: Perubahan anda tidak akan berkuat kuasa sehingga anda menyimpan kemajuan anda.

source: You've made some changes, but there are some errors
ms_my: Anda telah membuat beberapa perubahan, tetapi terdapat beberapa ralat

source: Please address the errors on this page first, and then save your progress.
ms_my: Sila atasi ralat pada halaman ini dahulu, dan kemudian simpan kemajuan anda.

source: Save Changes
ms_my: Simpan Perubahan

source: Your changes have been saved.
ms_my: Perubahan anda telah disimpan.

source: Please select a file in .srt format.
ms_my: Sila pilih fail dalam format .srt.

source: Error: Uploading failed.
ms_my: Ralat: Gagal memuat naik.

source: Error: Import failed.
ms_my: Ralat: Import gagal.

source: Error: Replacing failed.
ms_my: Ralat: Gagal menggantikan.

source: Error: Choosing failed.
ms_my: Ralat: Gagal memilih.

source: Error: Connection with server failed.
ms_my: Ralat: Sambungan dengan pelayan gagal.

source: Link types should be unique.
ms_my: Jenis pautan hendaklah unik.

source: Links should be unique.
ms_my: Pautan mestilah unik.

source: Incorrect url format.
ms_my: Format url salah.

source: Sorry, there was an error parsing the subtitles that you uploaded. Please check the format and try again.
ms_my: Maaf, terdapat ralat menghuraikan sari kata yang anda muat naik. Sila semak format dan cuba lagi.

source: Are you sure you want to remove this transcript?
ms_my: Adakah anda pasti mahu mengalih keluar transkrip ini?

source: If you remove this transcript, the transcript will not be available for this component.
ms_my: Jika anda mengalih keluar transkrip ini, transkrip tidak akan tersedia untuk komponen ini.

source: Remove Transcript
ms_my: Alih keluar Transkrip

source: Upload translation
ms_my: Muat naik terjemahan

source: Add Thumbnail
ms_my: Tambah Thumbnail

source: Image upload failed
ms_my: Muat naik imej gagal

source: {ReqTextSpanStart}Requirements{spanEnd}{lineBreak}{InstructionsSpanStart}{videoImageResoultion}{lineBreak} {videoImageSupportedFileFormats}{spanEnd}
ms_my: {ReqTextSpanStart}Keperluan{spanEnd}{lineBreak}{InstructionsSpanStart}{videoImageResoultion}{lineBreak} {videoImageSupportedFileFormats}{spanEnd}

source: {maxWidth}x{maxHeight} pixels
ms_my: {maxWidth}x{maxHeight} piksel

source: Thumbnail for {videoName}
ms_my: Lakaran kecil untuk {videoName}

source: Add Thumbnail - {videoName}
ms_my: Tambah Lakaran Kecil - {videoName}

source: Video duration is {humanizeDuration}
ms_my: Tempoh video ialah {humanizeDuration}

source: minutes
ms_my: minit

source: minute
ms_my: minit

source: seconds
ms_my: detik

source: second
ms_my: kedua

source: and
ms_my: dan

source: Video image upload started
ms_my: Muat naik imej video bermula

source: Video image upload completed
ms_my: Muat naik imej video selesai

source: This image file type is not supported. Supported file types are {supportedFileFormats}.
ms_my: Jenis fail imej ini tidak disokong. Jenis fail yang disokong ialah {supportedFileFormats}.

source: The selected image must be smaller than {maxFileSizeInMB}.
ms_my: Imej yang dipilih mestilah lebih kecil daripada {maxFileSizeInMB}.

source: The selected image must be larger than {minFileSizeInKB}.
ms_my: Imej yang dipilih mestilah lebih besar daripada {minFileSizeInKB}.

source: Could not upload the video image file
ms_my: Tidak dapat memuat naik fail imej video

source: Image upload failed.
ms_my: Muat naik imej gagal.

source: The file could not be uploaded.
ms_my: Fail tidak dapat dimuat naik.

source: Hide transcripts ({transcriptCount})
ms_my: Sembunyikan transkrip ({transcriptCount})

source: Show transcripts ({transcriptCount})
ms_my: Tunjukkan transkrip ({transcriptCount})

source: This file type is not supported. Supported file type is {supportedFileFormat}.
ms_my: Jenis fail ini tidak disokong. Jenis fail yang disokong ialah {supportedFileFormat}.

source: If you remove this transcript, the transcript will not be available for any components that use this video.
ms_my: Jika anda mengalih keluar transkrip ini, transkrip tidak akan tersedia untuk mana-mana komponen yang menggunakan video ini.

source: Settings
ms_my: tetapan

source: New {component_type}
ms_my: {component_type} baharu

source: Warning
ms_my: Amaran

source: Error
ms_my: ralat

source: Updating Tags
ms_my: Mengemas kini Tag

source: View child items
ms_my: Lihat item kanak-kanak

source: Navigate up
ms_my: Navigasi ke atas

source: Select
ms_my: Pilih

source: Required field.
ms_my: Medan yang diperlukan.

source: Please do not use any spaces in this field.
ms_my: Tolong jangan gunakan sebarang ruang dalam medan ini.

source: Please do not use any spaces or special characters in this field.
ms_my: Tolong jangan gunakan sebarang ruang atau aksara khas dalam medan ini.

source: Pagination
ms_my: penomboran

source: Your request could not be completed. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
ms_my: Permintaan anda tidak dapat diselesaikan. Muat semula halaman dan cuba lagi. Jika isu berterusan, klik tab Bantuan untuk melaporkan masalah.

source: Showing {firstIndex} out of {numItems} total
ms_my: Menunjukkan {firstIndex} daripada jumlah {numItems}.

source: Showing {firstIndex}-{lastIndex} out of {numItems} total
ms_my: Menunjukkan {firstIndex}-{lastIndex} daripada jumlah {numItems}.

source: Loading content
ms_my: Memuatkan kandungan

source: Your request could not be processed. Refresh the page and try again.
ms_my: Permintaan anda tidak dapat diproses. Muat semula halaman dan cuba lagi.

source: Some images in this post have been omitted
ms_my: Beberapa imej dalam siaran ini telah ditinggalkan

source: image omitted
ms_my: imej ditinggalkan

source: there is currently {numVotes} vote
ms_my: terdapat {numVotes} undian pada masa ini

source: {numVotes} Vote
ms_my: {numVotes} Undian

source: You could not be subscribed to this post. Refresh the page and try again.
ms_my: Anda tidak boleh melanggan siaran ini. Muat semula halaman dan cuba lagi.

source: You could not be unsubscribed from this post. Refresh the page and try again.
ms_my: Anda tidak boleh menyahlanggan siaran ini. Muat semula halaman dan cuba lagi.

source: This response could not be marked as an answer. Refresh the page and try again.
ms_my: Respons ini tidak dapat ditandakan sebagai jawapan. Muat semula halaman dan cuba lagi.

source: This response could not be unmarked as an answer. Refresh the page and try again.
ms_my: Respons ini tidak boleh dinyahtandakan sebagai jawapan. Muat semula halaman dan cuba lagi.

source: This response could not be marked as endorsed. Refresh the page and try again.
ms_my: Respons ini tidak dapat ditandakan sebagai disokong. Muat semula halaman dan cuba lagi.

source: This response could not be unendorsed. Refresh the page and try again.
ms_my: Respons ini tidak boleh dibatalkan sokongan. Muat semula halaman dan cuba lagi.

source: This vote could not be processed. Refresh the page and try again.
ms_my: Undian ini tidak dapat diproses. Muat semula halaman dan cuba lagi.

source: This post could not be pinned. Refresh the page and try again.
ms_my: Siaran ini tidak dapat disematkan. Muat semula halaman dan cuba lagi.

source: This post could not be unpinned. Refresh the page and try again.
ms_my: Siaran ini tidak dapat dinyahsemat. Muat semula halaman dan cuba lagi.

source: This post could not be flagged for abuse. Refresh the page and try again.
ms_my: Siaran ini tidak dapat dibenderakan kerana penyalahgunaan. Muat semula halaman dan cuba lagi.

source: This post could not be unflagged for abuse. Refresh the page and try again.
ms_my: Siaran ini tidak boleh dinyahbenderakan kerana penyalahgunaan. Muat semula halaman dan cuba lagi.

source: This post could not be closed. Refresh the page and try again.
ms_my: Siaran ini tidak dapat ditutup. Muat semula halaman dan cuba lagi.

source: This post could not be reopened. Refresh the page and try again.
ms_my: Catatan ini tidak dapat dibuka semula. Muat semula halaman dan cuba lagi.

source: Show Discussion
ms_my: Tunjukkan Perbincangan

source: Hide Discussion
ms_my: Sembunyikan Perbincangan

source: This discussion could not be loaded. Refresh the page and try again.
ms_my: Perbincangan ini tidak dapat dimuatkan. Muat semula halaman dan cuba lagi.

source: There are no posts in this topic yet.
ms_my: Tiada siaran dalam topik ini lagi.

source: Loading more threads
ms_my: Memuatkan lebih banyak utas

source: Additional posts could not be loaded. Refresh the page and try again.
ms_my: Catatan tambahan tidak dapat dimuatkan. Muat semula halaman dan cuba lagi.

source: Current conversation
ms_my: Perbualan semasa

source: Loading posts list
ms_my: Memuatkan senarai catatan

source: No results found for {original_query}. Showing results for {suggested_query}.
ms_my: Tiada hasil ditemui untuk {original_query}. Menunjukkan hasil untuk {suggested_query}.

source: No posts matched your query.
ms_my: Tiada siaran yang sepadan dengan pertanyaan anda.

source: Show posts by {username}.
ms_my: Tunjukkan siaran oleh {username}.

source: The post you selected has been deleted.
ms_my: Siaran yang anda pilih telah dipadamkan.

source: Responses could not be loaded. Refresh the page and try again.
ms_my: Jawapan tidak dapat dimuatkan. Muat semula halaman dan cuba lagi.

source: Additional responses could not be loaded. Refresh the page and try again.
ms_my: Respons tambahan tidak dapat dimuatkan. Muat semula halaman dan cuba lagi.

source: {numResponses} other response
ms_my: {numResponses} respons lain

source: {numResponses} response
ms_my: {numResponses} maklum balas

source: Showing all responses
ms_my: Menunjukkan semua respons

source: Showing first response
ms_my: Menunjukkan respons {numResponses} pertama

source: Load all responses
ms_my: Muatkan semua jawapan

source: Load next {numResponses} responses
ms_my: Muatkan jawapan {numResponses} seterusnya

source: Are you sure you want to delete this post?
ms_my: Adakah anda pasti mahu memadamkan siaran ini?

source: Your post will be discarded.
ms_my: Catatan anda akan dibuang.

source: anonymous
ms_my: tanpa nama

source: Are you sure you want to delete this comment?
ms_my: Adakah anda pasti mahu memadamkan ulasan ini?

source: This comment could not be deleted. Refresh the page and try again.
ms_my: Ulasan ini tidak dapat dipadamkan. Muat semula halaman dan cuba lagi.

source: Are you sure you want to delete this response?
ms_my: Adakah anda pasti mahu memadamkan respons ini?

source: The email address you've provided isn't formatted correctly.
ms_my: Alamat e-mel yang anda berikan tidak diformatkan dengan betul.

source: %(field)s must have at least %(count)d characters.
ms_my: %(field)s mesti mempunyai sekurang-kurangnya %(count)d aksara.

source: %(field)s can only contain up to %(count)d characters.
ms_my: %(field)s hanya boleh mengandungi sehingga %(count)d aksara.

source: Please enter your %(field)s.
ms_my: Sila masukkan %(medan)s anda.

source: Drop target image
ms_my: Jatuhkan imej sasaran

source: dragging out of slider
ms_my: menyeret keluar dari gelangsar

source: dragging
ms_my: mengheret

source: dropped in slider
ms_my: jatuh dalam gelangsar

source: dropped on target
ms_my: jatuh pada sasaran

source: %s ago
ms_my: %s lalu

source: %s from now
ms_my: %s dari sekarang

source: less than a minute
ms_my: kurang dari satu minit

source: about a minute
ms_my: lebih kurang seminit

source: %d minute
ms_my: %d minit

source: about an hour
ms_my: lebih kurang sejam

source: about %d hour
ms_my: kira-kira %d jam

source: a day
ms_my: sehari

source: %d day
ms_my: %d hari

source: about a month
ms_my: lebih kurang sebulan

source: %d month
ms_my: %d bulan

source: about a year
ms_my: lebih kurang setahun

source: %d year
ms_my: %d tahun

source: Select a section or problem
ms_my: Pilih bahagian atau masalah

source: Create a report of problem responses
ms_my: Buat laporan tindak balas masalah

source: Your report is being generated...
ms_my: Laporan anda sedang dijana...

source: Your report has been successfully generated.
ms_my: Laporan anda telah berjaya dihasilkan.

source: View Report
ms_my: Lihat Laporan

source: There was an error generating the report link.
ms_my: Terdapat ralat menjana pautan laporan.

source: There was an error generating your report.
ms_my: Terdapat ralat semasa menjana laporan anda.

source: Unable to get report generation status.
ms_my: Tidak dapat mendapatkan status penjanaan laporan.

source: Unable to submit request to generate report.
ms_my: Tidak dapat menyerahkan permintaan untuk menjana laporan.

source: An unexpected error occurred. Please try again.
ms_my: Ralat yang tidak dijangka berlaku. Sila cuba lagi.

source: Financial Assistance
ms_my: Bantuan Kewangan

source: Upset Learner
ms_my: Pelajar Marah

source: Teaching Assistant
ms_my: Pembantu Pengajar

source: Please specify a reason.
ms_my: Sila nyatakan sebab.

source: Something went wrong changing this enrollment. Please try again.
ms_my: Berlaku kesilapan menukar pendaftaran ini. Sila cuba lagi.

source: Please fix the following errors:
ms_my: Sila betulkan ralat berikut:

source: Files that you upload must be smaller than 5MB in size.
ms_my: Fail yang anda muat naik mestilah bersaiz lebih kecil daripada 5MB.

source: Files that you upload must be PDFs or image files in .gif, .jpg, .jpeg, or .png format.
ms_my: Fail yang anda muat naik mestilah PDF atau fail imej dalam format .gif, .jpg, .jpeg atau .png.

source: Something went wrong. Please try again later.
ms_my: Sesuatu telah berlaku. Sila cuba lagi kemudian.

source: Add Attachment
ms_my: Tambah Lampiran

source: (Optional)
ms_my: (Pilihan)

source: Remove file
ms_my: Alih keluar fail

source: Course Name
ms_my: Nama Kursus

source: For inquiries regarding assignments, grades, or structure of a specific course, please post in the discussion forums for that course directly.
ms_my: Untuk pertanyaan mengenai tugasan, gred atau struktur kursus tertentu, sila siarkan dalam forum perbincangan untuk kursus itu secara langsung.

source: Not specific to a course
ms_my: Tidak khusus untuk kursus

source: Subject
ms_my: Subjek

source: Select a category
ms_my: Pilih kategori

source: Account Settings
ms_my: Tetapan Akaun

source: Billing/Payment Options
ms_my: Pilihan Pengebilan/Pembayaran

source: Certificates
ms_my: Sijil

source: Course Content
ms_my: Kandungan Kursus

source: Deadlines
ms_my: Tarikh akhir

source: Errors/Technical Issues
ms_my: Ralat/Isu Teknikal

source: Financial Aid
ms_my: Bantuan Kewangan

source: Photo Verification
ms_my: Pengesahan Foto

source: Proctoring
ms_my: Pengawasan

source: Other
ms_my: Lain-lain

source: Course Discussion Forum
ms_my: Forum Perbincangan Kursus

source: While our support team is happy to assist with the edX platform, the course staff has the expertise for specific assignment questions, grading or the proper procedures in each course. Please post all course related questions within the Discussion Forum where the Course Staff can directly respond.
ms_my: Walaupun pasukan sokongan kami gembira untuk membantu dengan platform edX, kakitangan kursus mempunyai kepakaran untuk soalan tugasan tertentu, penggredan atau prosedur yang betul dalam setiap kursus. Sila siarkan semua soalan berkaitan kursus dalam Forum Perbincangan di mana Kakitangan Kursus boleh menjawab secara langsung.

source: Sign in to {platform} so we can help you better.
ms_my: Log masuk ke {platform} supaya kami boleh membantu anda dengan lebih baik.

source: Select a course or select "Not specific to a course" for your support request.
ms_my: Pilih kursus atau pilih "Tidak khusus untuk kursus" untuk permintaan sokongan anda.

source: Select a subject for your support request.
ms_my: Pilih subjek untuk permintaan sokongan anda.

source: Enter some details for your support request.
ms_my: Masukkan beberapa butiran untuk permintaan sokongan anda.

source: Contact Us
ms_my: Hubungi Kami

source: Find answers to the top questions asked by learners.
ms_my: Cari jawapan kepada soalan teratas yang ditanya oleh pelajar.

source: Go to my Dashboard
ms_my: Pergi ke Papan Pemuka saya

source: Go to {platform} Home
ms_my: Pergi ke Laman Utama {platform}.

source: Thank you for submitting a request! We appreciate your patience while we work to review your request.
ms_my: Terima kasih kerana menghantar permintaan! Kami menghargai kesabaran anda semasa kami berusaha untuk menyemak permintaan anda.

source: Cancel upload
ms_my: Batalkan muat naik

source: last activity
ms_my: aktiviti terakhir

source: open slots
ms_my: buka slot

source: name
ms_my: Nama

source: team count
ms_my: kiraan pasukan

source: Teams
ms_my: Pasukan

source: Create
ms_my: Buat

source: Update
ms_my: Kemas kini

source: Team Name (Required) *
ms_my: Nama Pasukan (Diperlukan) *

source: A name that identifies your team (maximum 255 characters).
ms_my: Nama yang mengenal pasti pasukan anda (maksimum 255 aksara).

source: Team Description (Required) *
ms_my: Penerangan Pasukan (Diperlukan) *

source: A short description of the team to help other learners understand the goals or direction of the team (maximum 300 characters).
ms_my: Penerangan ringkas tentang pasukan untuk membantu pelajar lain memahami matlamat atau hala tuju pasukan (maksimum 300 aksara).

source: Language
ms_my: Bahasa

source: The language that team members primarily use to communicate with each other.
ms_my: Bahasa yang digunakan terutamanya oleh ahli pasukan untuk berkomunikasi antara satu sama lain.

source: Country
ms_my: Negara

source: The country that team members primarily identify with.
ms_my: Negara yang paling dikenal pasti oleh ahli pasukan.

source: An error occurred. Please try again.
ms_my: Ralat berlaku. Sila cuba lagi.

source: Check the highlighted fields below and try again.
ms_my: Semak medan yang diserlahkan di bawah dan cuba lagi.

source: Enter team name.
ms_my: Masukkan nama pasukan.

source: Team name cannot have more than 255 characters.
ms_my: Nama pasukan tidak boleh mempunyai lebih daripada 255 aksara.

source: Enter team description.
ms_my: Masukkan perihalan pasukan.

source: Team description cannot have more than 300 characters.
ms_my: Perihalan pasukan tidak boleh mempunyai lebih daripada 300 aksara.

source: An error occurred while removing the member from the team. Try again.
ms_my: Ralat berlaku semasa mengalih keluar ahli daripada pasukan. Cuba lagi.
