Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Add Component
ms_my: Tambah Komponen

source: Adding content to your library
ms_my: Menambah kandungan pada pustaka anda

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
ms_my: Tambahkan komponen pada pustaka anda untuk digunakan dalam kursus, menggunakan Tambah Komponen Baharu di bahagian bawah halaman ini.

source: Components are listed in the order in which they are added, with the most recently added at the bottom. Use the pagination arrows to navigate from page to page if you have more than one page of components in your library.
ms_my: Komponen disenaraikan dalam susunan ia ditambah, dengan yang paling baru ditambah di bahagian bawah. Gunakan anak panah penomboran untuk menavigasi dari halaman ke halaman jika anda mempunyai lebih daripada satu halaman komponen dalam pustaka anda.

source: Using library content in courses
ms_my: Menggunakan kandungan perpustakaan dalam kursus

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
ms_my: Gunakan kandungan perpustakaan dalam kursus dengan menambahkan kunci dasar {em_start}library_content{em_end} pada Senarai Modul Lanjutan dalam Tetapan Lanjutan kursus, kemudian menambah Blok Kandungan Rawak pada perisian kursus anda. Dalam tetapan untuk setiap Blok Kandungan Rawak, pilih perpustakaan ini sebagai pustaka sumber, dan nyatakan bilangan masalah yang akan dipilih secara rawak dan dipaparkan kepada setiap pelajar.

source: Learn more about content libraries
ms_my: Ketahui lebih lanjut tentang perpustakaan kandungan

source: Course Team Settings
ms_my: Tetapan Pasukan Kursus

source: New Team Member
ms_my: Ahli Pasukan Baru

source: Add a User to Your Course's Team
ms_my: Tambahkan Pengguna pada Pasukan Kursus Anda

source: New Team Member Information
ms_my: Maklumat Ahli Pasukan Baharu

source: User's Email Address
ms_my: Alamat E-mel Pengguna

source: Provide the email address of the user you want to add as Staff
ms_my: Berikan alamat e-mel pengguna yang ingin anda tambahkan sebagai Kakitangan

source: Add User
ms_my: Tambah Pengguna

source: Add Team Members to This Course
ms_my: Tambah Ahli Pasukan ke Kursus Ini

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
ms_my: Menambah ahli pasukan menjadikan pengarangan kursus kolaboratif. Pengguna mesti mendaftar untuk {studio_name} dan mempunyai akaun aktif.

source: Add a New Team Member
ms_my: Tambah Ahli Pasukan Baharu

source: Course Team Roles
ms_my: Peranan Pasukan Kursus

source: Course team members with the Staff role are course co-authors. They have full writing and editing privileges on all course content.
ms_my: Ahli pasukan kursus dengan peranan Kakitangan adalah pengarang bersama kursus. Mereka mempunyai keistimewaan penulisan dan penyuntingan penuh pada semua kandungan kursus.

source: Admins are course team members who can add and remove other course team members.
ms_my: Pentadbir ialah ahli pasukan kursus yang boleh menambah dan mengalih keluar ahli pasukan kursus lain.

source: All course team members can access content in Studio, the LMS, and Insights, and they are automatically enrolled in the course.
ms_my: Semua ahli pasukan kursus boleh mengakses kandungan dalam Studio, LMS dan Insights, dan mereka didaftarkan secara automatik dalam kursus.

source: Transferring Ownership
ms_my: Memindahkan Pemilikan

source: Library User Access
ms_my: Akses Pengguna Perpustakaan

source: User Access
ms_my: Akses Pengguna

source: Grant Access to This Library
ms_my: Berikan Akses kepada Perpustakaan Ini

source: Provide the email address of the user you want to add
ms_my: Berikan alamat e-mel pengguna yang ingin anda tambahkan

source: Add More Users to This Library
ms_my: Tambahkan Lebih Banyak Pengguna pada Pustaka Ini

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
ms_my: Berikan ahli pasukan kursus anda yang lain akses ke pustaka ini. Pengguna perpustakaan baharu mesti mempunyai akaun {studio_name} yang aktif.

source: Add a New User
ms_my: Tambah Pengguna Baharu

source: Library Access Roles
ms_my: Peranan Akses Perpustakaan

source: There are three access roles for libraries: User, Staff, and Admin.
ms_my: Terdapat tiga peranan akses untuk perpustakaan: Pengguna, Kakitangan dan Pentadbir.

source: Library Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
ms_my: Pengguna Perpustakaan boleh melihat kandungan perpustakaan dan boleh merujuk atau menggunakan komponen perpustakaan dalam kursus mereka, tetapi mereka tidak boleh mengedit kandungan perpustakaan.

source: Library Staff are content co-authors. They have full editing privileges on the contents of a library.
ms_my: Kakitangan Perpustakaan ialah pengarang bersama kandungan. Mereka mempunyai keistimewaan penyuntingan penuh pada kandungan perpustakaan.

source: Library Admins have full editing privileges and can also add and remove other team members. There must be at least one user with the Admin role in a library.
ms_my: Pentadbir Perpustakaan mempunyai keistimewaan pengeditan penuh dan juga boleh menambah serta mengalih keluar ahli pasukan lain. Mesti ada sekurang-kurangnya seorang pengguna dengan peranan Pentadbir dalam pustaka.

source: Schedule & Details Settings
ms_my: Tetapan Jadual & Butiran

source: Schedule & Details
ms_my: Jadual & Butiran

source: Basic Information
ms_my: Maklumat Asas

source: The nuts and bolts of your course
ms_my: Nat dan bolt kursus anda

source: This field is disabled: this information cannot be changed.
ms_my: Medan ini dilumpuhkan: maklumat ini tidak boleh diubah.

source: Course Summary Page
ms_my: Halaman Ringkasan Kursus

source: (for student enrollment and access)
ms_my: (untuk pendaftaran dan akses pelajar)

source: Enroll in {course_display_name}
ms_my: Daftar dalam {course_display_name}

source: Send a note to students via email
ms_my: Hantar nota kepada pelajar melalui e-mel

source: Invite your students
ms_my: Jemput pelajar anda

source: Promoting Your Course with {platform_name}
ms_my: Mempromosikan Kursus Anda dengan {platform_name}

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
ms_my: Halaman ringkasan kursus anda tidak akan dapat dilihat sehingga kursus anda diumumkan. Untuk menyediakan kandungan untuk halaman dan pratontonnya, ikut arahan yang diberikan oleh Pengurus Program anda.

source: Please note that changes here may take up to a business day to appear on your course summary page.
ms_my: Sila ambil perhatian bahawa perubahan di sini mungkin mengambil masa sehingga satu hari perniagaan untuk dipaparkan pada halaman ringkasan kursus anda.

source: Course Credit Requirements
ms_my: Keperluan Kredit Kursus

source: Steps required to earn course credit
ms_my: Langkah-langkah yang diperlukan untuk mendapatkan kredit kursus

source: Minimum Grade
ms_my: Gred Minimum

source: Successful Proctored Exam
ms_my: Berjaya Peperiksaan Proctored

source: Proctored Exam {number}
ms_my: Peperiksaan Proctored {number}

source: ID Verification
ms_my: Pengesahan ID

source: In-Course Reverification {number}
ms_my: Pengesahan Semula Dalam Kursus {number}

source: Course Pacing
ms_my: Pacing Kursus

source: Set the pacing for this course
ms_my: Tetapkan pacing untuk kursus ini

source: Instructor-Paced
ms_my: Pengajar-Paced

source: Instructor-paced courses progress at the pace that the course author sets. You can configure release dates for course content and due dates for assignments.
ms_my: Kursus mengikut kadar pengajar berkembang mengikut kadar yang ditetapkan oleh pengarang kursus. Anda boleh mengkonfigurasi tarikh keluaran untuk kandungan kursus dan tarikh tamat tugasan.

source: Self-Paced
ms_my: Sendiri

source: Self-paced courses offer suggested due dates for assignments or exams based on the learner’s enrollment date and the expected course duration. These courses offer learners flexibility to modify the assignment dates as needed.
ms_my: Kursus kendiri menawarkan tarikh akhir yang dicadangkan untuk tugasan atau peperiksaan berdasarkan tarikh pendaftaran pelajar dan jangkaan tempoh kursus. Kursus ini menawarkan fleksibiliti pelajar untuk mengubah suai tarikh tugasan mengikut keperluan.

source: Course Schedule
ms_my: Jadual Kursus

source: Dates that control when your course can be viewed
ms_my: Tarikh yang mengawal masa kursus anda boleh dilihat

source: Course Start Date
ms_my: Tarikh Mula Kursus

source: First day the course begins
ms_my: Hari pertama kursus bermula

source: Course Start Time
ms_my: Masa Mula Kursus

source: Course End Date
ms_my: Tarikh Tamat Kursus

source: Last day your course is active
ms_my: Hari terakhir kursus anda aktif

source: Course End Time
ms_my: Masa Tamat Kursus

source: Immediately upon passing
ms_my: Sejurus selepas berlalu

source: End date of course
ms_my: Tarikh tamat sudah tentu

source: A date after the course end date
ms_my: Tarikh selepas tarikh tamat kursus

source: Certificates are awarded at the end of a course run
ms_my: Sijil diberikan pada akhir kursus dijalankan

source: Read more about this setting
ms_my: Baca lebih lanjut tentang tetapan ini

source: In all configurations of this setting, certificates are generated for learners as soon as they achieve the passing threshold in the course (which can occur before a final assignment based on course design)
ms_my: Dalam semua konfigurasi tetapan ini, sijil dijana untuk pelajar sebaik sahaja mereka mencapai ambang lulus dalam kursus (yang boleh berlaku sebelum tugasan akhir berdasarkan reka bentuk kursus)

source: Learners can access their certificate as soon as they achieve a passing grade above the course grade threshold. Note: learners can achieve a passing grade before encountering all assignments in some course configurations.
ms_my: Pelajar boleh mengakses sijil mereka sebaik sahaja mereka mencapai gred lulus melebihi ambang gred kursus. Nota: pelajar boleh mencapai gred lulus sebelum menghadapi semua tugasan dalam beberapa konfigurasi kursus.

source: On course end date
ms_my: Pada tarikh tamat kursus

source: Learners with passing grades can access their certificate once the end date of the course has elapsed.
ms_my: Pelajar dengan gred lulus boleh mengakses sijil mereka sebaik sahaja tarikh tamat kursus telah berlalu.

source: Learners with passing grades can access their certificate after the date that you set has elapsed.
ms_my: Pelajar dengan gred lulus boleh mengakses sijil mereka selepas tarikh yang anda tetapkan telah berlalu.

source: Certificates Available Date
ms_my: Tarikh Tersedia Sijil

source: Enrollment Start Date
ms_my: Tarikh Mula Pendaftaran

source: First day students can enroll
ms_my: Pelajar hari pertama boleh mendaftar

source: Enrollment Start Time
ms_my: Masa Mula Pendaftaran

source: Enrollment End Date
ms_my: Tarikh Tamat Pendaftaran

source: Last day students can enroll.
ms_my: Hari terakhir pelajar boleh mendaftar.

source: Contact your {platform_name} partner manager to update these settings.
ms_my: Hubungi pengurus rakan kongsi {platform_name} anda untuk mengemas kini tetapan ini.

source: Enrollment End Time
ms_my: Masa Tamat Pendaftaran

source: Upgrade Deadline Date
ms_my: Tarikh Akhir Naik Taraf

source: Last day students can upgrade to a verified enrollment.
ms_my: Pelajar hari terakhir boleh menaik taraf kepada pendaftaran yang disahkan.

source: Upgrade Deadline Time
ms_my: Naik taraf Masa Tarikh Akhir

source: Course Details
ms_my: Butiran Kursus

source: Provide useful information about your course
ms_my: Berikan maklumat berguna tentang kursus anda

source: Identify the course language here. This is used to assist users find courses that are taught in a specific language. It is also used to localize the 'From:' field in bulk emails.
ms_my: Kenal pasti bahasa kursus di sini. Ini digunakan untuk membantu pengguna mencari kursus yang diajar dalam bahasa tertentu. Ia juga digunakan untuk menyetempatkan medan 'Daripada:' dalam e-mel pukal.

source: Introducing Your Course
ms_my: Memperkenalkan Kursus Anda

source: Information for prospective students
ms_my: Maklumat untuk bakal pelajar

source: Course Title
ms_my: Tajuk kursus

source: Displayed as title on the course details page. Limit to 50 characters.
ms_my: Dipaparkan sebagai tajuk pada halaman butiran kursus. Hadkan kepada 50 aksara.

source: Course Subtitle
ms_my: Sarikata Kursus

source: Displayed as subtitle on the course details page. Limit to 150 characters.
ms_my: Dipaparkan sebagai sari kata pada halaman butiran kursus. Had kepada 150 aksara.

source: Course Duration
ms_my: Tempoh Kursus

source: Displayed on the course details page. Limit to 50 characters.
ms_my: Dipaparkan pada halaman butiran kursus. Hadkan kepada 50 aksara.

source: Course Description
ms_my: Penerangan Kursus

source: Displayed on the course details page. Limit to 1000 characters.
ms_my: Dipaparkan pada halaman butiran kursus. Hadkan kepada 1000 aksara.

source: Course Short Description
ms_my: Penerangan Pendek Kursus

source: Course Overview
ms_my: Gambaran Keseluruhan Kursus

source: HTML Code Editor
ms_my: Editor Kod HTML

source: Introductions, prerequisites, FAQs that are used on {a_link_start}your course summary page{a_link_end} (formatted in HTML)
ms_my: Pengenalan, prasyarat, Soalan Lazim yang digunakan pada {a_link_start}halaman ringkasan kursus anda{a_link_end} (diformat dalam HTML)

source: Course About Sidebar HTML
ms_my: Kursus Mengenai HTML Sidebar

source: Custom sidebar content for {a_link_start}your course summary page{a_link_end} (formatted in HTML)
ms_my: Kandungan bar sisi tersuai untuk {a_link_start}halaman ringkasan kursus anda{a_link_end} (diformatkan dalam HTML)

source: Course Card Image
ms_my: Imej Kad Kursus

source: You can manage this image along with all of your other {a_link_start}files and uploads{a_link_end}
ms_my: Anda boleh mengurus imej ini bersama-sama dengan semua {a_link_start}fail dan muat naik{a_link_end} anda yang lain

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ms_my: Kursus anda pada masa ini tidak mempunyai imej. Sila muat naik satu (format JPEG atau PNG dan dimensi minimum yang dicadangkan ialah 375px lebar dengan 200px tinggi)

source: Your course image URL
ms_my: URL imej kursus anda

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
ms_my: Sila berikan laluan dan nama yang sah kepada imej kursus anda (Nota: hanya format JPEG atau PNG yang disokong)

source: Upload Course Card Image
ms_my: Muat Naik Imej Kad Kursus

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 1440px wide by 400px tall)
ms_my: Kursus anda pada masa ini tidak mempunyai imej. Sila muat naik satu (format JPEG atau PNG dan dimensi minimum yang dicadangkan ialah 1440px lebar dengan 400px tinggi)

source: Your banner image URL
ms_my: URL imej sepanduk anda

source: Please provide a valid path and name to your banner image (Note: only JPEG or PNG format supported)
ms_my: Sila berikan laluan dan nama yang sah kepada imej sepanduk anda (Nota: hanya format JPEG atau PNG yang disokong)

source: Upload Course Banner Image
ms_my: Muat Naik Imej Sepanduk Kursus

source: Video Thumbnail Image
ms_my: Imej Lakaran Kecil Video

source: Your course currently does not have a video thumbnail image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ms_my: Kursus anda pada masa ini tidak mempunyai imej lakaran kecil video. Sila muat naik satu (format JPEG atau PNG dan dimensi minimum yang dicadangkan ialah 375px lebar dengan 200px tinggi)

source: Your video thumbnail image URL
ms_my: URL imej kecil video anda

source: Please provide a valid path and name to your video thumbnail image (Note: only JPEG or PNG format supported)
ms_my: Sila berikan laluan dan nama yang sah kepada imej lakaran kecil video anda (Nota: hanya format JPEG atau PNG yang disokong)

source: Upload Video Thumbnail Image
ms_my: Muat Naik Imej Lakaran Kecil Video

source: Course Introduction Video
ms_my: Video Pengenalan Kursus

source: Delete Current Video
ms_my: Padamkan Video Semasa

source: your YouTube video's ID
ms_my: ID video YouTube anda

source: Enter your YouTube video's ID (along with any restriction parameters)
ms_my: Masukkan ID video YouTube anda (bersama-sama dengan sebarang parameter sekatan)

source: Learning Outcomes
ms_my: Hasil Pembelajaran

source: Add the learning outcomes for this course
ms_my: Tambah hasil pembelajaran untuk kursus ini

source: Add Learning Outcome
ms_my: Tambah Hasil Pembelajaran

source: Instructors
ms_my: Pengajar

source: Add details about the instructors for this course
ms_my: Tambah butiran tentang pengajar untuk kursus ini

source: Add Instructor
ms_my: Tambah Pengajar

source: Requirements
ms_my: Keperluan

source: Expectations of the students taking this course
ms_my: Jangkaan pelajar yang mengikuti kursus ini

source: Hours of Effort per Week
ms_my: Waktu Usaha setiap Minggu

source: Time spent on all course work
ms_my: Masa yang dihabiskan untuk semua kerja kursus

source: Prerequisite Course
ms_my: Kursus Prasyarat

source: None
ms_my: tiada

source: Course that students must complete before beginning this course
ms_my: Kursus yang pelajar mesti selesaikan sebelum memulakan kursus ini

source: set pre-requisite course
ms_my: menetapkan kursus pra-syarat

source: Require students to pass an exam before beginning the course.
ms_my: Mewajibkan pelajar lulus peperiksaan sebelum memulakan kursus.

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
ms_my: Anda kini boleh melihat dan mengarang peperiksaan kemasukan kursus anda daripada {link_start}Kerangka Kursus{link_end}.

source: Grade Requirements
ms_my: Keperluan Gred

source: The score student must meet in order to successfully complete the entrance exam.
ms_my: Pelajar skor mesti bertemu untuk berjaya menyelesaikan peperiksaan kemasukan.

source: Course Content License
ms_my: Lesen Kandungan Kursus

source: Select the default license for course content
ms_my: Pilih lesen lalai untuk kandungan kursus

source: How are these settings used?
ms_my: Bagaimanakah tetapan ini digunakan?

source: Your course's schedule determines when students can enroll in and begin a course.
ms_my: Jadual kursus anda menentukan masa pelajar boleh mendaftar dan memulakan kursus.

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
ms_my: Maklumat lain dari halaman ini muncul pada halaman Perihal untuk kursus anda. Maklumat ini termasuk gambaran keseluruhan kursus, imej kursus, video pengenalan dan anggaran keperluan masa. Pelajar menggunakan halaman Perihal untuk memilih kursus baharu untuk diambil.

source: You will be unable to make changes until the errors are resolved. To update these settings go to the {link_start}Proctored Exam Settings page{link_end}.
ms_my: Anda tidak akan dapat membuat perubahan sehingga ralat diselesaikan. Untuk mengemas kini tetapan ini pergi ke {link_start}halaman Tetapan Peperiksaan Terlindung{link_end}.

source: You will be unable to make changes until the following settings are updated on the page below.
ms_my: Anda tidak akan dapat membuat perubahan sehingga tetapan berikut dikemas kini pada halaman di bawah.

source: Your policy changes have been saved.
ms_my: Perubahan dasar anda telah disimpan.

source: There was an error saving your information. Please see below.
ms_my: Terdapat ralat semasa menyimpan maklumat anda. Sila lihat di bawah.

source: Manual Policy Definition
ms_my: Definisi Dasar Manual

source: {strong_start}Warning{strong_end}: Do not modify these policies unless you are familiar with their purpose.
ms_my: {strong_start}Amaran{strong_end}: Jangan ubah suai dasar ini melainkan anda sudah biasa dengan tujuannya.

source: Show Deprecated Settings
ms_my: Tunjukkan Tetapan Dihentikan

source: What do advanced settings do?
ms_my: Apakah yang dilakukan oleh tetapan lanjutan?

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
ms_my: Tetapan lanjutan mengawal fungsi kursus tertentu. Pada halaman ini, anda boleh mengedit dasar manual, iaitu kunci berasaskan JSON dan pasangan nilai yang mengawal tetapan kursus tertentu.

source: Any policies you modify here override all other information you've defined elsewhere in {studio_name}. Do not edit policies unless you are familiar with both their purpose and syntax.
ms_my: Sebarang dasar yang anda ubah suai di sini mengatasi semua maklumat lain yang telah anda tetapkan di tempat lain dalam {studio_name}. Jangan edit dasar melainkan anda biasa dengan tujuan dan sintaksnya.

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (") around the string. Do not use single quotation marks (').
ms_my: {em_start}Nota:{em_end} Apabila anda memasukkan rentetan sebagai nilai dasar, pastikan anda menggunakan tanda petikan berganda (") di sekeliling rentetan. Jangan gunakan tanda petikan tunggal (').

source: Grading Settings
ms_my: Tetapan Penggredan

source: Overall Grade Range
ms_my: Julat Gred Keseluruhan

source: Your overall grading scale for student final grades
ms_my: Skala penggredan keseluruhan anda untuk gred akhir pelajar

source: Add grade
ms_my: Tambah gred

source: Credit Eligibility
ms_my: Kelayakan Kredit

source: Settings for course credit eligibility
ms_my: Tetapan untuk kelayakan kredit kursus

source: Minimum Credit-Eligible Grade:
ms_my: Gred Layak Kredit Minimum:

source: Must be greater than or equal to the course passing grade
ms_my: Mesti lebih besar daripada atau sama dengan gred lulus kursus

source: Grading Rules & Policies
ms_my: Peraturan & Polisi Penggredan

source: Deadlines, requirements, and logistics around grading student work
ms_my: Tarikh akhir, keperluan dan logistik sekitar penggredan kerja pelajar

source: Grace Period on Deadline:
ms_my: Tempoh Tangguh pada Tarikh Akhir:

source: Leeway on due dates
ms_my: Kelonggaran pada tarikh yang ditetapkan

source: Assignment Types
ms_my: Jenis Tugasan

source: Categories and labels for any exercises that are gradable
ms_my: Kategori dan label untuk sebarang latihan yang boleh digredkan

source: New Assignment Type
ms_my: Jenis Tugasan Baharu

source: What can I do on this page?
ms_my: Apa yang boleh saya lakukan di halaman ini?
