Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: USE OF THE APIS, AND THE API CONTENT AND ANY SERVICES OBTAINED FROM OR THROUGH THE APIS, IS AT YOUR OWN RISK. YOUR ACCESS TO OR DOWNLOAD OF INFORMATION, MATERIALS OR DATA THROUGH THE APIS IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM) OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OR USE OF SUCH INFORMATION, MATERIALS OR DATA, UNLESS OTHERWISE EXPRESSLY PROVIDED FOR IN THE {platform_name} PRIVACY POLICY.
ms_my: PENGGUNAAN API, DAN KANDUNGAN API DAN SEBARANG PERKHIDMATAN YANG DIPEROLEHI DARIPADA ATAU MELALUI API, ADALAH ATAS RISIKO ANDA SENDIRI. AKSES ANDA KEPADA ATAU MUAT TURUN MAKLUMAT, BAHAN ATAU DATA MELALUI API ADALAH DI ATAS KEBIJAKAN DAN RISIKO ANDA SENDIRI, DAN ANDA AKAN BERTANGGUNGJAWAB SENDIRI ATAS SEBARANG KEROSAKAN HARTANAH ANDA (TERMASUK SISTEM KOMPUTER ANDA) ATAU KEHILANGAN DATA DARI PIHAK KAMI. BAHAN ATAU DATA, KECUALI DIBERIKAN DENGAN NYATA DALAM DASAR PRIVASI {platform_name}.

source: TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, YOU AGREE THAT NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL BE LIABLE TO YOU FOR ANY LOSS OR DAMAGES, EITHER ACTUAL OR CONSEQUENTIAL, ARISING OUT OF OR RELATING TO THE TERMS, OR YOUR (OR ANY THIRD PARTY'S) USE OF OR INABILITY TO USE THE APIS OR ANY API CONTENT, OR YOUR RELIANCE UPON INFORMATION OBTAINED FROM OR THROUGH THE APIS, WHETHER YOUR CLAIM IS BASED IN CONTRACT, TORT, STATUTORY OR OTHER LAW.
ms_my: SEJAUH YANG DIBENARKAN OLEH UNDANG-UNDANG YANG BERKENAAN, ANDA BERSETUJU BAHAWA MANA-MANA ​​PESERTA {platform_name} MAUPUN MANA-MANA ​​PESERTA {platform_name} AKAN BERTANGGUNGJAWAB KEPADA ANDA ATAS SEBARANG KEHILANGAN ATAU KEROSAKAN, SAMA ADA SEBENAR ATAU AKIBAT, YANG TIMBUL DARIPADA ANDA (BERKAITAN DENGAN ANDA PENGGUNAAN ATAU KETIDAKPAYAAN PIHAK UNTUK MENGGUNAKAN API ATAU SEBARANG KANDUNGAN API, ATAU KEPERCAYAAN ANDA TERHADAP MAKLUMAT YANG DIPEROLEHI DARIPADA ATAU MELALUI API, SAMA ADA TUNTUTAN ANDA BERASASKAN DALAM KONTRAK, TORT, BERKANUN ATAU UNDANG-UNDANG LAIN.

source: IN PARTICULAR, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL HAVE ANY LIABILITY FOR ANY CONSEQUENTIAL, INDIRECT, PUNITIVE, SPECIAL, EXEMPLARY OR INCIDENTAL DAMAGES, WHETHER FORESEEABLE OR UNFORESEEABLE AND WHETHER OR NOT {platform_name} OR ANY OF THE {platform_name} PARTICIPANTS HAS BEEN NEGLIGENT OR OTHERWISE AT FAULT (INCLUDING, BUT NOT LIMITED TO, CLAIMS FOR DEFAMATION, ERRORS, LOSS OF PROFITS, LOSS OF DATA OR INTERRUPTION IN AVAILABILITY OF DATA).
ms_my: KHUSUSNYA, SEJAUH YANG DIBENARKAN OLEH UNDANG-UNDANG YANG BERKENAAN, MANA-MANA ​​PESERTA {platform_name} MAUPUN MANA-MANA ​​PESERTA {platform_name} AKAN MEMPUNYAI SEBARANG LIABILITI UNTUK SEBARANG AKIBAT, TIDAK LANGSUNG, MENGHUKUM, KHAS, TEladan ATAU SAMPINGAN, SECARA SAMPINGAN TIDAK DAPAT DIJANGKA DAN SAMA ADA ATAU {platform_name} ATAU MANA-MANA ​​PESERTA {platform_name} CUAI ATAU SEBALIKNYA BERSALAH (TERMASUK, TETAPI TIDAK TERHAD KEPADA, TUNTUTAN FITNAH, KESILAPAN, KEHILANGAN KEUNTUNGAN ATAU KEHILANGAN KESILAPAN).

source: CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MIGHT HAVE ADDITIONAL RIGHTS.
ms_my: UNDANG-UNDANG NEGERI TERTENTU TIDAK MEMBENARKAN HAD KE ATAS WARANTI TERSIRAT ATAU PENGECUALIAN ATAU HAD KEROSAKAN TERTENTU. JIKA UNDANG-UNDANG INI TERPAKAI KEPADA ANDA, SEBAHAGIAN ATAU SEMUA PENAFIAN, PENGECUALIAN ATAU HAD DI ATAS MUNGKIN TIDAK TERPAKAI KEPADA ANDA, DAN ANDA MUNGKIN MEMPUNYAI HAK TAMBAHAN.

source: The APIs and API Content may include hyperlinks to sites maintained or controlled by others and not affiliated with or under the control of {platform_name}. {platform_name_capitalized} and the {platform_name} Participants are not responsible for and do not routinely screen, approve, review or endorse the contents of or use of any of the products or services that may be offered at these third-party sites. If you decide to access linked third-party websites, you do so at your own risk.
ms_my: API dan Kandungan API mungkin termasuk hiperpautan ke tapak yang diselenggara atau dikawal oleh orang lain dan tidak bergabung dengan atau di bawah kawalan {platform_name}. {platform_name_capitalized} dan {platform_name} Peserta tidak bertanggungjawab dan tidak kerap menyaring, meluluskan, menyemak atau menyokong kandungan atau penggunaan mana-mana produk atau perkhidmatan yang mungkin ditawarkan di tapak pihak ketiga ini. Jika anda memutuskan untuk mengakses tapak web pihak ketiga yang dipautkan, anda berbuat demikian atas risiko anda sendiri.

source: To the maximum extent permitted by applicable law, you agree to defend, hold harmless and indemnify {platform_name} and the {platform_name} Participants, and their respective subsidiaries, affiliates, officers, faculty, students, fellows, governing board members, agents and employees from and against any third-party claims, actions or demands arising out of, resulting from or in any way related to your use of the APIs and any API Content, including any liability or expense arising from any and all claims, losses, damages (actual and consequential), suits, judgments, litigation costs and attorneys' fees, of every kind and nature. In such a case, {platform_name} or one of the {platform_name} Participants will provide you with written notice of such claim, action or demand.
ms_my: Setakat maksimum yang dibenarkan oleh undang-undang yang terpakai, anda bersetuju untuk mempertahankan, tidak memudaratkan dan menanggung rugi {platform_name} dan {platform_name} Peserta, dan anak syarikat masing-masing, sekutu, pegawai, fakulti, pelajar, felo, ahli lembaga pentadbir, ejen dan pekerja daripada dan terhadap mana-mana tuntutan, tindakan atau tuntutan pihak ketiga yang berpunca daripada atau dalam apa-apa cara API anda, termasuk hasil daripada penggunaan API anda, hasil daripada penggunaan API anda. sebarang liabiliti atau perbelanjaan yang timbul daripada mana-mana dan semua tuntutan, kerugian, ganti rugi (sebenar dan berbangkit), saman, penghakiman, kos litigasi dan yuran peguam, dalam setiap jenis dan sifat. Dalam kes sedemikian, {platform_name} atau salah seorang daripada {platform_name} Peserta akan memberikan anda notis bertulis mengenai tuntutan, tindakan atau tuntutan tersebut.

source: General Legal Terms
ms_my: Syarat Undang-undang Am

source: The Terms constitute the entire agreement between you and {platform_name} with respect to your use of the APIs and API Content, superseding any prior agreements between you and {platform_name} regarding your use of the APIs and API Content. The failure of {platform_name} to exercise or enforce any right or provision of the Terms shall not constitute a waiver of such right or provision. If any provision of the Terms is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties' intentions as reflected in the provision and the other provisions of the Terms shall remain in full force and effect. The Terms do not create any third party beneficiary rights or any agency, partnership, or joint venture. For any notice provided to you by {platform_name} under these Terms, {platform_name} may notify you via the email address associated with your {platform_name} account.
ms_my: Syarat ini membentuk keseluruhan perjanjian antara anda dan {platform_name} berkenaan dengan penggunaan API dan Kandungan API anda, menggantikan sebarang perjanjian terdahulu antara anda dan {platform_name} berkenaan penggunaan API dan Kandungan API anda. Kegagalan {platform_name} untuk melaksanakan atau menguatkuasakan mana-mana hak atau peruntukan Syarat tidak akan menjadi penepian hak atau peruntukan tersebut. Jika mana-mana peruntukan Terma didapati oleh mahkamah yang mempunyai bidang kuasa berwibawa sebagai tidak sah, pihak-pihak bagaimanapun bersetuju bahawa mahkamah harus berusaha untuk melaksanakan niat pihak-pihak seperti yang ditunjukkan dalam peruntukan tersebut dan peruntukan lain Terma akan kekal berkuat kuasa dan berkesan sepenuhnya. Terma tidak mewujudkan sebarang hak benefisiari pihak ketiga atau mana-mana agensi, perkongsian atau usaha sama. Untuk sebarang notis yang diberikan kepada anda oleh {platform_name} di bawah Syarat ini, {platform_name} boleh memberitahu anda melalui alamat e-mel yang dikaitkan dengan akaun {platform_name} anda.

source: You agree that the Terms, the APIs, and any claim or dispute arising out of or relating to the Terms or the APIs will be governed by the laws of the Commonwealth of Massachusetts, excluding its conflicts of law provisions. You agree that all such claims and disputes will be heard and resolved exclusively in the federal or state courts located in and serving Cambridge, Massachusetts, U.S.A. You consent to the personal jurisdiction of those courts over you for this purpose, and you waive and agree not to assert any objection to such proceedings in those courts (including any defense or objection of lack of proper jurisdiction or venue or inconvenience of forum). Notwithstanding the foregoing, you agree that {platform_name} shall still be allowed to apply for injunctive remedies (or an equivalent type of urgent legal relief) in any jurisdiction.
ms_my: Anda bersetuju bahawa Syarat, API dan sebarang tuntutan atau pertikaian yang timbul daripada atau berkaitan dengan Syarat atau API akan dikawal oleh undang-undang Komanwel Massachusetts, tidak termasuk percanggahan peruntukan undang-undangnya. Anda bersetuju bahawa semua tuntutan dan pertikaian sedemikian akan didengar dan diselesaikan secara eksklusif di mahkamah persekutuan atau negeri yang terletak di dan berkhidmat di Cambridge, Massachusetts, A.S.A. Anda bersetuju dengan bidang kuasa peribadi mahkamah tersebut ke atas anda untuk tujuan ini, dan anda mengetepikan dan bersetuju untuk tidak menegaskan apa-apa bantahan terhadap prosiding tersebut di mahkamah tersebut (termasuk sebarang pembelaan atau bantahan atas kekurangan bidang kuasa atau forum yang sepatutnya). Walau apa pun perkara di atas, anda bersetuju bahawa {platform_name} masih dibenarkan untuk memohon remedi injunksi (atau jenis pelepasan undang-undang segera yang setara) dalam mana-mana bidang kuasa.

source: Termination
ms_my: Penamatan

source: You may stop using the APIs at any time. You agree that {platform_name}, in its sole discretion and at any time, may terminate your use of the APIs or any API Content for any reason or no reason, without prior notice or liability.
ms_my: Anda boleh berhenti menggunakan API pada bila-bila masa. Anda bersetuju bahawa {platform_name}, mengikut budi bicara mutlaknya dan pada bila-bila masa, boleh menamatkan penggunaan API anda atau mana-mana Kandungan API atas sebarang sebab atau tanpa sebab, tanpa notis atau liabiliti terlebih dahulu.

source: {platform_name_capitalized} and the {platform_name} Participants reserve the right at any time in their sole discretion to cancel, delay, reschedule or alter the format of any API or API Content offered through {platform_name}, or to cease providing any part or all of the APIs or API Content or related services, and you agree that neither {platform_name} nor any of the {platform_name} Participants will have any liability to you for such an action.
ms_my: {platform_name_capitalized} dan {platform_name} Peserta berhak pada bila-bila masa mengikut budi bicara mutlak mereka untuk membatalkan, menangguhkan, menjadualkan semula atau mengubah format mana-mana API atau Kandungan API yang ditawarkan melalui {platform_name}, atau berhenti menyediakan mana-mana bahagian atau semua API atau Kandungan API atau perkhidmatan yang berkaitan, dan anda bersetuju bahawa tiada {platform_name_name} pun tidak akan mempunyai sebarang {platform_name} liabiliti kepada anda untuk tindakan sedemikian.

source: Upon any termination of the Terms or discontinuation of your access to an API for any reason, your right to use any API and API Content will immediately cease. You will immediately stop using the APIs and delete any cached or stored API Content from Your Application and your networks, systems and servers as soon as reasonably possible. All provisions of the Terms that by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, and limitations of liability. Termination of your access to and use of the APIs and API Content shall not relieve you of any obligations arising or accruing prior to such termination or limit any liability that you otherwise may have to {platform_name}, including without limitation any indemnification obligations contained herein.
ms_my: Selepas sebarang penamatan Syarat atau pemberhentian akses anda kepada API atas sebarang sebab, hak anda untuk menggunakan mana-mana API dan Kandungan API akan dihentikan serta-merta. Anda akan segera berhenti menggunakan API dan memadamkan sebarang Kandungan API yang dicache atau disimpan daripada Aplikasi Anda dan rangkaian, sistem dan pelayan anda secepat mungkin. Semua peruntukan Syarat yang mengikut sifatnya harus bertahan dengan penamatan akan kekal dalam penamatan, termasuk, tanpa had, peruntukan pemilikan, penafian waranti, dan had liabiliti. Penamatan akses anda kepada dan penggunaan API dan Kandungan API tidak akan melepaskan anda daripada sebarang kewajipan yang timbul atau terakru sebelum penamatan tersebut atau mengehadkan sebarang liabiliti yang anda mungkin ada pada {platform_name}, termasuk tanpa had sebarang kewajipan ganti rugi yang terkandung di sini.

source: Download CSV
ms_my: Muat turun CSV

source: Delete this catalog
ms_my: Padam katalog ini

source: Update Catalog
ms_my: Kemas kini Katalog

source: Catalogs for {username}
ms_my: Katalog untuk {username}

source: Create new catalog:
ms_my: Buat katalog baharu:

source: Create Catalog
ms_my: Buat Katalog

source: Catalog search
ms_my: Carian katalog

source: Catalog Search
ms_my: Carian Katalog

source: Enter a username to view catalogs belonging to that user.
ms_my: Masukkan nama pengguna untuk melihat katalog milik pengguna tersebut.

source: Unsubscribe
ms_my: Nyahlanggan

source: confirm unsubscribe from {org} {course} emails.
ms_my: sahkan berhenti melanggan e-mel {org} {course}.

source: Note:
ms_my: Nota:

source: You will still receive course emails from other courses you are enrolled in.
ms_my: Anda masih akan menerima e-mel kursus daripada kursus lain yang anda daftarkan.

source: You have successfully unsubscribed from {org} {course} emails.
ms_my: Anda telah berjaya menyahlanggan e-mel {org} {course}.

source: You have not been unsubscribed from {org} {course} emails.
ms_my: Anda belum menyahlanggan e-mel {org} {course}.

source: {link_start}Return to {platform_name}{link_end}
ms_my: {link_start}Kembali ke {platform_name}{link_end}

source: Open Calculator
ms_my: Buka Kalkulator

source: Enter equation
ms_my: Masukkan persamaan

source: Calculator Input Field
ms_my: Medan Input Kalkulator

source: Hints
ms_my: Petunjuk

source: Use the arrow keys to navigate the tips or use the tab key to return to the calculator
ms_my: Gunakan kekunci anak panah untuk menavigasi petua atau gunakan kekunci tab untuk kembali ke kalkulator

source: For detailed information, see {math_link_start}Entering Mathematical and Scientific Expressions{math_link_end} in the {guide_link_start}edX Guide for Students{guide_link_end}.
ms_my: Untuk mendapatkan maklumat terperinci, lihat {math_link_start}Memasukkan Ungkapan Matematik dan Saintifik{math_link_end} dalam {guide_link_start}Panduan edX untuk Pelajar{guide_link_end}.

source: Tips
ms_my: Petua

source: Use parentheses () to make expressions clear. You can use parentheses inside other parentheses.
ms_my: Gunakan kurungan () untuk menjelaskan ungkapan. Anda boleh menggunakan kurungan di dalam kurungan lain.

source: Do not use spaces in expressions.
ms_my: Jangan gunakan ruang dalam ungkapan.

source: For constants, indicate multiplication explicitly (example: 5*c).
ms_my: Untuk pemalar, nyatakan pendaraban secara eksplisit (contoh: 5*c).

source: For affixes, type the number and affix without a space (example: 5c).
ms_my: Untuk imbuhan, taipkan nombor dan imbuhan tanpa ruang (contoh: 5c).

source: For functions, type the name of the function, then the expression in parentheses.
ms_my: Untuk fungsi, taip nama fungsi, kemudian ungkapan dalam kurungan.

source: To Use
ms_my: Untuk Digunakan

source: Type
ms_my: taip

source: Examples
ms_my: Contoh

source: Numbers
ms_my: Nombor

source: Integers
ms_my: Nombor bulat

source: Fractions
ms_my: Pecahan

source: Decimals
ms_my: perpuluhan

source: Operators
ms_my: Operator

source: Constants
ms_my: Pemalar

source: Affixes
ms_my: Imbuhan

source: Percent sign (%)
ms_my: Tanda peratus (%)

source: Basic functions
ms_my: Fungsi asas

source: Trigonometric functions
ms_my: Fungsi trigonometri

source: Scientific notation
ms_my: Notasi saintifik

source: e notation
ms_my: e notasi

source: 1e and the exponent
ms_my: 1e dan eksponen

source: Calculate
ms_my: Kira

source: Result
ms_my: Hasilnya

source: CCX Coach Dashboard
ms_my: Papan Pemuka Jurulatih CCX

source: Name your CCX
ms_my: Namakan CCX anda

source: Create a new Custom Course for {platform_name}
ms_my: Buat Kursus Tersuai baharu untuk {platform_name}

source: Grading Policy
ms_my: Dasar penggredan

source: Batch Enrollment
ms_my: Pendaftaran Batch

source: Student Grades
ms_my: Gred Pelajar

source: Please enter a valid CCX name.
ms_my: Sila masukkan nama CCX yang sah.

source: Email Addresses/Usernames
ms_my: Alamat E-mel/Nama Pengguna

source: Enter one or more email addresses or usernames separated by new lines or commas.
ms_my: Masukkan satu atau lebih alamat e-mel atau nama pengguna yang dipisahkan dengan baris atau koma baharu.

source: Make sure you enter the information carefully. You will not receive notification for invalid usernames or email addresses.
ms_my: Pastikan anda memasukkan maklumat dengan teliti. Anda tidak akan menerima pemberitahuan untuk nama pengguna atau alamat e-mel yang tidak sah.

source: Auto Enroll
ms_my: Daftar Auto

source: If this option is {em_start}checked{em_end}, users who have not yet registered for {platform_name} will be automatically enrolled.
ms_my: Jika pilihan ini {em_start}ditandai{em_end}, pengguna yang belum mendaftar untuk {platform_name} akan didaftarkan secara automatik.

source: If this option is left {em_start}unchecked{em_end}, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
ms_my: Jika pilihan ini dibiarkan {em_start}ditandai{em_end}, pengguna yang belum mendaftar untuk {platform_name} tidak akan didaftarkan, tetapi akan dibenarkan untuk mendaftar setelah mereka membuat akaun.

source: Notify users by email
ms_my: Beritahu pengguna melalui e-mel

source: If this option is {em_start}checked{em_end}, users will receive an email notification.
ms_my: Jika pilihan ini {em_start}ditandai{em_end}, pengguna akan menerima pemberitahuan e-mel.

# someone
source: Enroll
ms_my: Daftar

source: Student List Management
ms_my: Pengurusan Senarai Pelajar

source: CCX student list management response message
ms_my: Mesej respons pengurusan senarai pelajar CCX

source: Revoke access
ms_my: Batalkan akses

source: WARNING
ms_my: AMARAN

source: For advanced users only. Errors in the grading policy can lead to the course failing to display. This form does not check the validity of the policy before saving.
ms_my: Untuk pengguna lanjutan sahaja. Ralat dalam dasar penggredan boleh menyebabkan kursus gagal dipaparkan. Borang ini tidak menyemak kesahihan polisi sebelum disimpan.

source: Most coaches should not need to make changes to the grading policy.
ms_my: Kebanyakan jurulatih seharusnya tidak perlu membuat perubahan pada dasar penggredan.

source: Save Grading Policy
ms_my: Dasar Penggredan Simpan

source: Date format four digit year dash two digit month dash two digit day
ms_my: Format tarikh empat digit tahun sempang dua digit bulan sempang dua digit hari

source: Time format two digit hours colon two digit minutes
ms_my: Format masa dua digit jam bertindih dua digit minit

source: Time
ms_my: Masa

source: Set date
ms_my: Tetapkan tarikh

source: You have unsaved changes.
ms_my: Anda mempunyai perubahan yang belum disimpan.

source: There was an error saving changes.
ms_my: Terdapat ralat semasa menyimpan perubahan.

source: Schedule a Unit
ms_my: Jadualkan Unit

source: Start Date
ms_my: Tarikh Mula

source: format four digit year dash two digit month dash two digit day
ms_my: format empat digit tahun sempang dua digit bulan sengkang dua digit hari

source: Start time format two digit hours colon two digit minutes
ms_my: Format masa mula dua digit jam bertindih dua digit minit

source: time
ms_my: masa

source: (Optional)
ms_my: (Pilihan)

source: Due Time format two digit hours colon two digit minutes
ms_my: Format Masa Tamat dua digit jam bertindih dua digit minit

source: Add Unit
ms_my: Tambah Unit

source: Add All Units
ms_my: Tambah Semua Unit

source: All units have been added.
ms_my: Semua unit telah ditambah.

source: View gradebook
ms_my: Lihat buku gred

source: Download student grades
ms_my: Muat turun gred pelajar

source: Print or share your certificate:
ms_my: Cetak atau kongsi sijil anda:

source: Post on Facebook
ms_my: Siarkan di Facebook

source: Share on Twitter
ms_my: Kongsi di Twitter

source: Tweet this Accomplishment. Pop up window.
ms_my: Tweet Pencapaian ini. Tetingkap timbul.

source: Add to LinkedIn Profile
ms_my: Tambahkan pada Profil LinkedIn

source: Add to Mozilla Backpack
ms_my: Tambahkan ke Mozilla Backpack

source: Print Certificate
ms_my: Cetak Sijil

source: {platform_name} Home
ms_my: Rumah {platform_name}.

source: Noted by
ms_my: Dicatat oleh

source: Supported by the following organizations
ms_my: Disokong oleh organisasi berikut

source: Awarded to:
ms_my: Dianugerahkan kepada:

source: For tips and tricks on printing your certificate, view the {link_start}Web Certificates help documentation{link_end}.
ms_my: Untuk petua dan kiat tentang mencetak sijil anda, lihat {link_start}dokumentasi bantuan Sijil Web{link_end}.

source: Cannot Find Certificate
ms_my: Tidak Dapat Mendapatkan Sijil

source: We cannot find a certificate with this URL or ID number. If you are trying to validate a certificate, make sure that the URL or ID number is correct. If you are sure that the URL or ID number is correct, contact support.
ms_my: Kami tidak dapat mencari sijil dengan URL atau nombor ID ini. Jika anda cuba mengesahkan sijil, pastikan URL atau nombor ID adalah betul. Jika anda pasti bahawa URL atau nombor ID adalah betul, hubungi sokongan.

source: Invalid Certificate Configuration.
ms_my: Konfigurasi Sijil Tidak Sah.

source: There is a problem with this certificate.
ms_my: Terdapat masalah dengan sijil ini.

source: To resolve the problem, your partner manager should verify that the following information is correct.
ms_my: Untuk menyelesaikan masalah, pengurus rakan kongsi anda harus mengesahkan bahawa maklumat berikut adalah betul.

source: The institution's logo.
ms_my: Logo institusi.

source: The institution that is linked to the course.
ms_my: Institusi yang dikaitkan dengan kursus.

source: The course information in the Course Administration tool.
ms_my: Maklumat kursus dalam alat Pentadbiran Kursus.
