Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: If all of the information is correct and the problem persists, contact technical support.
ms_my: Jika semua maklumat adalah betul dan masalah berterusan, hubungi sokongan teknikal.

source: URL Not Supported
ms_my: URL Tidak Disokong

source: This link is no longer valid. But don’t worry—this Verified Certificate is still valid and available to share. If this is your certificate, please visit your dashboard to get a new shareable link. If you're viewing someone else's certificate, please contact them to get an updated link.
ms_my: Pautan ini tidak lagi sah. Tetapi jangan risau—Sijil Disahkan ini masih sah dan tersedia untuk dikongsi. Jika ini sijil anda, sila lawati papan pemuka anda untuk mendapatkan pautan baharu yang boleh dikongsi. Jika anda melihat sijil orang lain, sila hubungi mereka untuk mendapatkan pautan yang dikemas kini.

source: Unable to enroll in {course_name}
ms_my: Tidak dapat mendaftar dalam {course_name}

source: Sorry, we were unable to enroll you in
ms_my: Maaf, kami tidak dapat mendaftarkan anda

source: Explore all courses on edX
ms_my: Terokai semua kursus di edX

source: Explore all courses
ms_my: Terokai semua kursus

source: Showcase a {link_start}verified certificate{link_end} of completion on your resumé to advance your career
ms_my: Pamerkan {link_start}sijil yang disahkan{link_end} penyiapan pada resume anda untuk memajukan kerjaya anda

source: Get {start_bold}access to all course activities{end_bold}, including both graded and non-graded assignments, while the course is running
ms_my: Pamerkan {link_start}sijil yang disahkan{link_end} penyiapan pada resume anda untuk memajukan kerjaya anda

source: Show more
ms_my: Tunjukkan lagi

source: {start_bold}Full access{end_bold} to course content and materials, even after the course ends
ms_my: {start_bold}Akses penuh{end_bold} kepada kandungan dan bahan kursus, walaupun selepas kursus tamat

source: {link_start}Learn more{link_end} about course access
ms_my: {link_start}Ketahui lebih lanjut{link_end} tentang akses kursus

source: Support our {start_bold}mission{end_bold} to increase access to high-quality education for everyone, everywhere
ms_my: Sokong {start_bold}misi{end_bold} kami untuk meningkatkan akses kepada pendidikan berkualiti tinggi untuk semua orang, di mana-mana sahaja

source: Get temporary access to {start_bold}non-graded{end_bold} activities, including discussion forums and non-graded assignments
ms_my: Dapatkan akses sementara kepada aktiviti {start_bold}tidak digred{end_bold}, termasuk forum perbincangan dan tugasan tidak digred

source: Get {start_bold}temporary access{end_bold} to the course material, including videos and readings
ms_my: Dapatkan {start_bold}akses sementara{end_bold} kepada bahan kursus, termasuk video dan bacaan

source: Access expires and all progress will be lost on
ms_my: Akses tamat tempoh dan semua kemajuan akan hilang pada

source: Access expires and all progress will be lost
ms_my: Akses tamat tempoh dan semua kemajuan akan hilang

source: Enroll In {course_name} | Upgrade Now
ms_my: Daftar Dalam {course_name} | Tingkatkan Sekarang

source: Choose a path for your course in
ms_my: Pilih laluan untuk kursus anda

source: Earn a certificate
ms_my: Dapatkan sijil

source: Studies show that those who choose this option are {start_bold}more engaged and motivated{end_bold} to complete their courses
ms_my: Kajian menunjukkan bahawa mereka yang memilih pilihan ini {start_bold}lebih terlibat dan bermotivasi{end_bold} untuk menyelesaikan kursus mereka

source: Access this course
ms_my: Akses kursus ini

source: Get access to the course material, including videos and readings
ms_my: Dapatkan akses kepada bahan kursus, termasuk video dan bacaan

source: {chapter} current chapter
ms_my: {chapter} bab semasa

source: {span_start}current section{span_end}
ms_my: {span_start}bahagian semasa{span_end}

source: due {date}
ms_my: tarikh akhir {date}

source: {section_format} due {{date}}
ms_my: {section_format} tarikh akhir {{tarikh}}

source: This content is graded
ms_my: Kandungan ini dinilai

source: An error occurred. Please try again later.
ms_my: Ralat berlaku. Sila cuba lagi kemudian.

source: You are enrolled in this course
ms_my: Anda telah mendaftar dalam kursus ini

source: View Course
ms_my: Lihat Kursus

source: Enrollment in this course is by invitation only
ms_my: Pendaftaran kursus ini adalah melalui jemputan sahaja

source: Enrollment is Closed
ms_my: Pendaftaran Ditutup

source: Enroll Now
ms_my: Daftar Sekarang

source: View About Page in studio
ms_my: Lihat Halaman Perihal di studio

source: Classes Start
ms_my: Kelas Bermula

source: Classes End
ms_my: Kelas Tamat

source: Estimated Effort
ms_my: Anggaran Usaha

source: Prerequisites
ms_my: Prasyarat

source: You must successfully complete {link_start}{prc_display}{link_end} before you begin this course.
ms_my: Anda mesti berjaya melengkapkan {link_start}{prc_display}{link_end} sebelum anda memulakan kursus ini.

source: Additional Resources
ms_my: Sumber Tambahan

# self
source: enroll
ms_my: mendaftar

source: Share with friends and family!
ms_my: Kongsi dengan rakan dan keluarga!

source: I just enrolled in {number} {title} through {account} {url}
ms_my: Saya baru sahaja mendaftar dalam {number} {title} melalui {account} {url}

source: I just enrolled in {number} {title} through {platform} {url}
ms_my: Saya baru sahaja mendaftar dalam {number} {title} melalui {platform} {url}

source: Take a course with {platform} online
ms_my: Ikuti kursus dengan {platform} dalam talian

source: Tweet that you've enrolled in this course
ms_my: Tweet yang anda telah daftarkan dalam kursus ini

source: Post a Facebook message to say you've enrolled in this course
ms_my: Siarkan mesej Facebook untuk menyatakan anda telah mendaftar dalam kursus ini

source: Email someone to say you've enrolled in this course
ms_my: E-mel seseorang untuk memberitahu anda telah mendaftar dalam kursus ini

source: current location
ms_my: lokasi semasa

source: needs attention
ms_my: perlukan perhatian

source: Course Material
ms_my: Bahan Kursus

source: Hide
ms_my: Sembunyi

source: Show
ms_my: Tunjukkan

source: Show Earlier Course Updates
ms_my: Tunjukkan Kemas Kini Kursus Terdahulu

source: List of Courses
ms_my: Senarai Kursus

source: Refine Your Search
ms_my: Perhalusi Carian Anda

source: Course Utilities
ms_my: Utiliti Kursus

source: Courseware
ms_my: Perisian kursus

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible.
ms_my: Harap maaf, modul ini tidak tersedia buat sementara waktu. Kakitangan kami sedang berusaha untuk memperbaikinya secepat mungkin.

source: Course Search
ms_my: Carian Kursus

source: No content has been added to this course
ms_my: Tiada kandungan telah ditambahkan pada kursus ini

source: Gradebook
ms_my: Buku gred

source: Search students
ms_my: Cari pelajar

source: Total
ms_my: Jumlah

source: previous page
ms_my: halaman sebelumnya

source: of
ms_my: daripada

source: next page
ms_my: muka surat seterusnya

source: News - MITx 6.002x
ms_my: Berita - MITx 6.002x

source: Updates to Discussion Posts You Follow
ms_my: Kemas Kini Siaran Perbincangan yang Anda Ikuti

source: Purchase the Program (
ms_my: Beli Program (

source: Original Price
ms_my: Harga Asal

source: Discounted Price
ms_my: Harga Diskaun

source: Start Learning
ms_my: Mula Belajar

source: Play
ms_my: Mula Belajar

source: YouTube Video
ms_my: Video YouTube

source: View Courses
ms_my: Lihat Kursus

source: Meet the Instructors
ms_my: Bertemu Pengajar

source: Frequently Asked Questions
ms_my: Soalan Lazim

source: Job Outlook
ms_my: Tinjauan Kerja

source: Real Career Impact
ms_my: Kesan Kerjaya Sebenar

source: What You'll Learn
ms_my: Apa yang Anda Akan Pelajari

source: Average Length
ms_my: Purata Panjang

source: {weeks_to_complete} weeks per course
ms_my: {weeks_to_complete} minggu setiap kursus

source: Effort
ms_my: usaha

source: {min_hours_effort_per_week}-{max_hours_effort_per_week} hours per week, per course
ms_my: {min_hours_effort_per_week}-{max_hours_effort_per_week} jam seminggu, setiap kursus

source: Number of Courses
ms_my: Bilangan Kursus

source: {number_of_courses} courses in program
ms_my: {number_of_courses} kursus dalam program

source: Price (USD)
ms_my: Harga (USD)

source: ${newPrice}{htmlEnd} for entire program
ms_my: ${newPrice}{htmlEnd} untuk keseluruhan program

source: You save ${discount_value} {currency}
ms_my: Anda menjimatkan ${discount_value} {currency}

source: ${full_program_price} for entire program
ms_my: ${full_program_price} untuk keseluruhan program

source: Courses in the {}
ms_my: Kursus dalam {}

source: Starts on {}
ms_my: Bermula pada {}

source: {course_number} Progress
ms_my: {course_number} Kemajuan

source: View Grading in studio
ms_my: Lihat Penggredan di studio

source: View Certificate
ms_my: Lihat Sijil

source: Opens in a new browser window
ms_my: Dibuka dalam tetingkap penyemak imbas baharu

source: Request Certificate
ms_my: Minta Sijil

source: Requirements for Course Credit
ms_my: Keperluan untuk Kredit Kursus

source: {student_name}, you are no longer eligible for credit in this course.
ms_my: {student_name}, anda tidak lagi layak mendapat kredit dalam kursus ini.

source: {student_name}, you have met the requirements for credit in this course. {a_start}Go to your dashboard{a_end} to purchase course credit.
ms_my: {student_name}, anda telah memenuhi syarat untuk kredit dalam kursus ini. {a_start}Pergi ke papan pemuka anda{a_end} untuk membeli kredit kursus.

source: {student_name}, you have not yet met the requirements for credit.
ms_my: {student_name}, anda masih belum memenuhi syarat untuk kredit.

source: Information about course credit requirements
ms_my: Maklumat tentang keperluan kredit kursus

source: Verification Submitted
ms_my: Pengesahan Diserahkan

source: Verification Failed
ms_my: Pengesahan Gagal

source: Verification Declined
ms_my: Pengesahan Ditolak

source: Completed by {date}
ms_my: Dilengkapkan pada {date}

source: Upcoming
ms_my: Akan datang

source: Less
ms_my: Kurang

source: Details for each chapter
ms_my: Butiran untuk setiap bab

source: {earned} of {total} possible points
ms_my: {earned} daripada {total} mata yang mungkin

source: Suspicious activity detected during proctored exam review. Exam score 0.
ms_my: Aktiviti mencurigakan dikesan semasa semakan peperiksaan terkawal. Markah peperiksaan 0.

source: Section grade has been overridden.
ms_my: Gred bahagian telah dibatalkan.

source: Problem Scores:
ms_my: Markah Masalah:

source: Practice Scores:
ms_my: Markah Latihan:

source: Problem scores are hidden until the due date.
ms_my: Markah masalah disembunyikan sehingga tarikh tamat tempoh.

source: Practice scores are hidden until the due date.
ms_my: Markah latihan disembunyikan sehingga tarikh tamat tempoh.

source: Problem scores are hidden.
ms_my: Markah masalah disembunyikan.

source: Practice scores are hidden.
ms_my: Markah latihan disembunyikan.

source: No problem scores in this section
ms_my: Tiada masalah markah dalam bahagian ini

source: {course.display_number_with_default} Course Info
ms_my: {course.display_number_with_default} Maklumat Kursus

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
ms_my: Anda paling baru berada di {section_link}. Jika anda sudah selesai dengan itu, pilih bahagian lain di sebelah kiri.

source: Hi {name},
ms_my: Hai {name},

source: Hi,
ms_my: Hai,

source: Congratulations! You are now eligible to receive course credit from {providers} for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
ms_my: tahniah! Anda kini layak menerima kredit kursus daripada {providers} kerana berjaya melengkapkan kursus {platform_name} anda! {link_start}Beli kredit sekarang.{link_end}

source: Congratulations! You are now eligible to receive course credit for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
ms_my: tahniah! Anda kini layak menerima kredit kursus kerana berjaya melengkapkan kursus {platform_name} anda! {link_start}Beli kredit sekarang.{link_end}

source: Course credit can help you get a jump start on your university degree, finish a degree already started, or fulfill requirements at a different academic institution.
ms_my: Kredit kursus boleh membantu anda mendapatkan permulaan yang tinggi pada ijazah universiti anda, menamatkan ijazah yang telah dimulakan, atau memenuhi keperluan di institusi akademik yang berbeza.

source: There are 2 steps to getting course credit.
ms_my: Terdapat 2 langkah untuk mendapatkan kredit kursus.

source: Purchase credit by going to your {link_start}{platform_name} dashboard{link_end} and clicking the {bold_start}Get Credit{bold_end} button below the course title.
ms_my: Beli kredit dengan pergi ke papan pemuka {link_start}{platform_name} anda{link_end} dan mengklik butang {bold_start}Dapatkan Kredit{bold_end} di bawah tajuk kursus.

source: When your payment is complete, return to the dashboard and click the {bold_start}Request Credit{bold_end} button under the course title to request an official academic transcript at the institution that granted the credit.
ms_my: Apabila pembayaran anda selesai, kembali ke papan pemuka dan klik butang {bold_start}Minta Kredit{bold_end} di bawah tajuk kursus untuk meminta transkrip akademik rasmi di institusi yang memberikan kredit.

source: We hope you enjoyed the course, and we hope to see you in future {platform_name} courses!
ms_my: Kami harap anda menikmati kursus ini dan kami berharap dapat berjumpa anda dalam kursus {platform_name} akan datang!

source: The {platform_name} Team
ms_my: Pasukan {platform_name}.

source: {link_start}Click here for more information on credit at {platform_name}{link_end}.
ms_my: {link_start}Klik di sini untuk mendapatkan maklumat lanjut tentang kredit di {platform_name}{link_end}.

source: Your grade and certificate will be ready after {date}.
ms_my: Gred dan sijil anda akan disediakan selepas {date}.

source: Congratulations! Your certificate is ready.
ms_my: tahniah! Sijil anda sudah sedia.

source: Grade required for a {cert_name_short}:
ms_my: Gred diperlukan untuk {cert_name_short}:

source: Grade required to pass this course:
ms_my: Gred yang diperlukan untuk lulus kursus ini:

source: Your verified {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}. If you would like a refund on your {cert_name_long}, please contact our billing address {billing_email}
ms_my: {cert_name_long} anda yang disahkan sedang ditahan sementara menunggu pengesahan bahawa pengeluaran {cert_name_short} anda mematuhi sekatan ketat A.S. ke atas Iran, Cuba, Syria dan Sudan. Jika anda fikir sistem kami telah tersilap mengenal pasti anda sebagai berkaitan dengan salah satu negara tersebut, sila maklumkan kepada kami dengan menghubungi {email}. Jika anda ingin bayaran balik pada {cert_name_long} anda, sila hubungi alamat pengebilan kami {billing_email}

source: Your {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
ms_my: {cert_name_long} anda ditahan sementara menunggu pengesahan bahawa pengeluaran {cert_name_short} anda mematuhi sekatan ketat A.S. ke atas Iran, Cuba, Syria dan Sudan. Jika anda fikir sistem kami telah tersilap mengenal pasti anda sebagai berkaitan dengan salah satu negara tersebut, sila maklumkan kepada kami dengan menghubungi {email}.

source: Your certificate was not issued because you do not have a current verified identity with {platform_name}.
ms_my: Sijil anda tidak dikeluarkan kerana anda tidak mempunyai identiti semasa yang disahkan dengan {platform_name}.

source: Your {cert_name_short} is Generating
ms_my: {cert_name_short} anda sedang Menjana

source: This link will open the certificate web view
ms_my: Pautan ini akan membuka paparan web sijil

source: View my {cert_name_short}
ms_my: Lihat {cert_name_short} saya

source: Complete our course feedback survey
ms_my: Lengkapkan tinjauan maklum balas kursus kami

source: Add Certificate to LinkedIn Profile
ms_my: Tambahkan Sijil pada Profil LinkedIn

source: Share on LinkedIn
ms_my: Kongsi di LinkedIn

source: You are not yet eligible for a certificate.
ms_my: Anda belum layak mendapat sijil.

source: This link will open the course progress page
ms_my: Pautan ini akan membuka halaman kemajuan kursus

source: View grades
ms_my: Lihat gred

source: Course details
ms_my: Butiran kursus

source: {course_number} {course_name} Home Page
ms_my: {course_number} {course_name} Halaman Utama

source: {course_number} {course_name} Cover Image
ms_my: Imej Muka Depan {course_number} {course_name}.

source: Enrolled as:
ms_my: Didaftarkan sebagai:

source: Coming Soon
ms_my: Akan Datang

source: Ended - {date}
ms_my: Tamat - {date}

source: Started - {date}
ms_my: Bermula - {date}

source: Starts - {date}
ms_my: Bermula - {date}

source: for {course_display_name}
ms_my: untuk {course_display_name}

source: You must select a session by {expiration_date} to access the course.
ms_my: Anda mesti memilih sesi sebelum {expired_date} untuk mengakses kursus.

source: You must select a session to access the course.
ms_my: Anda mesti memilih sesi untuk mengakses kursus.

source: Change or Leave Session
ms_my: Sesi Tukar atau Cuti

source: You can no longer change sessions.
ms_my: Anda tidak boleh menukar sesi lagi.

source: You can change sessions until {entitlement_expiration_date}.
ms_my: Anda boleh menukar sesi sehingga {entitlement_expired_date}.

source: I'm taking {course_name} online with {facebook_brand}. Check it out!
ms_my: Saya mengambil {course_name} dalam talian dengan {facebook_brand}. Semak ia keluar!

source: Share {course_name} on Facebook
ms_my: Kongsi {course_name} di Facebook

source: Share on Facebook
ms_my: Kongsi di Facebook

source: I'm taking {course_name} online with {twitter_brand}. Check it out!
ms_my: Saya mengambil {course_name} dalam talian dengan {twitter_brand}. Semak ia keluar!

source: Share {course_name} on Twitter
ms_my: Kongsi {course_name} di Twitter

source: Course options for
ms_my: Pilihan kursus untuk

source: Available Actions
ms_my: Tindakan yang Tersedia

source: You are enrolled by your institution and you should reach out to your institution to drop this course.
ms_my: Anda didaftarkan oleh institusi anda dan anda harus menghubungi institusi anda untuk menggugurkan kursus ini.

source: Email Settings
ms_my: Tetapan E-mel

source: View Archived Course
ms_my: Lihat Kursus Arkib

source: Related Programs
ms_my: Program Berkaitan

source: {start_bold}Get the most out of your course!{end_bold} Upgrade to get full access to the course material, unlock both graded and non-graded assignments, and earn a {link_start}verified certificate{link_end} to showcase on your resumé.
ms_my: {start_bold}Manfaatkan kursus anda sepenuhnya!{end_bold} Naik taraf untuk mendapatkan akses penuh kepada bahan kursus, buka kunci tugasan yang digredkan dan tidak digredkan dan dapatkan {link_start}sijil yang disahkan{link_end} untuk dipamerkan pada resume anda.

source: {start_bold}Get the most out of your course!{end_bold} Upgrade to earn a {link_start}verified certificate{link_end} to showcase on your resumé.
ms_my: {start_bold}Manfaatkan kursus anda sepenuhnya!{end_bold} Tingkatkan untuk memperoleh {link_start}sijil yang disahkan{link_end} untuk dipamerkan pada resume anda.

source: Upgrade
ms_my: Naik taraf

source: Resume Course
ms_my: Sambung semula Kursus

source: You have completed this course and are eligible to purchase course credit. Select {strong_start}Get Credit{strong_end} to get started.
ms_my: Anda telah menamatkan kursus ini dan layak untuk membeli kredit kursus. Pilih {strong_start}Dapatkan Kredit{strong_end} untuk bermula.

source: You are now eligible for credit from {provider}. Congratulations!
ms_my: Anda kini layak mendapat kredit daripada {provider}. tahniah!

source: Get Credit
ms_my: Dapatkan Kredit

source: Thank you for your payment. To receive course credit, you must now request credit at the {link_to_provider_site} website. Select {start_bold}Request Credit{end_bold} to get started.
ms_my: Terima kasih atas pembayaran anda. Untuk menerima kredit kursus, anda kini mesti meminta kredit di tapak web {link_to_provider_site}. Pilih {start_bold}Minta Kredit{end_bold} untuk bermula.

source: Request Credit
ms_my: Minta Kredit

source: {provider_name} has received your course credit request. We will update you when credit processing is complete.
ms_my: {provider_name} telah menerima permintaan kredit kursus anda. Kami akan mengemas kini anda apabila pemprosesan kredit selesai.

source: View Details
ms_my: Lihat Butiran

source: {start_bold}Congratulations!{end_bold} {provider_name} has approved your request for course credit. To see your course credit, visit the {link_to_provider_site} website.
ms_my: {start_bold}Tahniah!{end_bold} {provider_name} telah meluluskan permintaan anda untuk kredit kursus. Untuk melihat kredit kursus anda, lawati tapak web {link_to_provider_site}.

source: View Credit
ms_my: Lihat Kredit

source: {provider_name} did not approve your request for course credit. For more information, contact {link_to_provider_site} directly.
ms_my: {provider_name} tidak meluluskan permintaan anda untuk kredit kursus. Untuk mendapatkan maklumat lanjut, hubungi terus {link_to_provider_site}.

source: An error occurred with this transaction. For help, contact {support_email}.
ms_my: Ralat berlaku dengan transaksi ini. Untuk mendapatkan bantuan, hubungi {support_email}.

source: Course options for {courseName}
ms_my: Pilihan kursus untuk {courseName}

source: Consent to share your data
ms_my: Persetujuan untuk berkongsi data anda

source: To access this course, you must first consent to share your learning achievements with {enterprise_customer_name}.
ms_my: Untuk mengakses kursus ini, anda mesti terlebih dahulu bersetuju untuk berkongsi pencapaian pembelajaran anda dengan {enterprise_customer_name}.

source: View Consent
ms_my: Lihat Persetujuan

source: Could Not Link Accounts
ms_my: Tidak Dapat Memautkan Akaun

source: The {provider_name} account you selected is already linked to another {platform_name} account.
ms_my: Akaun {provider_name} yang anda pilih telah dipautkan ke akaun {platform_name} yang lain.

source: We're sorry to see you go! Read the following statements and rate your level of agreement.
ms_my: Kami kesal melihat anda pergi! Baca pernyataan berikut dan nilaikan tahap persetujuan anda.

source: Price is too high for me
ms_my: Harga terlalu tinggi untuk saya

source: I was not satisfied with my experience taking the courses
ms_my: Saya tidak berpuas hati dengan pengalaman saya mengikuti kursus tersebut

source: Content of the courses was too difficult
ms_my: Kandungan kursus terlalu sukar

source: I did not have enough time to complete the courses
ms_my: Saya tidak mempunyai masa yang cukup untuk menyelesaikan kursus

source: The content was not available when I wanted to start
ms_my: Kandungan tidak tersedia semasa saya ingin memulakan

source: Can we contact you via email for follow up?
ms_my: Bolehkah kami menghubungi anda melalui e-mel untuk tindakan susulan?
