Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: enabled_as_of must be set when enabled is True
ms_my: enabled_as_of mesti ditetapkan apabila didayakan adalah Benar

source: Partition for segmenting users by access to gated content types
ms_my: Pemisahan untuk membahagikan pengguna dengan akses kepada jenis kandungan berpagar

source: Graded assessments are available to Verified Track learners.
ms_my: Penilaian berperingkat tersedia untuk pelajar Track Disahkan.

source: Graded assessments are available to Verified Track learners. Upgrade to Unlock.
ms_my: Penilaian berperingkat tersedia untuk pelajar Track Disahkan. Tingkatkan kepada Buka Kunci.

source: Content available only to verified track learners
ms_my: Kandungan tersedia hanya untuk pelajar trek yang disahkan

source: Verified Track Access
ms_my: Akses Trek Disahkan

source: Upgrade to unlock
ms_my: Tingkatkan untuk membuka kunci

source: Access expired on {expiration_date}
ms_my: Akses tamat tempoh pada {expired_date}

source: Access to {course_name} expired on {expiration_date}
ms_my: Akses kepada {course_name} tamat tempoh pada {expiration_date}

source: Access to the course you were looking for expired on {expiration_date}
ms_my: Akses kepada kursus yang anda cari telah tamat tempoh pada {expiration_date}

source: This learner does not have access to this course. Their access expired on {expiration_date}.
ms_my: Pelajar ini tidak mempunyai akses kepada kursus ini. Akses mereka tamat tempoh pada {expired_date}.

source: {strong_open}Audit Access Expires {expiration_date}{strong_close}{line_break}You lose all access to this course, including your progress, on {expiration_date}.
ms_my: {strong_open}Akses Audit Tamat Tempoh {expiration_date}{strong_close}{line_break}Anda kehilangan semua akses kepada kursus ini, termasuk kemajuan anda, pada {expired_date}.

source: {line_break}Upgrade by {upgrade_deadline} to get unlimited access to the course as long as it exists on the site. {a_open}Upgrade now{sronly_span_open} to retain access past {expiration_date}{span_close}{a_close}
ms_my: {line_break}Tingkatkan selewat-lewatnya pada {upgrade_deadline} untuk mendapatkan akses tanpa had kepada kursus selagi ia wujud di tapak. {a_open}Tingkatkan sekarang{sronly_span_open} untuk mengekalkan akses melepasi {expired_date}{span_close}{a_close}

source: View all dates
ms_my: Lihat semua tarikh

source: Your due dates have been successfully shifted to help you stay on track.
ms_my: Tarikh akhir anda telah berjaya dialihkan untuk membantu anda berada di landasan yang betul.

source: Deadlines successfully reset.
ms_my: Tarikh akhir berjaya ditetapkan semula.

source: Updates
ms_my: Kemas kini

source: These define the context to configure the percentage for the first purchase discount.If multiple contexts apply to a course (for example, if configuration is specified for the course specifically, and for the org that the course is in, then the more specific context overrides the more general context.
ms_my: Ini mentakrifkan konteks untuk mengkonfigurasi peratusan bagi diskaun pembelian pertama. Jika berbilang konteks digunakan pada kursus (contohnya, jika konfigurasi ditentukan untuk kursus secara khusus dan untuk organisasi tempat kursus itu berada, maka konteks yang lebih khusus mengatasi konteks yang lebih umum.

source: CSV File
ms_my: Fail CSV

source: CSV file should have 3 columns having names lms_user_id, course_id, opportunity_id
ms_my: Fail CSV hendaklah mempunyai 3 lajur yang mempunyai nama lms_user_id, course_id, opportunity_id

source: Enrollment attributes were not updated for records at following line numbers in csv because no enrollment found for these records: {error_line_numbers}
ms_my: Atribut pendaftaran tidak dikemas kini untuk rekod pada nombor baris berikut dalam csv kerana tiada pendaftaran ditemui untuk rekod ini: {error_line_numbers}

source: You have access to the {bold_start}{enterprise_name}{bold_end} dashboard. To access the courses available to you through {enterprise_name}, {link_start}visit the {enterprise_name} dashboard{link_end}.
ms_my: Anda mempunyai akses kepada papan pemuka {bold_start}{enterprise_name}{bold_end}. Untuk mengakses kursus yang tersedia untuk anda melalui {enterprise_name}, {link_start}lawati papan pemuka {enterprise_name}{link_end}.

source: Enrollment in {course_title} was not complete.
ms_my: Pendaftaran dalam {course_title} tidak lengkap.

source: If you have concerns about sharing your data, please contact your administrator at {enterprise_customer_name}.
ms_my: Jika anda mempunyai kebimbangan tentang berkongsi data anda, sila hubungi pentadbir anda di {enterprise_customer_name}.

source: Home
ms_my: Rumah

source: Enterprise Course Enrollments
ms_my: Pendaftaran Kursus Perusahaan

source: Override Enrollment Attributes
ms_my: Gantikan Atribut Pendaftaran

source: Upload CSV to override enrollment attributes for learners
ms_my: Muat naik CSV untuk menggantikan atribut pendaftaran untuk pelajar

source: We are sorry, you are not authorized to access {platform_name} via this channel. Please contact your learning administrator or manager in order to access {platform_name}.{line_break}{line_break}Error Details:{line_break}{error_message}
ms_my: Harap maaf, anda tidak dibenarkan mengakses {platform_name} melalui saluran ini. Sila hubungi pentadbir atau pengurus pembelajaran anda untuk mengakses {platform_name}.{line_break}{line_break}Butiran Ralat:{line_break}{error_message}

source: Thank you for joining {platform_name}. Just a couple steps before you start learning!
ms_my: Terima kasih kerana menyertai {platform_name}. Hanya beberapa langkah sebelum anda mula belajar!

source: Continue
ms_my: Teruskan

source: The deadline to complete this assignment has passed.
ms_my: Tarikh akhir untuk menyiapkan tugasan ini telah berlalu.

source: Shift due dates
ms_my: Tukar tarikh tamat tempoh

source: It looks like you missed some important deadlines based on our suggested schedule.
ms_my: Nampaknya anda terlepas beberapa tarikh akhir penting berdasarkan jadual yang kami cadangkan.

source: To keep yourself on track, you can update this schedule and shift the past due assignments into the future. Don’t worry—you won’t lose any of the progress you’ve made when you shift your due dates.
ms_my: Untuk memastikan diri anda berada di landasan yang betul, anda boleh mengemas kini jadual ini dan mengalihkan tugasan yang telah ditetapkan ke masa hadapan. Jangan risau—anda tidak akan kehilangan sebarang kemajuan yang telah anda buat apabila anda mengalih tarikh tamat tempoh anda.

source: Try again ({attempts} attempt remaining)
ms_my: Cuba lagi ({attempts} percubaan lagi)

source: You have used {attempts} of {max_attempts} attempts for this problem.
ms_my: Anda telah menggunakan {attempts} sebanyak {max_attempts} percubaan untuk masalah ini.

source: Try again (unlimited attempts)
ms_my: Cuba lagi (cubaan tanpa had)

source: You have used {attempts} of unlimited attempts for this problem.
ms_my: Anda telah menggunakan {attempts} percubaan tanpa had untuk masalah ini.

source: Sign In
ms_my: Log Masuk

source: Our mailing address is
ms_my: Alamat surat menyurat kami ialah

source: XML data for the annotation
ms_my: Data XML untuk anotasi

source: The display name for this component.
ms_my: Nama paparan untuk komponen ini.

source: Annotation
ms_my: Anotasi

source: Cannot rescore problems with possible file submissions
ms_my: Tidak dapat menilai semula masalah dengan kemungkinan penyerahan fail

source: Question {}
ms_my: Soalan {}

source: Incorrect
ms_my: tak betul

source: Correct
ms_my: Betul

source: correct
ms_my: betul

source: incorrect
ms_my: tak betul

source: partially correct
ms_my: separa betul

source: incomplete
ms_my: tidak lengkap

source: unanswered
ms_my: tak terjawab

source: submitted
ms_my: diserahkan

source: processing
ms_my: pemprosesan

source: This answer is correct.
ms_my: Jawapan ini betul.

source: This answer is incorrect.
ms_my: Jawapan ini tidak betul.

source: This answer is partially correct.
ms_my: Jawapan ini sebahagiannya betul.

source: This answer is being processed.
ms_my: Jawapan ini sedang diproses.

source: Not yet answered.
ms_my: Belum dijawab.

source: Select an option
ms_my: Pilih satu pilihan

source: ChoiceGroup: unexpected tag {tag_name}
ms_my: ChoiceGroup: teg tidak dijangka {tag_name}

source: Answer received.
ms_my: Jawapan diterima.

source: Your files have been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
ms_my: Fail anda telah diserahkan. Sebaik sahaja penyerahan anda digredkan, mesej ini akan digantikan dengan maklum balas penggred.

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
ms_my: Jawapan anda telah diserahkan. Sebaik sahaja penyerahan anda digredkan, mesej ini akan digantikan dengan maklum balas penggred.

source: {programming_language} editor
ms_my: editor {programming_language}.

source: Press ESC then TAB or click outside of the code editor to exit
ms_my: Tekan ESC kemudian TAB atau klik di luar editor kod untuk keluar

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
ms_my: diserahkan. Sebaik sahaja balasan dikembalikan, mesej ini akan digantikan dengan maklum balas tersebut.

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
ms_my: Tiada respons daripada Xqueue dalam masa {xqueue_timeout} saat. Digugurkan.

source: Error running code.
ms_my: Ralat menjalankan kod.

source: Cannot connect to the queue
ms_my: Tidak dapat menyambung ke baris gilir

source: No formula specified.
ms_my: Tiada formula dinyatakan.

source: Couldn't parse formula: {error_msg}
ms_my: Tidak dapat menghuraikan formula: {error_msg}

source: Error while rendering preview
ms_my: Ralat semasa membuat pratonton

source: Sorry, couldn't parse formula
ms_my: Maaf, tidak dapat menghuraikan formula

source: {input_type}: unexpected tag {tag_name}
ms_my: {input_type}: teg tidak dijangka {tag_name}

source: Expected a {expected_tag} tag; got {given_tag} instead
ms_my: Menjangkakan teg {expected_tag}; mendapat {given_tag} sebaliknya

source: Question {index}
ms_my: Soalan {indeks}

source: Correct:
ms_my: Betul:

source: Incorrect:
ms_my: salah:

source: Answer
ms_my: Jawab

source: (Source code line unavailable)
ms_my: (Barisan kod sumber tidak tersedia)

source: See XML source line {sourcenum}.
ms_my: Lihat baris sumber XML {sourcenum}.

source: Checkboxes
ms_my: Kotak semak

source: Multiple Choice
ms_my: Pelbagai Pilihan

source: Do not use shuffle and answer-pool at the same time
ms_my: Jangan gunakan shuffle dan answer-pool pada masa yang sama

source: answer-pool value should be an integer
ms_my: nilai kumpulan jawapan mestilah integer

source: Choicegroup must include at least 1 correct and 1 incorrect choice
ms_my: Kumpulan pilihan mesti memasukkan sekurang-kurangnya 1 pilihan yang betul dan 1 yang salah

source: True/False Choice
ms_my: Pilihan Betul/Salah

source: Dropdown
ms_my: Jatuh turun

source: Numerical Input
ms_my: Input berangka

source: There was a problem with the staff answer to this problem.
ms_my: Terdapat masalah dengan jawapan kakitangan untuk masalah ini.

source: Could not interpret '{student_answer}' as a number.
ms_my: Tidak dapat mentafsir '{student_answer}' sebagai nombor.

source: Factorial function evaluated outside its domain:'{student_answer}'
ms_my: Fungsi faktor dinilai di luar domainnya:'{student_answer}'

source: Invalid math syntax: '{student_answer}'
ms_my: Sintaks matematik tidak sah: '{student_answer}'

source: You may not use complex numbers in range tolerance problems
ms_my: Anda mungkin tidak menggunakan nombor kompleks dalam masalah toleransi julat

source: There was a problem with the staff answer to this problem: complex boundary.
ms_my: Terdapat masalah dengan jawapan kakitangan kepada masalah ini: sempadan kompleks.

source: There was a problem with the staff answer to this problem: empty boundary.
ms_my: Terdapat masalah dengan jawapan kakitangan untuk masalah ini: sempadan kosong.

source: or
ms_my: atau

source: Text Input
ms_my: Input Teks

source: error
ms_my: ralat

source: Custom Evaluated Script
ms_my: Skrip Dinilai Tersuai

source: error getting student answer from {student_answers}
ms_my: ralat mendapatkan jawapan pelajar daripada {student_answers}

source: No answer entered!
ms_my: Tiada jawapan yang dimasukkan!

source: CustomResponse: check function returned an invalid dictionary!
ms_my: CustomResponse: fungsi semak mengembalikan kamus yang tidak sah!

source: Symbolic Math Input
ms_my: Input Matematik Simbolik

source: An error occurred with SymbolicResponse. The error was: {error_msg}
ms_my: Ralat berlaku dengan SymbolicResponse. Ralatnya ialah: {error_msg}

source: Code Input
ms_my: Input Kod

source: No answer provided.
ms_my: Tiada jawapan disediakan.

source: Error: No grader has been set up for this problem.
ms_my: Ralat: Tiada penggred telah disediakan untuk masalah ini.

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
ms_my: Tidak dapat menghantar penyerahan anda kepada penggred (Sebab: {error_msg}). Sila cuba lagi kemudian.

source: Invalid grader reply. Please contact the course staff.
ms_my: Balasan penggred tidak sah. Sila hubungi kakitangan kursus.

source: External Grader
ms_my: Penggred Luaran

source: Math Expression Input
ms_my: Input Ungkapan Matematik

source: Factorial function not permitted in answer for this problem. Provided answer was: {bad_input}
ms_my: Fungsi faktorial tidak dibenarkan sebagai jawapan untuk masalah ini. Jawapan yang diberikan ialah: {bad_input}

source: Circuit Schematic Builder
ms_my: Pembina Skema Litar

source: Error in evaluating SchematicResponse. The error was: {error_msg}
ms_my: Ralat dalam menilai SchematicResponse. Ralatnya ialah: {error_msg}

source: Image Mapped Input
ms_my: Input Dipetakan Imej

source: error grading {image_input_id} (input={user_input})
ms_my: ralat penggredan {image_input_id} (input={user_input})

source: Error in problem specification! Cannot parse rectangle in {sr_coords}
ms_my: Ralat dalam spesifikasi masalah! Tidak boleh menghuraikan segi empat tepat dalam {sr_coords}

source: Annotation Input
ms_my: Input Anotasi

source: Checkboxes With Text Input
ms_my: Kotak Semak Dengan Input Teks

source: Answer not provided for {input_type}
ms_my: Jawapan tidak diberikan untuk {input_type}

source: The Staff answer could not be interpreted as a number.
ms_my: Jawapan Staf tidak boleh ditafsirkan sebagai nombor.

source: Codejail API Service is unavailable. Please try again in a few minutes.
ms_my: Perkhidmatan Codejail API tidak tersedia. Sila cuba lagi dalam beberapa minit.

source: Codejail API Service invalid response.
ms_my: Jawapan tidak sah Perkhidmatan Codejail API.

source: Invalid JSON response received from codejail api service.
ms_my: Respons JSON tidak sah diterima daripada perkhidmatan codejail api.

source: Number of attempts taken by the student on this problem
ms_my: Bilangan percubaan yang diambil oleh pelajar terhadap masalah ini

source: Maximum Attempts
ms_my: Percubaan Maksimum

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
ms_my: Mentakrifkan bilangan kali pelajar boleh cuba menjawab masalah ini. Jika nilai tidak ditetapkan, percubaan tak terhingga dibenarkan.

source: Grading Method
ms_my: Kaedah Penggredan

source: Define the grading method for this problem. By default, it's the score of the last submission made by the student.
ms_my: Tentukan kaedah penggredan untuk masalah ini. Secara lalai, ini ialah markah penyerahan terakhir yang dibuat oleh pelajar.

source: Last Score
ms_my: Skor Terakhir

source: First Score
ms_my: Skor Pertama

source: Highest Score
ms_my: Markah Tertinggi

source: Average Score
ms_my: Skor Purata

source: Date that this problem is due by
ms_my: Tarikh masalah ini disebabkan oleh

source: Amount of time after the due date that submissions will be accepted
ms_my: Tempoh masa selepas tarikh akhir penyerahan akan diterima

source: Show Results
ms_my: Tunjukkan Keputusan

source: Defines when to show whether a learner's answer to the problem is correct. Configured on the subsection.
ms_my: Mentakrifkan masa untuk menunjukkan sama ada jawapan pelajar kepada masalah itu betul. Dikonfigurasikan pada subseksyen.

source: Always
ms_my: Sentiasa

source: Past Due
ms_my: Lewat Tempoh

source: Show Answer
ms_my: Tunjukkan Jawapan

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
ms_my: Menentukan masa untuk menunjukkan jawapan kepada masalah. Nilai lalai boleh ditetapkan dalam Tetapan Lanjutan.

source: Answered
ms_my: Dijawab

source: Attempted or Past Due
ms_my: Percubaan atau Telah Diperolehi

source: Closed
ms_my: tertutup

source: Finished
ms_my: Selesai

source: Correct or Past Due
ms_my: Betul atau Sudah Terlewat

source: After Some Number of Attempts
ms_my: Selepas Beberapa Bilangan Percubaan

source: After All Attempts
ms_my: Selepas Segala Percubaan

source: After All Attempts or Correct
ms_my: Selepas Semua Percubaan atau Betul

source: Attempted
ms_my: Dicuba

source: Show Answer: Number of Attempts
ms_my: Tunjukkan Jawapan: Bilangan Percubaan

source: Number of times the student must attempt to answer the question before the Show Answer button appears.
ms_my: Bilangan kali pelajar mesti cuba menjawab soalan sebelum butang Tunjukkan Jawapan muncul.

source: Whether to force the save button to appear on the page
ms_my: Sama ada hendak memaksa butang simpan untuk dipaparkan pada halaman

source: Show Reset Button
ms_my: Tunjukkan Butang Tetapkan Semula

source: Determines whether a 'Reset' button is shown so the user may reset their answer. A default value can be set in Advanced Settings.
ms_my: Menentukan sama ada butang 'Reset' ditunjukkan supaya pengguna boleh menetapkan semula jawapan mereka. Nilai lalai boleh ditetapkan dalam Tetapan Lanjutan.

source: Randomization
ms_my: Menentukan sama ada butang 'Reset' ditunjukkan supaya pengguna boleh menetapkan semula jawapan mereka. Nilai lalai boleh ditetapkan dalam Tetapan Lanjutan.

source: Defines when to randomize the variables specified in the associated Python script. For problems that do not randomize values, specify "Never".
ms_my: Mentakrifkan masa untuk rawak pembolehubah yang dinyatakan dalam skrip Python yang berkaitan. Untuk masalah yang tidak merawak nilai, nyatakan "Jangan sekali-kali".

source: On Reset
ms_my: Pada Set Semula

source: Per Student
ms_my: Setiap Pelajar

source: XML data for the problem
ms_my: Data XML untuk masalah tersebut

source: Dictionary with the correctness of current student answers
ms_my: Kamus dengan ketepatan jawapan pelajar semasa

source: List of correctness maps for each attempt
ms_my: Senarai peta ketepatan untuk setiap percubaan

source: Dictionary for maintaining the state of inputtypes
ms_my: Kamus untuk mengekalkan keadaan jenis input

source: Dictionary with the current student responses
ms_my: Kamus dengan respons pelajar semasa

source: List of student answers for each attempt
ms_my: Senarai jawapan pelajar bagi setiap percubaan

source: Dictionary with the current student score
ms_my: Kamus dengan markah pelajar semasa

source: List of scores for each attempt
ms_my: Senarai markah untuk setiap percubaan

source: Whether or not the answers have been saved since last submit
ms_my: Sama ada jawapan telah disimpan atau tidak sejak penyerahan terakhir

source: Whether the student has answered the problem
ms_my: Sama ada murid telah menjawab masalah

source: Random seed for this student
ms_my: Benih rawak untuk pelajar ini

source: Last submission time
ms_my: Masa penyerahan terakhir

source: Timer Between Attempts
ms_my: Pemasa Antara Percubaan

source: Seconds a student must wait between submissions for a problem with multiple attempts.
ms_my: Beberapa saat pelajar mesti menunggu antara penyerahan untuk masalah dengan beberapa percubaan.

source: Problem Weight
ms_my: Masalah Berat

source: Defines the number of points each problem is worth. If the value is not set, each response field in the problem is worth one point.
ms_my: Mentakrifkan bilangan mata setiap masalah bernilai. Jika nilai tidak ditetapkan, setiap medan respons dalam masalah bernilai satu mata.

source: Markdown source of this module
ms_my: Sumber penurunan nilai modul ini

source: Source code for LaTeX and Word problems. This feature is not well-supported.
ms_my: Kod sumber untuk masalah LaTeX dan Word. Ciri ini tidak disokong dengan baik.

source: Enable LaTeX templates?
ms_my: Dayakan templat LaTeX?

source: Matlab API key
ms_my: Kunci API Matlab

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use by this course for the specified duration. Please do not share the API key with other courses and notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
ms_my: Masukkan kunci API yang disediakan oleh MathWorks untuk mengakses Perkhidmatan Dihoskan MATLAB. Kunci ini diberikan untuk kegunaan eksklusif oleh kursus ini untuk tempoh yang ditetapkan. Tolong jangan kongsi kunci API dengan kursus lain dan maklumkan kepada MathWorks dengan segera jika anda percaya kunci itu terdedah atau terjejas. Untuk mendapatkan kunci kursus anda atau untuk melaporkan isu, sila hubungi moocsupport@mathworks.com

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
ms_my: Harap maaf, terdapat ralat semasa memproses permintaan anda. Sila cuba muat semula halaman anda dan cuba lagi.

source: The state of this problem has changed since you loaded this page. Please refresh your page.
ms_my: Keadaan masalah ini telah berubah sejak anda memuatkan halaman ini. Sila muat semula halaman anda.

source: Answer ID
ms_my: ID Jawapan

source: Question
ms_my: soalan

source: Correct Answer
ms_my: Jawapan yang betul

source: Submitting
ms_my: Menyerahkan

source: Warning: The problem has been reset to its initial state!
ms_my: Amaran: Masalah telah ditetapkan semula kepada keadaan asalnya!

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
ms_my: Keadaan masalah telah rosak oleh penyerahan yang tidak sah. Penyerahan terdiri daripada:

source: If this error persists, please contact the course staff.
ms_my: Jika ralat ini berterusan, sila hubungi kakitangan kursus.

source: Hint ({hint_num} of {hints_count}):
ms_my: Petunjuk ({hint_num} daripada {hints_count}):

source: Your answers were previously saved. Click '{button_name}' to grade them.
ms_my: Jawapan anda telah disimpan sebelum ini. Klik '{button_name}' untuk menilai mereka.

source: Incorrect ({progress} point)
ms_my: Salah ({progress} mata)

source: Correct ({progress} point)
ms_my: Betul ({progress} mata)

source: Partially correct ({progress} point)
ms_my: Separa betul ({progress} mata)

source: Partially Correct
ms_my: Separa Betul

source: Answer submitted.
ms_my: Jawapan diserahkan.

source: Problem is closed.
ms_my: Masalah ditutup.

source: Problem must be reset before it can be submitted again.
ms_my: Masalah mesti ditetapkan semula sebelum boleh diserahkan semula.

source: You must wait at least {wait} seconds between submissions.
ms_my: Anda mesti menunggu sekurang-kurangnya {wait} saat antara penyerahan.
