Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Download CSV of Certificates Issued
ms_my: Muat turun CSV Sijil Dikeluarkan

source: For smaller courses, click to list profile information for enrolled students directly on this page:
ms_my: Untuk kursus yang lebih kecil, klik untuk menyenaraikan maklumat profil bagi pelajar yang didaftarkan terus pada halaman ini:

source: List enrolled students' profile information
ms_my: Senaraikan maklumat profil pelajar yang didaftarkan

source: Click to generate a CSV grade report for all currently enrolled students.
ms_my: Klik untuk menjana laporan gred CSV untuk semua pelajar yang sedang mendaftar.

source: Generate Grade Report
ms_my: Hasilkan Laporan Gred

source: Generate Problem Grade Report
ms_my: Hasilkan Laporan Gred Masalah

source: Generate ORA Data Report
ms_my: Hasilkan Laporan Data ORA

source: Generate ORA Summary Report
ms_my: Hasilkan Laporan Ringkasan ORA

source: Click to generate a ZIP file that contains all submission texts and attachments.
ms_my: Klik untuk menjana fail ZIP yang mengandungi semua teks penyerahan dan lampiran.

source: Generate Submission Files Archive
ms_my: Jana Arkib Fail Penyerahan

source: Reports Available for Download
ms_my: Laporan Tersedia untuk Muat Turun

source: The reports listed below are available for download, identified by UTC date and time of generation.
ms_my: Laporan yang disenaraikan di bawah tersedia untuk dimuat turun, dikenal pasti mengikut tarikh dan masa penjanaan UTC.

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
ms_my: Laporan pengedaran jawapan yang disenaraikan di bawah dijana secara berkala oleh proses latar belakang automatik. Laporan adalah terkumpul, jadi jawapan yang diserahkan selepas proses bermula disertakan dalam laporan seterusnya. Laporan dijana beberapa kali sehari.

source: {strong_start}Note{strong_end}: {ul_start}{li_start}To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.{li_end}{li_start}Report files are deleted 90 days after generation. If you will need access to old reports, download and store the files, in accordance with your institution's data security policies.{li_end}{ul_end}
ms_my: {strong_start}Nota{strong_end}: {ul_start}{li_start}Untuk memastikan data pelajar selamat, anda tidak boleh menyimpan atau menghantar e-mel pautan ini untuk akses terus. Salinan pautan tamat tempoh dalam masa 5 minit.{li_end}{li_start}Fail laporan dipadamkan 90 hari selepas penjanaan. Jika anda memerlukan akses kepada laporan lama, muat turun dan simpan fail, menurut dasar keselamatan data institusi anda.{li_end}{ul_end}

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
ms_my: Laporan pengedaran jawapan yang disenaraikan di bawah dijana secara berkala oleh proses latar belakang automatik. Laporan adalah terkumpul, jadi jawapan yang diserahkan selepas proses bermula disertakan dalam laporan seterusnya. Laporan dijana beberapa kali sehari.

source: {strong_start}Note{strong_end}: {ul_start}{li_start}To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.{li_end}{li_start}Report files are deleted 90 days after generation. If you will need access to old reports, download and store the files, in accordance with your institution's data security policies.{li_end}{ul_end}
ms_my: {strong_start}Nota{strong_end}: {ul_start}{li_start}Untuk memastikan data pelajar selamat, anda tidak boleh menyimpan atau menghantar e-mel pautan ini untuk akses terus. Salinan pautan tamat tempoh dalam masa 5 minit.{li_end}{li_start}Fail laporan dipadamkan 90 hari selepas penjanaan. Jika anda memerlukan akses kepada laporan lama, muat turun dan simpan fail, menurut dasar keselamatan data institusi anda.{li_end}{ul_end}

source: Edit Coupon Code
ms_my: Edit Kod Kupon

source: Edit Coupon Code Information
ms_my: Edit Maklumat Kod Kupon

source: Code
ms_my: Kod

source: example: A123DS
ms_my: contoh: A123DS

source: Percentage Discount
ms_my: Diskaun Peratusan

source: Expiration Date
ms_my: Tarikh Luput

source: Update Coupon Code
ms_my: Kemas kini Kod Kupon

source: Individual due date extensions
ms_my: Sambungan tarikh akhir individu

source: In this section, you have the ability to grant extensions on specific subsections to individual students. Please note that the latest date is always taken; you cannot use this tool to make an assignment due earlier for a particular student.
ms_my: Dalam bahagian ini, anda mempunyai keupayaan untuk memberikan sambungan pada subseksyen tertentu kepada pelajar individu. Sila ambil perhatian bahawa tarikh terkini sentiasa diambil; anda tidak boleh menggunakan alat ini untuk membuat tugasan yang perlu dibayar lebih awal untuk pelajar tertentu.

source: Specify the {platform_name} email address or username of a student here:
ms_my: Tentukan alamat e-mel atau nama pengguna {platform_name} pelajar di sini:

source: Student Email or Username
ms_my: E-mel Pelajar atau Nama Pengguna

source: Choose the graded subsection:
ms_my: Pilih subseksyen yang digredkan:

source: Specify the extension due date and time (in UTC; please specify {format_string}).
ms_my: Nyatakan tarikh dan masa tamat sambungan (dalam UTC; sila nyatakan {format_string}).

source: Reason for extension
ms_my: Sebab pelanjutan

source: Change due date for student
ms_my: Tukar tarikh akhir pelajar

source: Viewing granted extensions
ms_my: Melihat sambungan yang diberikan

source: Here you can see what extensions have been granted on particular subsection or for a particular student.
ms_my: Di sini anda boleh melihat sambungan yang telah diberikan pada subseksyen tertentu atau untuk pelajar tertentu.

source: Choose a graded subsection and click the button to obtain a list of all students who have extensions for the given subsection.
ms_my: Pilih subseksyen yang dinilai dan klik butang untuk mendapatkan senarai semua pelajar yang mempunyai sambungan untuk subseksyen yang diberikan.

source: List all students with due date extensions
ms_my: Senaraikan semua pelajar dengan pelanjutan tarikh akhir

source: Specify a student to see all of that student's extensions.
ms_my: Tentukan pelajar untuk melihat semua sambungan pelajar itu.

source: List date extensions for student
ms_my: Senaraikan sambungan tarikh untuk pelajar

source: Resetting extensions
ms_my: Menetapkan semula sambungan

source: Resetting a problem's due date rescinds a due date extension for a student on a particular subsection. This will revert the due date for the student back to the problem's original due date.
ms_my: Menetapkan semula tarikh tamat masalah membatalkan lanjutan tarikh tamat untuk pelajar pada subseksyen tertentu. Ini akan mengembalikan tarikh akhir pelajar kepada tarikh tamat asal masalah.

source: Reason for reset
ms_my: Sebab untuk menetapkan semula

source: Reset due date for student
ms_my: Tetapkan semula tarikh akhir untuk pelajar

source: Generate Registration Code Modal
ms_my: Hasilkan Modal Kod Pendaftaran

source: Create Enrollment Codes
ms_my: Buat Kod Pendaftaran

source: * Required Information
ms_my: * Maklumat yang Diperlukan

source: The organization that purchased enrollments in the course
ms_my: Organisasi yang membeli pendaftaran dalam kursus

source: Organization Contact
ms_my: Hubungan Organisasi

source: Organization Contact Name
ms_my: Nama Hubungan Organisasi

source: The primary contact at the organization
ms_my: Hubungan utama di organisasi

source: Invoice Recipient
ms_my: Penerima Invois

source: The contact who should receive the invoice
ms_my: Orang hubungan yang sepatutnya menerima invois

source: Organization Billing Address
ms_my: Alamat Pengebilan Organisasi

source: Address Line 1
ms_my: Talian Alamat 1

source: Address Line 2
ms_my: Talian Alamat 2

source: Address Line 3
ms_my: Talian Alamat 3

source: State/Province
ms_my: Negeri/Wilayah

source: Unit Price
ms_my: Harga Unit

source: The price per enrollment purchased
ms_my: Harga setiap pendaftaran yang dibeli

source: Number of Enrollment Codes
ms_my: Bilangan Kod Pendaftaran

source: The total number of enrollment codes to create
ms_my: Jumlah bilangan kod pendaftaran untuk dibuat

source: Course Team Internal Reference
ms_my: Rujukan Dalaman Pasukan Kursus

source: Internal reference information for the sale
ms_my: Maklumat rujukan dalaman untuk jualan

source: Customer Reference
ms_my: Rujukan Pelanggan

source: Customer's purchase order or other reference information
ms_my: Pesanan pembelian pelanggan atau maklumat rujukan lain

source: Send me a copy of the invoice
ms_my: Hantarkan saya salinan invois

source: For analytics about your course, go to {link_start}{analytics_dashboard_name}{link_end}.
ms_my: Untuk analitis tentang kursus anda, pergi ke {link_start}{analytics_dashboard_name}{link_end}.

source: Instructor Dashboard
ms_my: Papan Pemuka Pengajar

source: View Course in Studio
ms_my: Lihat Kursus di Studio

source: Enrollment Code Status
ms_my: Status Kod Pendaftaran

source: Change the status of an enrollment code.
ms_my: Tukar status kod pendaftaran.

source: Enrollment Code
ms_my: Kod Pendaftaran

source: Find Enrollment Code
ms_my: Cari Kod Pendaftaran

source: Enter email addresses and/or usernames separated by new lines or commas.
ms_my: Masukkan alamat e-mel dan/atau nama pengguna yang dipisahkan dengan baris atau koma baharu.

source: You will not get notification for emails that bounce, so please double-check spelling.
ms_my: Anda tidak akan mendapat pemberitahuan untuk e-mel yang melantun, jadi sila semak semula ejaan.

source: Enter the reason why the students are to be manually enrolled or unenrolled.
ms_my: Masukkan sebab mengapa pelajar perlu didaftarkan secara manual atau dinyahdaftarkan.

source: This cannot be left blank and will be recorded and presented in Enrollment Reports.
ms_my: Ini tidak boleh dibiarkan kosong dan akan direkodkan dan dibentangkan dalam Laporan Pendaftaran.

source: Therefore, please give enough detail to account for this action.
ms_my: Oleh itu, sila berikan butiran yang mencukupi untuk menjelaskan tindakan ini.

source: Reason
ms_my: Sebab

source: Register/Enroll Students
ms_my: Mendaftar/Mendaftar Pelajar

source: To register and enroll a list of users in this course, choose a CSV file that contains the following columns in this exact order: email, username, name, and country. Please include one student per row and do not include any headers, footers, or blank lines. Optionally, extra columns can be provided: cohort and course mode, in that order. These extra columns may be blank.
ms_my: Untuk mendaftar dan mendaftar senarai pengguna dalam kursus ini, pilih fail CSV yang mengandungi lajur berikut dalam susunan tepat ini: e-mel, nama pengguna, nama dan negara. Sila sertakan seorang pelajar setiap baris dan jangan sertakan sebarang pengepala, pengaki atau baris kosong. Secara pilihan, lajur tambahan boleh disediakan: kohort dan mod kursus, dalam susunan itu. Lajur tambahan ini mungkin kosong.

source: Upload a CSV for bulk enrollment
ms_my: Muat naik CSV untuk pendaftaran pukal

source: Upload CSV
ms_my: Muat naik CSV

source: Batch Beta Tester Addition
ms_my: Penambahan Penguji Beta Berkelompok

source: Note: Users must have an activated {platform_name} account before they can be enrolled as beta testers.
ms_my: Nota: Pengguna mesti mempunyai akaun {platform_name} yang diaktifkan sebelum mereka boleh didaftarkan sebagai penguji beta.

source: If this option is {em_start}checked{em_end}, users who have not enrolled in your course will be automatically enrolled.
ms_my: Jika pilihan ini {em_start}ditandai{em_end}, pengguna yang belum mendaftar dalam kursus anda akan didaftarkan secara automatik.

source: Checking this box has no effect if 'Remove beta testers' is selected.
ms_my: Menandai kotak ini tidak mempunyai kesan jika 'Alih keluar penguji beta' dipilih.

source: Add beta testers
ms_my: Tambah penguji beta

source: Remove beta testers
ms_my: Alih keluar penguji beta

source: Course Team Management
ms_my: Pengurusan Pasukan Kursus

source: Select a course team role:
ms_my: Pilih peranan pasukan kursus:

source: Getting available lists...
ms_my: Mendapatkan senarai yang tersedia...

source: Staff cannot modify these lists. To manage course team membership, a course Admin must give you the Admin role to add Staff or Beta Testers, or the Discussion Admin role to add discussion moderators and TAs.
ms_my: Kakitangan tidak boleh mengubah suai senarai ini. Untuk mengurus keahlian pasukan kursus, Pentadbir kursus mesti memberi anda peranan Pentadbir untuk menambah Kakitangan atau Penguji Beta, atau peranan Pentadbir Perbincangan untuk menambah moderator perbincangan dan TA.

source: Course team members with the Staff role help you manage your course. Staff can enroll and unenroll learners, as well as modify their grades and access all course data. Staff also have access to your course in Studio and Insights. Any users not yet enrolled in the course will be automatically enrolled when added as Staff.
ms_my: Ahli pasukan kursus dengan peranan Kakitangan membantu anda mengurus kursus anda. Kakitangan boleh mendaftar dan membatalkan pendaftaran pelajar, serta mengubah suai gred mereka dan mengakses semua data kursus. Kakitangan juga mempunyai akses kepada kursus anda dalam Studio dan Insights. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambah sebagai Kakitangan.

source: Add Staff
ms_my: Tambah Kakitangan

source: Limited Staff
ms_my: Kakitangan Terhad

source: Course team members with the Limited Staff role help you manage your course. Limited Staff can enroll and unenroll learners, as well as modify their grades and access all course data. Limited Staff don't have access to your course in Studio. Any users not yet enrolled in the course will be automatically enrolled when added as Limited Staff.
ms_my: Ahli pasukan kursus dengan peranan Kakitangan Terhad membantu anda menguruskan kursus anda. Kakitangan Terhad boleh mendaftar dan membatalkan pendaftaran pelajar, serta mengubah suai gred mereka dan mengakses semua data kursus. Kakitangan Terhad tidak mempunyai akses kepada kursus anda di Studio. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambah sebagai Kakitangan Terhad.

source: Add Limited Staff
ms_my: Tambah Kakitangan Terhad

source: Course team members with the Admin role help you manage your course. They can do all of the tasks that Staff can do, and can also add and remove the Staff and Admin roles, discussion moderation roles, and the beta tester role to manage course team membership. Any users not yet enrolled in the course will be automatically enrolled when added as Admin.
ms_my: Ahli pasukan kursus dengan peranan Pentadbir membantu anda mengurus kursus anda. Mereka boleh melakukan semua tugas yang boleh dilakukan oleh Kakitangan, dan juga boleh menambah dan mengalih keluar peranan Kakitangan dan Pentadbir, peranan penyederhanaan perbincangan dan peranan penguji beta untuk mengurus keahlian pasukan kursus. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambahkan sebagai Pentadbir.

source: Add Admin
ms_my: Tambah Admin

source: Beta Testers
ms_my: Penguji Beta

source: Beta Testers can see course content before other learners. They can make sure that the content works, but have no additional privileges. Any users not yet enrolled in the course will be automatically enrolled when added as Beta Tester.
ms_my: Penguji Beta boleh melihat kandungan kursus sebelum pelajar lain. Mereka boleh memastikan bahawa kandungan berfungsi, tetapi tidak mempunyai keistimewaan tambahan. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambahkan sebagai Penguji Beta.

source: Add Beta Tester
ms_my: Tambah Penguji Beta

source: Discussion Admins
ms_my: Pentadbir Perbincangan

source: Discussion Admins can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They can also add and remove the discussion moderation roles to manage course team membership. Any users not yet enrolled in the course will be automatically enrolled when added as Discussion Admin
ms_my: Pentadbir Perbincangan boleh mengedit atau memadam sebarang siaran, memadamkan bendera penyalahgunaan, menutup dan membuka semula urutan, menyokong respons dan melihat siaran daripada semua kumpulan. Jawatan mereka ditanda sebagai 'kakitangan'. Mereka juga boleh menambah dan mengalih keluar peranan penyederhanaan perbincangan untuk mengurus keahlian pasukan kursus. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambah sebagai Pentadbir Perbincangan

source: Add Discussion Admin
ms_my: Tambahkan Pentadbir Perbincangan

source: Course Data Researcher
ms_my: Penyelidik Data Kursus

source: Course Data Researchers can access the data download tab. Any users not yet enrolled in the course will be automatically enrolled when added as Course Data Researcher.
ms_my: Penyelidik Data Kursus boleh mengakses tab muat turun data. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambah sebagai Penyelidik Data Kursus.

source: Add Course Data Researcher
ms_my: Tambah Penyelidik Data Kursus

source: Discussion Moderators
ms_my: Moderator Perbincangan

source: Discussion Moderators can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They cannot manage course team membership by adding or removing discussion moderation roles. Any users not yet enrolled in the course will be automatically enrolled when added as Discussion Moderator
ms_my: Moderator Perbincangan boleh mengedit atau memadam sebarang siaran, memadamkan bendera penyalahgunaan, menutup dan membuka semula urutan, menyokong respons dan melihat siaran daripada semua kumpulan. Jawatan mereka ditanda sebagai 'kakitangan'. Mereka tidak boleh mengurus keahlian pasukan kursus dengan menambah atau mengalih keluar peranan penyederhanaan perbincangan. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambah sebagai Moderator Perbincangan

source: Add Moderator
ms_my: Tambah Moderator

source: Group Community TA
ms_my: TA Komuniti Kumpulan

source: Group Community TAs are members of the community who help course teams moderate discussions. Group Community TAs see only posts by learners in their assigned group. They can edit or delete posts, clear flags, close and re-open threads, and endorse responses, but only for posts by learners in their group. Their posts are marked as 'Community TA'. Any users not yet enrolled in the course will be automatically enrolled when added as Group Community TA
ms_my: TA Komuniti Kumpulan ialah ahli komuniti yang membantu pasukan kursus menyederhanakan perbincangan. TA Komuniti Kumpulan hanya melihat siaran oleh pelajar dalam kumpulan yang ditugaskan mereka. Mereka boleh mengedit atau memadamkan siaran, mengosongkan bendera, menutup dan membuka semula urutan serta menyokong respons, tetapi hanya untuk siaran oleh pelajar dalam kumpulan mereka. Jawatan mereka ditandakan sebagai 'TA Komuniti'. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambah sebagai TA Komuniti Kumpulan

source: Add Group Community TA
ms_my: Tambah TA Komuniti Kumpulan

source: Community TAs are members of the community who help course teams moderate discussions. They can see posts by learners in their assigned cohort or enrollment track, and can edit or delete posts, clear flags, close or re-open threads, and endorse responses. Their posts are marked as 'Community TA'. Any users not yet enrolled in the course will be automatically enrolled when added as Community TA
ms_my: TA komuniti ialah ahli komuniti yang membantu pasukan kursus menyederhanakan perbincangan. Mereka boleh melihat siaran oleh pelajar dalam kohort atau runut pendaftaran yang ditetapkan mereka, dan boleh mengedit atau memadamkan siaran, mengosongkan bendera, menutup atau membuka semula urutan dan menyokong respons. Jawatan mereka ditandakan sebagai 'TA Komuniti'. Mana-mana pengguna yang belum mendaftar dalam kursus akan didaftarkan secara automatik apabila ditambahkan sebagai TA Komuniti

source: Add Community TA
ms_my: Tambah TA Komuniti

source: CCX Coaches
ms_my: Jurulatih CCX

source: CCX Coaches are able to create their own Custom Courses based on this course, which they can use to provide personalized instruction to their own students based in this course material.
ms_my: Jurulatih CCX boleh mencipta Kursus Tersuai mereka sendiri berdasarkan kursus ini, yang boleh mereka gunakan untuk memberikan arahan yang diperibadikan kepada pelajar mereka sendiri berdasarkan bahan kursus ini.

source: Add CCX Coach
ms_my: Tambah Jurulatih CCX

source: To use the email tool, visit the
ms_my: Untuk menggunakan alat e-mel, lawati laman web

source: new experience
ms_my: pengalaman baru

source: Send to:
ms_my: Hantar kepada:

source: Myself
ms_my: saya sendiri

source: Staff and Administrators
ms_my: Kakitangan dan Pentadbir

source: All Learners
ms_my: Semua Pelajar

source: Cohort:
ms_my: Kohort:

source: (Learners not explicitly assigned to a cohort)
ms_my: (Pelajar tidak ditugaskan secara eksplisit kepada kohort)

source: Learners in the {track_name} Track
ms_my: Pelajar dalam Trek {track_name}.

source: Subject:
ms_my: Subjek:

source: (Maximum 128 characters)
ms_my: (Maksimum 128 aksara)

source: Message:
ms_my: Mesej:

source: We recommend sending learners no more than one email message per week. Before you send your email, review the text carefully and send it to yourself first, so that you can preview the formatting and make sure embedded images and links work correctly.
ms_my: Kami mengesyorkan menghantar pelajar tidak lebih daripada satu mesej e-mel setiap minggu. Sebelum anda menghantar e-mel anda, semak teks dengan teliti dan hantar kepada diri anda terlebih dahulu, supaya anda boleh pratonton pemformatan dan memastikan imej dan pautan terbenam berfungsi dengan betul.

source: You can include keywords in your messages. For list of available keywords see the {start_link}documentation{end_link}.
ms_my: Anda boleh memasukkan kata kunci dalam mesej anda. Untuk senarai kata kunci yang tersedia lihat {start_link}dokumentasi{end_link}.

source: CAUTION!
ms_my: AWAS!

source: When you select Send Email, your email message is added to the queue for sending, and cannot be cancelled.
ms_my: Apabila anda memilih Hantar E-mel, mesej e-mel anda ditambahkan pada baris gilir untuk penghantaran, dan tidak boleh dibatalkan.

source: Send Email
ms_my: Hantar E-mel

source: Email actions run in the background. The status for any active tasks - including email tasks - appears in a table below.
ms_my: Tindakan e-mel dijalankan di latar belakang. Status untuk sebarang tugas aktif - termasuk tugas e-mel - muncul dalam jadual di bawah.

source: Email Task History
ms_my: E-mel Sejarah Tugas

source: To see the content of previously sent emails, click this button:
ms_my: Untuk melihat kandungan e-mel yang dihantar sebelum ini, klik butang ini:
