Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: A Broad Library of Problem Types
ms_my: Perpustakaan Luas Jenis Masalah

source: It's more than just multiple choice. {studio_name} supports more than a dozen types of problems to challenge your learners.
ms_my: Ia lebih daripada sekadar pelbagai pilihan. {studio_name} menyokong lebih daripada sedozen jenis masalah untuk mencabar pelajar anda.

source: {studio_name} Gives You Simple, Fast, and Incremental Publishing. With Friends.
ms_my: {studio_name} Memberi Anda Penerbitan yang Mudah, Pantas dan Bertambah. Bersama Kawan.

source: Simple, Fast, and Incremental Publishing. With Friends.
ms_my: Penerbitan Mudah, Cepat dan Bertambah. Bersama Kawan.

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
ms_my: {studio_name} berfungsi seperti aplikasi web yang anda sudah tahu, namun memahami cara anda membina kurikulum. Penerbitan segera ke web apabila anda mahukannya, keluaran tambahan apabila ia masuk akal. Dan dengan pengarang bersama, anda boleh mempunyai seluruh pasukan membina kursus, bersama-sama.

source: Instant Changes
ms_my: Perubahan Segera

source: Caught a bug? No problem. When you want, your changes go live when you click Save.
ms_my: Terperangkap pepijat? Tiada masalah. Apabila anda mahu, perubahan anda akan disiarkan apabila anda mengklik Simpan.

source: Release-On Date Publishing
ms_my: Penerbitan Tarikh Keluaran

source: When you've finished a {strong_start}section{strong_end}, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
ms_my: Apabila anda telah menyelesaikan {strong_start}bahagian{strong_end}, pilih bila anda mahu bahagian itu disiarkan secara langsung dan {studio_name} menguruskan yang lain. Bina kursus anda secara berperingkat.

source: Work in Teams
ms_my: Bekerja dalam Pasukan

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
ms_my: Pengarang bersama mempunyai akses penuh kepada semua alatan pengarangan yang sama. Jadikan kursus anda lebih baik melalui usaha berpasukan.

source: Sign Up for {studio_name} Today!
ms_my: Daftar untuk {studio_name} Hari ini!

source: Sign Up & Start Making Your {platform_name} Course
ms_my: Daftar & Mula Membuat Kursus {platform_name} Anda

source: Already have a {studio_name} Account? Sign In
ms_my: Sudah mempunyai Akaun {studio_name}? Log Masuk

source: Outlining Your Course
ms_my: Menggariskan Kursus Anda

source: Simple two-level outline to organize your course. Drag and drop, and see your course at a glance.
ms_my: Garis besar dua peringkat mudah untuk mengatur kursus anda. Seret dan lepas, dan lihat laluan anda sepintas lalu.

source: More than Just Lectures
ms_my: Lebih daripada Sekadar Kuliah

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
ms_my: Buat video, coretan teks, perbincangan sebaris dan pelbagai jenis masalah dengan pantas.

source: Publishing on Date
ms_my: Penerbitan pada Tarikh

source: Simply set the date of a section or subsection, and {studio_name} will publish it to your students for you.
ms_my: Hanya tetapkan tarikh bahagian atau subseksyen dan {studio_name} akan menerbitkannya kepada pelajar anda untuk anda.

source: We're having trouble rendering your component
ms_my: Kami menghadapi masalah untuk memaparkan komponen anda

source: Students will not be able to access this component. Re-edit your component to fix the error.
ms_my: Pelajar tidak akan dapat mengakses komponen ini. Edit semula komponen anda untuk membetulkan ralat.

source: Error:
ms_my: Ralat:

source: Library Import
ms_my: Import Perpustakaan

source: Course Import
ms_my: Import Kursus

source: Be sure you want to import a library before continuing. The contents of the imported library will replace the contents of the existing library. {em_start}You cannot undo a library import{em_end}. Before you proceed, we recommend that you export the current library, so that you have a backup copy of it.
ms_my: Pastikan anda ingin mengimport perpustakaan sebelum meneruskan. Kandungan perpustakaan yang diimport akan menggantikan kandungan perpustakaan sedia ada. {em_start}Anda tidak boleh membuat asal import pustaka{em_end}. Sebelum anda meneruskan, kami mengesyorkan anda mengeksport pustaka semasa, supaya anda mempunyai salinan sandarannya.

source: The library that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a library.xml file. It may also contain other files.
ms_my: Pustaka yang anda import mestilah dalam fail .tar.gz (iaitu, fail .tar yang dimampatkan dengan GNU Zip). Fail .tar.gz ini mesti mengandungi fail library.xml. Ia juga mungkin mengandungi fail lain.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your library until the import operation has completed.
ms_my: Proses import mempunyai lima peringkat. Semasa dua peringkat pertama, anda mesti kekal di halaman ini. Anda boleh meninggalkan halaman ini selepas peringkat Membongkar selesai. Kami mengesyorkan, walau bagaimanapun, anda tidak membuat perubahan penting pada pustaka anda sehingga operasi import selesai.

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
ms_my: Pastikan anda ingin mengimport kursus sebelum meneruskan. Kandungan kursus yang diimport akan menggantikan kandungan kursus sedia ada. {em_start}Anda tidak boleh membuat asal import kursus{em_end}. Sebelum anda meneruskan, kami mengesyorkan anda mengeksport kursus semasa, supaya anda mempunyai salinan sandaran kursus itu.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip) or .zip (that is a compressed file). This .tar.gz or .zip file must contain a course.xml file. It may also contain other files.
ms_my: Kursus yang anda import mestilah dalam fail .tar.gz (iaitu, fail .tar yang dimampatkan dengan GNU Zip) atau .zip (iaitu fail yang dimampatkan). Fail .tar.gz atau .zip ini mesti mengandungi fail course.xml. Ia juga mungkin mengandungi fail lain.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
ms_my: Proses import mempunyai lima peringkat. Semasa dua peringkat pertama, anda mesti kekal di halaman ini. Anda boleh meninggalkan halaman ini selepas peringkat Membongkar selesai. Kami mengesyorkan, walau bagaimanapun, anda tidak membuat perubahan penting pada kursus anda sehingga operasi import selesai.

source: Select a .tar.gz File to Replace Your Library Content
ms_my: Pilih Fail .tar.gz untuk Menggantikan Kandungan Perpustakaan Anda

source: Select a .tar.gz or .zip File to Replace Your Course Content
ms_my: Pilih Fail .tar.gz atau .zip untuk Menggantikan Kandungan Kursus Anda

source: Choose a File to Import
ms_my: Pilih Fail untuk Diimport

source: File Chosen:
ms_my: Fail Dipilih:

source: Replace my library with the selected file
ms_my: Gantikan pustaka saya dengan fail yang dipilih

source: Replace my course with the selected file
ms_my: Gantikan kursus saya dengan fail yang dipilih

source: Library Import Status
ms_my: Status Import Perpustakaan

source: Course Import Status
ms_my: Status Import Kursus

source: Transferring your file to our servers
ms_my: Memindahkan fail anda ke pelayan kami

source: Unpacking
ms_my: Membongkar

source: Verifying
ms_my: Mengesahkan

source: Reviewing semantics, syntax, and required data
ms_my: Menyemak semantik, sintaks dan data yang diperlukan

source: Updating Library
ms_my: Mengemas kini Perpustakaan

source: Updating Course
ms_my: Mengemas kini Kursus

source: Integrating your imported content into this library. This process might take longer with larger libraries.
ms_my: Mengintegrasikan kandungan anda yang diimport ke dalam pustaka ini. Proses ini mungkin mengambil masa yang lebih lama dengan perpustakaan yang lebih besar.

source: Integrating your imported content into this course. This process might take longer with larger courses.
ms_my: Mengintegrasikan kandungan import anda ke dalam kursus ini. Proses ini mungkin mengambil masa yang lebih lama dengan kursus yang lebih besar.

source: Your imported content has now been integrated into this library
ms_my: Kandungan import anda kini telah disepadukan ke dalam pustaka ini

source: Your imported content has now been integrated into this course
ms_my: Kandungan import anda kini telah disepadukan ke dalam kursus ini

source: View Updated Library
ms_my: Lihat Perpustakaan Dikemas kini

source: View Updated Outline
ms_my: Lihat Rangka Kemas Kini

source: Why import a library?
ms_my: Mengapa mengimport perpustakaan?

source: You might want to update an existing library to a new version, or replace an existing library entirely. You might also have developed a library outside of {studio_name}.
ms_my: Anda mungkin ingin mengemas kini pustaka sedia ada kepada versi baharu atau menggantikan pustaka sedia ada sepenuhnya. Anda juga mungkin telah membangunkan perpustakaan di luar {studio_name}.

source: Note: Library content is not automatically updated in courses
ms_my: Nota: Kandungan perpustakaan tidak dikemas kini secara automatik dalam kursus

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
ms_my: Jika anda menukar dan mengimport perpustakaan yang dirujuk oleh blok kandungan rawak dalam satu atau lebih kursus, kursus tersebut tidak menggunakan kandungan yang dikemas kini secara automatik. Anda mesti menyegarkan semula blok kandungan rawak secara manual untuk mengemas kini kandungan perpustakaan terkini.

source: Learn more about importing a library
ms_my: Ketahui lebih lanjut tentang mengimport perpustakaan

source: Why import a course?
ms_my: Mengapa mengimport kursus?

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
ms_my: Anda mungkin mahu menjalankan versi baharu kursus sedia ada, atau menggantikan kursus sedia ada sama sekali. Atau, anda mungkin telah membangunkan kursus di luar {studio_name}.

source: What content is imported?
ms_my: Apakah kandungan yang diimport?

source: The following content is imported.
ms_my: Kandungan berikut diimport.

source: The following content is not imported.
ms_my: Kandungan berikut tidak diimport.

source: Warning: Importing while a course is running
ms_my: Amaran: Mengimport semasa kursus sedang berjalan

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
ms_my: Jika anda melakukan import semasa kursus anda berjalan, dan anda menukar nama URL (atau nod url_name) mana-mana komponen Masalah, data pelajar yang dikaitkan dengan komponen Masalah tersebut mungkin hilang. Data ini termasuk markah masalah pelajar.

source: Learn more about importing a course
ms_my: Ketahui lebih lanjut tentang mengimport kursus

source: {studio_name} Home
ms_my: Rumah {studio_name}.

source: New Course
ms_my: Kursus Baru

source: Email staff to create course
ms_my: E-mel kakitangan untuk membuat kursus

source: New Library
ms_my: Perpustakaan Baharu

source: Please correct the highlighted fields below.
ms_my: Sila betulkan medan yang diserlahkan di bawah.

source: Create a New Course
ms_my: Buat Kursus Baharu

source: Required Information to Create a New Course
ms_my: Maklumat yang Diperlukan untuk Mencipta Kursus Baharu

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
ms_my: Nama paparan awam untuk kursus anda. Ini tidak boleh ditukar, tetapi anda boleh menetapkan nama paparan yang berbeza dalam Tetapan Lanjutan kemudian.

source: The name of the organization sponsoring the course. {strong_start}Note: The organization name is part of the course URL.{strong_end} This cannot be changed, but you can set a different display name in Advanced Settings later.
ms_my: Nama organisasi yang menaja kursus. {strong_start}Nota: Nama organisasi ialah sebahagian daripada URL kursus.{strong_end} Ini tidak boleh ditukar, tetapi anda boleh menetapkan nama paparan lain dalam Tetapan Lanjutan kemudian.

source: The unique number that identifies your course within your organization. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
ms_my: Nombor unik yang mengenal pasti kursus anda dalam organisasi anda. {strong_start}Nota: Ini adalah sebahagian daripada URL kursus anda, jadi tiada ruang atau aksara khas dibenarkan dan ia tidak boleh ditukar.{strong_end}

source: The term in which your course will run. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
ms_my: Istilah di mana kursus anda akan dijalankan. {strong_start}Nota: Ini adalah sebahagian daripada URL kursus anda, jadi tiada ruang atau aksara khas dibenarkan dan ia tidak boleh diubah.{strong_end}

source: Create
ms_my: Buat

source: Create a New Library
ms_my: Buat Perpustakaan Baharu

source: Required Information to Create a New Library
ms_my: Maklumat yang Diperlukan untuk Mencipta Perpustakaan Baharu

source: Library Name
ms_my: Nama Perpustakaan

source: e.g. Computer Science Problems
ms_my: cth. Masalah Sains Komputer

source: The public display name for your library.
ms_my: Nama paparan awam untuk pustaka anda.

source: The public organization name for your library.
ms_my: Nama organisasi awam untuk pustaka anda.

source: This cannot be changed.
ms_my: Ini tidak boleh diubah.

source: Library Code
ms_my: Kod Perpustakaan

source: e.g. CSPROB
ms_my: cth. CSPROB

source: The unique code that identifies this library. {strong_start}Note: This is part of your library URL, so no spaces or special characters are allowed.{strong_end} This cannot be changed.
ms_my: Kod unik yang mengenal pasti perpustakaan ini. {strong_start}Nota: Ini adalah sebahagian daripada URL pustaka anda, jadi tiada ruang atau aksara khas dibenarkan.{strong_end} Ini tidak boleh diubah.

source: Organization and Library Settings
ms_my: Tetapan Organisasi dan Perpustakaan

source: Show all courses in organization:
ms_my: Tunjukkan semua kursus dalam organisasi:

source: For example, MITx
ms_my: Sebagai contoh, MITx

source: Courses Being Processed
ms_my: Kursus Sedang Diproses

source: Organization:
ms_my: Organisasi:

source: Course Number:
ms_my: Nombor Kursus:

source: Course Run:
ms_my: Larian Kursus:

source: This course run is currently being created.
ms_my: Larian kursus ini sedang dibuat.

source: Configuring as re-run
ms_my: Mengkonfigurasi sebagai jalankan semula

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
ms_my: Kursus baharu akan ditambah ke senarai kursus anda dalam masa 5-10 minit. Kembali ke halaman ini atau {link_start}muat semula{link_end} untuk mengemas kini senarai kursus. Kursus baharu memerlukan beberapa konfigurasi manual.

source: This re-run processing status:
ms_my: Status pemprosesan jalan semula ini:

source: Configuration Error
ms_my: Ralat Konfigurasi

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
ms_my: Ralat sistem berlaku semasa kursus anda sedang diproses. Sila pergi ke kursus asal untuk mencuba ulangan semula, atau hubungi PM anda untuk mendapatkan bantuan.

source: Archived Courses
ms_my: Kursus Arkib

source: Libraries
ms_my: Perpustakaan

source: Taxonomies
ms_my: Taksonomi

source: Are you staff on an existing {studio_name} course?
ms_my: Adakah anda kakitangan kursus {studio_name} sedia ada?

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
ms_my: Pencipta kursus mesti memberi anda akses kepada kursus. Hubungi pencipta kursus atau pentadbir untuk kursus yang anda bantu untuk pengarang.

source: Create Your First Course
ms_my: Buat Kursus Pertama Anda

source: Your new course is just a click away!
ms_my: Kursus baharu anda hanya dengan satu klik sahaja!

source: Becoming a Course Creator in {studio_name}
ms_my: Menjadi Pencipta Kursus dalam {studio_name}

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
ms_my: {studio_name} ialah penyelesaian yang dihoskan untuk rakan kongsi xConsortium dan tetamu terpilih kami. Kursus yang anda ahli pasukan dipaparkan di atas untuk anda edit, manakala keistimewaan pencipta kursus diberikan oleh {platform_name}. Pasukan kami akan menilai permintaan anda dan memberi anda maklum balas dalam masa 24 jam sepanjang minggu bekerja.

source: Your Course Creator Request Status:
ms_my: Status Permintaan Pencipta Kursus Anda:

source: Request the Ability to Create Courses
ms_my: Minta Keupayaan untuk Mencipta Kursus

source: Your Course Creator Request Status
ms_my: Status Permintaan Pencipta Kursus Anda

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
ms_my: {studio_name} ialah penyelesaian yang dihoskan untuk rakan kongsi xConsortium kami dan tetamu terpilih. Kursus yang anda ahli pasukan dipaparkan di atas untuk anda edit, manakala keistimewaan pencipta kursus diberikan oleh {platform_name}. Pasukan kami telah selesai menilai permintaan anda.

source: Your Course Creator request is:
ms_my: Permintaan Pencipta Kursus anda ialah:

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
ms_my: {studio_name} ialah penyelesaian yang dihoskan untuk rakan kongsi xConsortium dan tetamu terpilih kami. Kursus yang anda ahli pasukan dipaparkan di atas untuk anda edit, manakala keistimewaan pencipta kursus diberikan oleh {platform_name}. Pasukan kami sedang menilai permintaan anda.

source: Your request is currently being reviewed by {platform_name} staff and should be updated shortly.
ms_my: Permintaan anda sedang disemak oleh kakitangan {platform_name} dan harus dikemas kini tidak lama lagi.

source: Were you expecting to see a particular library here?
ms_my: Adakah anda menjangkakan untuk melihat perpustakaan tertentu di sini?

source: The library creator must give you access to the library. Contact the library creator or administrator for the library you are helping to author.
ms_my: Pencipta perpustakaan mesti memberi anda akses ke perpustakaan. Hubungi pencipta perpustakaan atau pentadbir untuk perpustakaan yang anda bantu untuk pengarang.

source: Create Your First Library
ms_my: Buat Pustaka Pertama Anda

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
ms_my: Perpustakaan mempunyai kumpulan komponen yang boleh digunakan semula merentas berbilang kursus. Buat pustaka pertama anda dengan satu klik butang!

source: New to {studio_name}?
ms_my: Baru kepada {studio_name}?

source: Click Help in the upper-right corner to get more information about the {studio_name} page you are viewing. You can also use the links at the bottom of the page to access our continually updated documentation and other {studio_name} resources.
ms_my: Klik Bantuan di penjuru kanan sebelah atas untuk mendapatkan maklumat lanjut tentang halaman {studio_name} yang sedang anda lihat. Anda juga boleh menggunakan pautan di bahagian bawah halaman untuk mengakses dokumentasi kami yang sentiasa dikemas kini dan sumber {studio_name} lain.

source: Getting Started with {studio_name}
ms_my: Bermula dengan {studio_name}

source: Can I create courses in {studio_name}?
ms_my: Bolehkah saya membuat kursus dalam {studio_name}?

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
ms_my: Untuk membuat kursus dalam {studio_name}, anda mesti {link_start}menghubungi kakitangan {platform_name} untuk membantu anda membuat kursus{link_end}.

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
ms_my: Untuk membuat kursus dalam {studio_name}, anda mesti mempunyai keistimewaan pencipta kursus untuk mencipta kursus anda sendiri.

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
ms_my: Permintaan anda kepada pengarang kursus dalam {studio_name} telah ditolak. Sila {link_start}hubungi Kakitangan {platform_name} untuk pertanyaan lanjut{link_end}.

source: Thanks for signing up, {name}!
ms_my: Terima kasih kerana mendaftar, {name}!

source: We need to verify your email address
ms_my: Kami perlu mengesahkan alamat e-mel anda

source: Almost there! In order to complete your sign up we need you to verify your email address ({email}). An activation message and next steps should be waiting for you there.
ms_my: hampir sampai! Untuk melengkapkan pendaftaran anda, kami memerlukan anda mengesahkan alamat e-mel anda ({email}). Mesej pengaktifan dan langkah seterusnya sepatutnya menunggu anda di sana.

source: Need help?
ms_my: Perlukan bantuan?

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
ms_my: Sila semak folder Sampah atau Spam anda sekiranya e-mel kami tiada dalam PETI MASUK anda. Masih tidak menemui e-mel pengesahan? Minta bantuan melalui pautan di bawah.

source: Showing all matching content eligible to be added into {display_name}. Each student will be assigned {max_count} component drawn randomly from this list.
ms_my: Menunjukkan semua kandungan yang sepadan yang layak untuk ditambahkan ke dalam {display_name}. Setiap pelajar akan diberikan {max_count} komponen yang diambil secara rawak daripada senarai ini.

source: Content Library
ms_my: Pustaka Kandungan
