Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: Lower Roman
ms_my: Rom Bawah

source: Match case
ms_my: Kes perlawanan

source: Merge cells
ms_my: Cantumkan sel

source: Middle
ms_my: Tengah

source: New document
ms_my: Dokumen baharu

source: Next
ms_my: Seterusnya

source: No color
ms_my: Tiada warna

source: Nonbreaking space
ms_my: Ruang tanpa pecah

source: Numbered list
ms_my: Senarai bernombor

source: Page break
ms_my: Pecah halaman

source: Paste as text
ms_my: Tampal sebagai teks

source: Paste is now in plain text mode. Contents will now be pasted as plain text until you toggle this option off.
ms_my: Tampal kini dalam mod teks biasa. Kandungan kini akan ditampal sebagai teks biasa sehingga anda menogol pilihan ini.

source: Paste row before
ms_my: Tampal baris sebelum

source: Paste your embed code below:
ms_my: Tampalkan kod benam anda di bawah:

source: Paste
ms_my: tampal

source: Pre
ms_my: Pra

source: Prev
ms_my: Sebelum

source: Print
ms_my: Cetak

source: Redo
ms_my: Buat semula

source: Remove link
ms_my: Alih keluar pautan

source: Replace all
ms_my: Gantikan semua

source: Replace with
ms_my: Gantikan dengan

source: Replace
ms_my: Gantikan

source: Restore last draft
ms_my: Pulihkan draf terakhir

source: Rich Text Area. Press ALT-F9 for menu. Press ALT-F10 for toolbar. Press ALT-0 for help
ms_my: Kawasan Teks Kaya. Tekan ALT-F9 untuk menu. Tekan ALT-F10 untuk bar alat. Tekan ALT-0 untuk mendapatkan bantuan

source: Right to left
ms_my: Kanan ke kiri

source: Right
ms_my: Betul

source: Robots
ms_my: robot

source: Row group
ms_my: Kumpulan baris

source: Row properties
ms_my: Sifat baris

source: Row type
ms_my: Jenis baris

source: Row
ms_my: baris

source: Rows
ms_my: baris

source: Scope
ms_my: Skop

source: Select all
ms_my: Pilih semua

source: Show blocks
ms_my: Tunjukkan blok

source: Show invisible characters
ms_my: Tunjukkan watak yang tidak kelihatan

source: Source code
ms_my: Kod sumber

source: Source
ms_my: Sumber

source: Special character
ms_my: Watak istimewa

source: Spellcheck
ms_my: Semak ejaan

source: Split cell
ms_my: Sel berpecah

source: Square
ms_my: Segi empat

source: Start search
ms_my: Mulakan carian

source: Style
ms_my: Gaya

source: Subscript
ms_my: Subskrip

source: Superscript
ms_my: Superskrip

source: Table properties
ms_my: Sifat jadual

source: Table
ms_my: Jadual

source: Target
ms_my: Sasaran

source: Templates
ms_my: templat

source: Text color
ms_my: Warna teks

source: Text to display
ms_my: Teks untuk dipaparkan

source: The URL you entered seems to be an email address. Do you want to add the required mailto: prefix?
ms_my: URL yang anda masukkan kelihatan seperti alamat e-mel. Adakah anda mahu menambah awalan mailto: yang diperlukan?

source: The URL you entered seems to be an external link. Do you want to add the required http:// prefix?
ms_my: URL yang anda masukkan nampaknya merupakan pautan luaran. Adakah anda mahu menambah awalan http:// yang diperlukan?

source: Title
ms_my: Tajuk

source: Tools
ms_my: Alatan

source: Top
ms_my: Atas

source: Underline
ms_my: Garis bawah

source: Undo
ms_my: Buat asal

source: Upper Alpha
ms_my: Alfa Atas

source: Upper Roman
ms_my: Rom Atas

source: V Align
ms_my: V Sejajar

source: Vertical space
ms_my: Ruang menegak

source: View
ms_my: Lihat

source: Visual aids
ms_my: Alat bantuan visual

source: Whole words
ms_my: Seluruh perkataan

source: Width
ms_my: Lebar

source: Words: {0}
ms_my: Perkataan: {0}

source: You have unsaved changes are you sure you want to navigate away?
ms_my: Anda mempunyai perubahan yang belum disimpan adakah anda pasti mahu menavigasi pergi?

source: Your browser doesn't support direct access to the clipboard. Please use the Ctrl+X/C/V keyboard shortcuts instead.
ms_my: Penyemak imbas anda tidak menyokong akses terus ke papan keratan. Sila gunakan pintasan papan kekunci Ctrl+X/C/V sebaliknya.

source: Insert/Edit Image
ms_my: Sisipkan/edit imej

source: Click OK to have your e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
ms_my: Klik OK untuk menghantar alamat e-mel anda kepada permohonan pihak ketiga. Klik Batal untuk kembali ke halaman ini tanpa menghantar maklumat anda.

source: incorrect
ms_my: tak betul

source: correct
ms_my: betul

source: answer
ms_my: jawab

source: Short explanation
ms_my: Penerangan ringkas

source: If you use the Advanced Editor, this problem will be converted to XML and you will not be able to return to the Simple Editor Interface. Proceed to the Advanced Editor and convert this problem to XML?
ms_my: Jika anda menggunakan Editor Lanjutan, masalah ini akan ditukar kepada XML dan anda tidak akan dapat kembali ke Antara Muka Editor Mudah. Teruskan ke Editor Lanjutan dan tukar masalah ini kepada XML?

source: An answer option has been left blank. Please review and edit the component.
ms_my: Pilihan jawapan telah dibiarkan kosong. Sila semak dan edit komponen.

source: Explanation
ms_my: Penjelasan

source: Sequence error! Cannot navigate to %(tab_name)s in the current SequenceModule. Please contact the course staff.
ms_my: Ralat urutan! Tidak boleh menavigasi ke %(tab_name)s dalam SequenceModule semasa. Sila hubungi kakitangan kursus.

source: Play
ms_my: Main

source: Pause
ms_my: jeda

source: Mute
ms_my: bisu

source: Unmute
ms_my: Nyahredam

source: Exit full browser
ms_my: Keluar dari pelayar penuh

source: Fill browser
ms_my: Isi pelayar

source: Speed
ms_my: Kelajuan

source: Auto-advance
ms_my: Automajukan

source: Volume
ms_my: Kelantangan

source: Muted
ms_my: Disenyapkan

source: Very low
ms_my: Sangat rendah

source: Low
ms_my: rendah

source: Average
ms_my: Purata

source: Loud
ms_my: Kuat

source: Very loud
ms_my: Sangat kuat

source: Maximum
ms_my: maksimum

source: This browser cannot play .mp4, .ogg, or .webm files.
ms_my: Penyemak imbas ini tidak boleh memainkan fail .mp4, .ogg atau .webm.

source: Try using a different browser, such as Google Chrome.
ms_my: Cuba gunakan penyemak imbas lain, seperti Google Chrome.

source: High Definition
ms_my: Definisi Tinggi

source: off
ms_my: dimatikan

source: on
ms_my: pada

source: Video position. Press space to toggle playback
ms_my: Kedudukan video. Tekan ruang untuk menogol main semula

source: Video ended
ms_my: Video tamat

source: Video position
ms_my: Kedudukan video

source: %(value)s hour
ms_my: %(value)s jam

source: %(value)s minute
ms_my: %(value)s minit

source: %(value)s second
ms_my: %(value)s saat

source: Click on this button to mute or unmute this video or press UP or DOWN buttons to increase or decrease volume level.
ms_my: Klik pada butang ini untuk meredam atau menyahredamkan video ini atau tekan butang ATAS atau BAWAH untuk menambah atau mengurangkan tahap kelantangan.

source: Adjust video volume
ms_my: Laraskan kelantangan video

source: Press UP to enter the speed menu then use the UP and DOWN arrow keys to navigate the different speeds, then press ENTER to change to the selected speed.
ms_my: Tekan KE ATAS untuk memasuki menu kelajuan kemudian gunakan kekunci anak panah ATAS dan BAWAH untuk menavigasi kelajuan yang berbeza, kemudian tekan ENTER untuk menukar ke kelajuan yang dipilih.

source: Adjust video speed
ms_my: Laraskan kelajuan video

source: Video speed:
ms_my: Kelajuan video:

source: Skip
ms_my: Langkau

source: Play video
ms_my: Mainkan video

source: Do not show again
ms_my: Jangan tunjukkan lagi

source: Open language menu
ms_my: Buka menu bahasa

source: Transcript will be displayed when you start playing the video.
ms_my: Anda kini boleh memasukkan maklumat pembayaran anda dan melengkapkan pendaftaran anda.

source: Activating a link in this group will skip to the corresponding point in the video.
ms_my: Mengaktifkan pautan dalam kumpulan ini akan melangkau ke titik yang sepadan dalam video.

source: Video transcript
ms_my: Transkrip video

source: Start of transcript. Skip to the end.
ms_my: Permulaan transkrip. Langkau ke penghujung.

source: End of transcript. Skip to the start.
ms_my: Tamat transkrip. Langkau ke permulaan.

source: Press the UP arrow key to enter the language menu then use UP and DOWN arrow keys to navigate language options. Press ENTER to change to the selected language.
ms_my: Tekan kekunci anak panah KE ATAS untuk memasuki menu bahasa kemudian gunakan kekunci anak panah ATAS dan BAWAH untuk menavigasi pilihan bahasa. Tekan ENTER untuk menukar kepada bahasa yang dipilih.

source: Hide closed captions
ms_my: Sembunyikan kapsyen tertutup

source: (Caption will be displayed when you start playing the video.)
ms_my: (Kapsyen akan dipaparkan apabila anda mula memainkan video.)

source: Turn on closed captioning
ms_my: Hidupkan kapsyen tertutup

source: Turn on transcripts
ms_my: Hidupkan transkrip

source: Turn off transcripts
ms_my: Matikan transkrip

source: Limit Access
ms_my: Hadkan Akses

source: Select a prerequisite subsection and enter a minimum score percentage and minimum completion percentage to limit access to this subsection. Allowed values are 0-100
ms_my: Pilih subseksyen prasyarat dan masukkan peratusan skor minimum dan peratusan penyiapan minimum untuk mengehadkan akses kepada subseksyen ini. Nilai yang dibenarkan ialah 0-100

source: Prerequisite:
ms_my: Prasyarat:

source: No prerequisite
ms_my: Tiada prasyarat

source: Minimum Score:
ms_my: Markah Minimum:

source: Minimum Completion:
ms_my: Penyiapan Minimum:

source: The minimum score percentage must be a whole number between 0 and 100.
ms_my: Peratusan markah minimum mestilah nombor bulat antara 0 dan 100.

source: The minimum completion percentage must be a whole number between 0 and 100.
ms_my: Peratusan penyiapan minimum mestilah nombor bulat antara 0 dan 100.

source: Use as a Prerequisite
ms_my: Gunakan sebagai Prasyarat

source: Make this subsection available as a prerequisite to other content
ms_my: Jadikan subseksyen ini tersedia sebagai prasyarat kepada kandungan lain

source: Read More
ms_my: Baca Lagi

source: details about the failure
ms_my: butiran tentang kegagalan

source: Add Component:
ms_my: Tambah Komponen:

source: %(type)s Component Template Menu
ms_my: %(type)s Menu Templat Komponen

source: Common Problem Types
ms_my: Jenis Masalah Biasa

source: Supported
ms_my: Disokong

source: Provisional
ms_my: sementara

source: Not Supported
ms_my: Tidak Disokong

source: Fully Supported
ms_my: Disokong Penuh

source: Add New Component
ms_my: Tambah Komponen Baharu

source: Deprecated
ms_my: Ditamatkan

source: List of uploaded files and assets in this course
ms_my: Senarai fail dan aset yang dimuat naik dalam kursus ini

source: - Sortable
ms_my: - Boleh disusun

source: Show All
ms_my: Tunjukkan Semua

source: Actions
ms_my: Tindakan

source: You haven't added any assets to this course yet.
ms_my: Anda belum menambah sebarang aset pada kursus ini lagi.

source: Upload your first asset
ms_my: Muat naik aset pertama anda

source: close
ms_my: tutup

source: No description available
ms_my: Tiada penerangan tersedia

source: Open/download this file
ms_my: Buka/muat turun fail ini

source: Delete this asset
ms_my: Padamkan aset ini

source: Lock this asset
ms_my: Kunci aset ini

source: Lock/unlock file
ms_my: Kunci/buka kunci fail

source: Certificate Details
ms_my: Butiran Sijil

source: Course Title
ms_my: Tajuk kursus

source: Course Title Override
ms_my: Ganti Tajuk Kursus

source: Course Number
ms_my: Nombor Kursus

source: Course Number Override
ms_my: Penggantian Nombor Kursus

source: Certificate Signatories
ms_my: Penandatangan Sijil

source: It is strongly recommended that you include four or fewer signatories. If you include additional signatories, preview the certificate in Print View to ensure the certificate will print correctly on one page.
ms_my: Anda amat disyorkan untuk memasukkan empat atau kurang penandatangan. Jika anda menyertakan penandatangan tambahan, pratonton sijil dalam Paparan Cetak untuk memastikan sijil akan dicetak dengan betul pada satu halaman.

source: Certificate Information
ms_my: Maklumat Sijil

source: Certificate Name
ms_my: Nama Sijil

source: Name of the certificate
ms_my: Nama sijil

source: Description of the certificate
ms_my: Penerangan sijil

source: Course title
ms_my: Tajuk kursus

source: Specify an alternative to the official course title to display on certificates. Leave blank to use the official course title.
ms_my: Gunakan kamera web anda untuk mengambil foto wajah anda. Kami akan memadankan foto ini dengan foto pada ID anda.

source: Add Additional Signatory
ms_my: Tambah Penandatangan Tambahan

source: (Add signatories for a certificate)
ms_my: (Tambah penandatangan untuk sijil)

source: Choose mode
ms_my: Pilih mod

source: Preview Certificate
ms_my: Sijil Pratonton

source: Activate
ms_my: Aktifkan

source: Deactivate
ms_my: Nyahaktifkan

source: component
ms_my: komponen

source: Access to this {blockType} is restricted to: {selectedGroupsLabel}
ms_my: Akses kepada {blockType} ini terhad kepada: {selectedGroupsLabel}

source: Access to some content in this {blockType} is restricted to specific groups of learners.
ms_my: Akses kepada sesetengah kandungan dalam {blockType} ini terhad kepada kumpulan pelajar tertentu.

source: Caution: The last published version of this unit is live. By publishing changes you will change the student experience.
ms_my: Awas: Versi terakhir unit ini diterbitkan secara langsung. Dengan menerbitkan perubahan, anda akan mengubah pengalaman pelajar.

source: Content Group Name
ms_my: Nama Kumpulan Kandungan

source: Content Group ID
ms_my: ID Kumpulan Kandungan

source: This is the name of the group
ms_my: Ini adalah nama kumpulan

source: This content group is used in one or more units.
ms_my: Kumpulan kandungan ini digunakan dalam satu atau lebih unit.

source: Cannot delete when in use by a unit
ms_my: Tidak boleh memadam apabila digunakan oleh unit

source: Subsection Visibility
ms_my: Keterlihatan Subseksyen

source: To hide the subsections and keep them accesible through links, you must adjust it from the section that contains them.
ms_my: Untuk menyembunyikan subseksyen dan memastikannya boleh diakses melalui pautan, anda mesti melaraskannya daripada bahagian yang mengandunginya.

source: Show entire subsection
ms_my: Tunjukkan keseluruhan subseksyen

source: Learners see the published subsection and can access its content.
ms_my: Pelajar melihat subseksyen yang diterbitkan dan boleh mengakses kandungannya.

source: Hide content after course end date
ms_my: Sembunyikan kandungan selepas tarikh tamat kursus

source: Hide content after due date
ms_my: Sembunyikan kandungan selepas tarikh tamat tempoh

source: After the course\'s end date has passed, learners can no longer access subsection content. The subsection remains included in grade calculations.
ms_my: Selepas tarikh tamat kursus telah berlalu, pelajar tidak lagi boleh mengakses kandungan subseksyen. Subseksyen tetap termasuk dalam pengiraan gred.

source: After the subsection\'s due date has passed, learners can no longer access its content. The subsection remains included in grade calculations.
ms_my: Selepas tarikh akhir subseksyen itu berlalu, pelajar tidak lagi boleh mengakses kandungannya. Subseksyen tetap termasuk dalam pengiraan gred.

source: Hide entire subsection
ms_my: Sembunyikan keseluruhan subseksyen

source: Learners do not see the subsection in the course outline. The subsection is not included in grade calculations.
ms_my: Pelajar tidak melihat subseksyen dalam rangka kursus. Subseksyen tidak termasuk dalam pengiraan gred.

source: If you select an option other than "%(hide_label)s", published units in this subsection become available to learners unless they are explicitly hidden.
ms_my: Jika anda memilih pilihan selain daripada "%(hide_label)s", unit yang diterbitkan dalam subseksyen ini tersedia kepada pelajar melainkan unit tersebut disembunyikan secara eksplisit.

source: Copy Component Location
ms_my: Salin Lokasi Komponen

source: Course Highlight Emails
ms_my: E-mel Sorotan Kursus

source: Enabled
ms_my: Didayakan

source: Enable Now
ms_my: Dayakan Sekarang

source: Instructor Name
ms_my: Nama Pengajar

source: Please add the instructor's name
ms_my: Sila tambah nama pengajar

source: Instructor Title
ms_my: Tajuk Pengajar

source: Please add the instructor's title
ms_my: Sila tambahkan tajuk pengajar

source: Organization
ms_my: Organisasi

source: Organization Name
ms_my: Nama Organisasi

source: Please add the institute where the instructor is associated
ms_my: Sila tambahkan institut tempat pengajar dikaitkan

source: Biography
ms_my: Biografi

source: Instructor Biography
ms_my: Biografi Pengajar

source: Please add the instructor's biography
ms_my: Sila tambahkan biografi pengajar

source: Photo
ms_my: Foto

source: Instructor Photo
ms_my: Foto Pengajar

source: Instructor Photo URL
ms_my: URL Foto Pengajar

source: Please add a photo of the instructor (Note: only JPEG or PNG format supported)
ms_my: Sila tambahkan foto pengajar (Nota: hanya format JPEG atau PNG yang disokong)

source: Upload Photo
ms_my: Muat Naik Foto

source: Course tags
ms_my: Tag kursus

source: Manage tags
ms_my: Urus tag

source: Prerequisite: %(prereq_display_name)s
ms_my: Prasyarat: %(prereq_display_name)s

source: Contains staff only content
ms_my: Mengandungi kandungan kakitangan sahaja

source: Hidden in the course outline, but sections are accessible for your learners through their separate link.
ms_my: Tersembunyi dalam rangka kursus, tetapi bahagian boleh diakses oleh pelajar anda melalui pautan berasingan mereka.

source: Subsections are not navigable between each other, they can only be accessed through their link.
ms_my: Subseksyen tidak boleh dilayari antara satu sama lain, ia hanya boleh diakses melalui pautan mereka.

source: Unpublished changes to live content
ms_my: Perubahan yang tidak diterbitkan pada kandungan langsung

source: Unpublished units will not be released
ms_my: Unit yang tidak diterbitkan tidak akan dikeluarkan

source: Unpublished changes to content that will release in the future
ms_my: Perubahan yang tidak diterbitkan pada kandungan yang akan dikeluarkan pada masa hadapan

source: Access to this unit is restricted to: {selectedGroupsLabel}
ms_my: Akses kepada unit ini terhad kepada: {selectedGroupsLabel}

source: Access to some content in this unit is restricted to specific groups of learners
ms_my: Akses kepada beberapa kandungan dalam unit ini terhad kepada kumpulan pelajar tertentu

source: Ungraded
ms_my: Tidak dinilai

source: Onboarding Exam
ms_my: Peperiksaan Onboarding

source: Practice proctored Exam
ms_my: Amalan Peperiksaan terkawal

source: Proctored Exam
ms_my: Peperiksaan Berkawal

source: Timed Exam
ms_my: Peperiksaan Bermasa

source: Collapse/Expand this %(xblock_type)s
ms_my: Runtuhkan/Kembangkan %(xblock_type)s ini

source: Display Name
ms_my: Nama Paparan

source: Discussions enabled
ms_my: Perbincangan didayakan

source: Proctoring Settings
ms_my: Tetapan Proctoring

source: Configure
ms_my: Konfigurasikan

source: Manage Tags
ms_my: Urus Teg

source: Copy to Clipboard
ms_my: Salin ke Papan Klip

source: Duplicate
ms_my: Pendua

source: Drag to reorder
ms_my: Seret untuk menyusun semula

source: Release Status:
ms_my: Status Keluaran:

source: Released:
ms_my: Dikeluarkan:

source: Scheduled:
ms_my: Dijadualkan:

source: Unscheduled
ms_my: Tidak berjadual

source: Section Highlights
ms_my: Sorotan Bahagian

source: Graded as:
ms_my: Digredkan sebagai:

source: Due:
ms_my: tarikh akhir:

source: Subsection is hidden after course end date
ms_my: Subseksyen disembunyikan selepas tarikh tamat kursus

source: Subsection is hidden after due date
ms_my: Subseksyen disembunyikan selepas tarikh tamat tempoh

source: Share
ms_my: Kongsi

source: This subsection is configured as \"%(gradingType)s\", which doesn't exist in the current grading policy.
ms_my: Subseksyen ini dikonfigurasikan sebagai \"%(gradingType)s\", yang tidak wujud dalam dasar penggredan semasa.

source: You haven't added any content to this course yet.
ms_my: Anda belum menambah apa-apa kandungan pada kursus ini lagi.

source: Click to add a new %(xblock_type)s
ms_my: Klik untuk menambah %(xblock_type)s baharu

source: Paste %(xblock_type)s
ms_my: Tampal %(xblock_type)s

source: From:
ms_my: Daripada:

source: What's in my clipboard?
ms_my: Apa yang ada dalam papan keratan saya?

source: Learning Outcome
ms_my: Hasil Pembelajaran

source: Add a learning outcome here
ms_my: Tambah hasil pembelajaran di sini

source: Press discard changes to discard your changes.
ms_my: Tekan buang perubahan untuk membuang perubahan anda.

source: Update Settings
ms_my: Kemas kini Tetapan

source: Press update settings to update the information for your organization.
ms_my: Tekan tetapan kemas kini untuk mengemas kini maklumat untuk organisasi anda.

source: Press discard changes to discard changes.
ms_my: Tekan buang perubahan untuk membuang perubahan.

source: Press update settings to update course video settings
ms_my: Tekan tetapan kemas kini untuk mengemas kini tetapan video kursus

source: Press close to hide course video settings
ms_my: Tekan dekat untuk menyembunyikan tetapan video kursus

source: Course Video Settings
ms_my: Tetapan Video Kursus

source: Video Sharing
ms_my: Perkongsian Video

source: Learn more
ms_my: Ketahui lebih lanjut

source: Transcript Turnaround
ms_my: Pemulihan Transkrip

source: Transcript Fidelity
ms_my: Kesetiaan Transkrip

source: Video Source Language
ms_my: Bahasa Sumber Video

source: Transcript Languages
ms_my: Bahasa Transkrip

source: Add
ms_my: Tambah

source: Press Add to language
ms_my: Tekan Tambah ke bahasa

source: Automated Transcripts
ms_my: Transkrip Automatik

source: Transcript Provider
ms_my: Pembekal Transkrip

source: Change
ms_my: Berubah

source: Press change to change selected transcript provider.
ms_my: Tekan tukar untuk menukar penyedia transkrip yang dipilih.

source: Assignment Type Name
ms_my: Nama Jenis Tugasan

source: The general category for this type of assignment, for example, Homework or Midterm Exam. This name is visible to learners.
ms_my: Kategori umum untuk jenis tugasan ini, contohnya, Kerja Rumah atau Peperiksaan Pertengahan Penggal. Nama ini boleh dilihat oleh pelajar.v

source: Abbreviation
ms_my: Singkatan

source: This short name for the assignment type (for example, HW or Midterm) appears next to assignments on a learner's Progress page.
ms_my: Nama pendek untuk jenis tugasan ini (contohnya, HW atau Pertengahan Penggal) muncul di sebelah tugasan pada halaman Kemajuan pelajar.

source: Weight of Total Grade
ms_my: Berat Jumlah Gred

source: The weight of all assignments of this type as a percentage of the total grade, for example, 40. Do not include the percent symbol.
ms_my: Berat semua tugasan jenis ini sebagai peratusan daripada jumlah gred, contohnya, 40. Jangan sertakan simbol peratus.

source: Total Number
ms_my: Jumlah Bilangan

source: The number of subsections in the course that contain problems of this assignment type.
ms_my: Bilangan subseksyen dalam kursus yang mengandungi masalah jenis tugasan ini.

source: Number of Droppable
ms_my: Bilangan Droppable

source: The number of assignments of this type that will be dropped. The lowest scoring assignments are dropped first.
ms_my: Bilangan tugasan jenis ini yang akan digugurkan. Tugasan markah terendah digugurkan dahulu.

source: Warning:
ms_my: Amaran:

source: The number of {type} assignments defined here does not match the current number of {type} assignments in the course:
ms_my: Bilangan tugasan {type} yang ditakrifkan di sini tidak sepadan dengan bilangan tugasan {type} semasa dalam kursus:

source: {assignment_count} {type} assignment(s) found:
ms_my: {assignment_count} {type} tugasan ditemui:
