Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: We're sorry, but this version of your browser is not supported. Try again using a different browser or a newer version of your browser.
ms_my: Harap maaf, tetapi versi penyemak imbas anda tidak disokong. Cuba lagi menggunakan penyemak imbas lain atau versi penyemak imbas anda yang lebih baharu.

source: The following errors occurred while processing your registration:
ms_my: Ralat berikut berlaku semasa memproses pendaftaran anda:

source: Sign up with {provider_name}
ms_my: Daftar dengan {provider_name}

source: Create your own {platform_name} account below
ms_my: Buat akaun {platform_name} anda sendiri di bawah

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
ms_my: Medan yang diperlukan dicatat dengan <strong class="indicator">teks tebal dan asterisk (*).</strong>

source: You've successfully signed in with {selected_provider}.
ms_my: Anda telah berjaya melog masuk dengan {selected_provider}.

source: We just need a little more information before you start learning with {platform_name}.
ms_my: Kami hanya memerlukan sedikit lagi maklumat sebelum anda mula belajar dengan {platform_name}.

source: Please complete the following fields to register for an account.
ms_my: Sila lengkapkan medan berikut untuk mendaftar akaun.

source: example: Jane Doe
ms_my: contoh: Jane Doe

source: Your legal name, used for any certificates you earn.
ms_my: Nama sah anda, digunakan untuk sebarang sijil yang anda peroleh.

source: example: JaneDoe
ms_my: contoh: JaneDoe

source: cannot be changed later
ms_my: tidak boleh diubah kemudian

source: Welcome {username}
ms_my: Selamat datang {username}

source: Enter a Public Display Name:
ms_my: Masukkan Nama Paparan Awam:

source: Public Display Name
ms_my: Nama Paparan Awam

source: Additional Personal Information
ms_my: Maklumat Peribadi Tambahan

source: example: New York
ms_my: contoh: New York

source: Highest Level of Education Completed
ms_my: Tahap Pendidikan Tertinggi Tamat

source: Year of Birth
ms_my: Tahun Lahir

source: Please share with us your reasons for registering with {platform_name}
ms_my: Sila kongsi dengan kami sebab anda mendaftar dengan {platform_name}

source: Account Acknowledgements
ms_my: Pengakuan Akaun

source: Preferences for {platform_name}
ms_my: Pilihan untuk {platform_name}

source: Update my {platform_name} Account
ms_my: Kemas kini Akaun {platform_name} saya

source: Processing your account information
ms_my: Memproses maklumat akaun anda

source: Welcome {username}! Please set your preferences below
ms_my: Selamat datang {username}! Sila tetapkan pilihan anda di bawah

source: Required fields are noted by {strong_indicator}bold text and an asterisk (*).{strong_close}
ms_my: Medan yang diperlukan dicatat oleh {strong_indicator}teks tebal dan asterisk (*).{strong_close}

source: Update My Account
ms_my: Kemas kini Akaun Saya

source: Registration Help
ms_my: Bantuan Pendaftaran

source: Already registered?
ms_my: Sudah mendaftar?

source: Next Steps
ms_my: Langkah Seterusnya

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
ms_my: Anda akan menerima e-mel pengaktifan. Anda mesti mengklik pada pautan pengaktifan untuk melengkapkan proses. Tidak melihat e-mel? Semak folder spam anda dan tandai e-mel daripada class.stanford.edu sebagai 'bukan spam', kerana anda pasti mahu menerima e-mel daripada kursus anda.

source: Need Help?
ms_my: Perlukan bantuan?

source: Need help in registering with {platform_name}?
ms_my: Perlukan bantuan dalam mendaftar dengan {platform_name}?

source: View our FAQs for answers to commonly asked questions.
ms_my: Lihat Soalan Lazim kami untuk jawapan kepada soalan lazim.

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
ms_my: Setelah didaftarkan, kebanyakan soalan boleh dijawab dalam forum perbincangan khusus kursus atau melalui Soalan Lazim.

source: Thank you for signing up for {platform_name}.
ms_my: Terima kasih kerana mendaftar untuk {platform_name}.

source: Change your life and start learning today by activating your {platform_name} account. Click on the link below or copy and paste it into your browser's address bar.
ms_my: Ubah hidup anda dan mula belajar hari ini dengan mengaktifkan akaun {platform_name} anda. Klik pada pautan di bawah atau salin dan tampalkannya ke dalam bar alamat penyemak imbas anda.

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the about section of the {platform_name} Courses web site.
ms_my: Jika anda tidak meminta ini, anda tidak perlu melakukan apa-apa; anda tidak akan menerima e-mel lagi daripada kami. Tolong jangan balas e-mel ini; jika anda memerlukan bantuan, semak bahagian tentang tapak web Kursus {platform_name}.

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us at
ms_my: Ini adalah untuk mengesahkan bahawa anda menukar e-mel yang dikaitkan dengan {platform_name} daripada {old_email} kepada {new_email}. Jika anda tidak membuat permintaan ini, sila hubungi kami di

source: We received a request to change the e-mail associated with your {platform_name} account from {old_email} to {new_email}. If this is correct, please confirm your new e-mail address by visiting:
ms_my: Kami menerima permintaan untuk menukar e-mel yang dikaitkan dengan akaun {platform_name} anda daripada {old_email} kepada {new_email}. Jika ini betul, sila sahkan alamat e-mel baharu anda dengan melawati:

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the tech support at {email}
ms_my: Kami minta maaf. Kakitangan kursus kami tidak meluluskan permintaan anda untuk menukar nama anda daripada {old_name} kepada {new_name}. Jika anda memerlukan bantuan lanjut, sila e-mel sokongan teknikal di {email}

source: Put your Terms of Service here!
ms_my: Letakkan Syarat Perkhidmatan anda di sini!

source: Put your Privacy Policy here!
ms_my: Letakkan Dasar Privasi anda di sini!

source: Put your Honor Code here!
ms_my: Letakkan Kod Kehormatan anda di sini!

source: Put your Copyright Text here!
ms_my: Letakkan Teks Hak Cipta anda di sini!

source: Code Editor
ms_my: Editor Kod
