Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Enter true or false. If this value is true, you can hide a subsection until learners earn a minimum score in another, prerequisite subsection.
ms_my: Masukkan benar atau salah. Jika nilai ini benar, anda boleh menyembunyikan subseksyen sehingga pelajar memperoleh markah minimum dalam subseksyen prasyarat yang lain.

source: Course Learning Information
ms_my: Maklumat Pembelajaran Kursus

source: Specify what student can learn from the course.
ms_my: Nyatakan perkara yang pelajar boleh pelajari daripada kursus tersebut.

source: Course Visibility For Unenrolled Learners
ms_my: Keterlihatan Kursus Untuk Pelajar Tidak Mendaftar

source: Video Sharing Options
ms_my: Pilihan Perkongsian Video

source: Force Flexible Grading for Peer ORAs
ms_my: Paksa Penggredan Fleksibel untuk ORA Rakan Sebaya

source: Setting this flag will force on the flexible grading option for all peer-graded ORAs in this course.
ms_my: Menetapkan bendera ini akan memaksa pilihan penggredan fleksibel untuk semua ORA yang digredkan rakan sebaya dalam kursus ini.

source: Course Instructor
ms_my: Pengajar Kursus

source: Enter the details for Course Instructor
ms_my: Masukkan butiran untuk Pengajar Kursus

source: Add Unsupported Problems and Tools
ms_my: Tambah Masalah dan Alat yang Tidak Disokong

source: Enter true or false. If true, you can add unsupported problems and tools to your course in Studio. Unsupported problems and tools are not recommended for use in courses due to non-compliance with one or more of the base requirements, such as testing, accessibility, internationalization, and documentation.
ms_my: Masukkan benar atau salah. Jika benar, anda boleh menambah masalah dan alatan yang tidak disokong pada kursus anda dalam Studio. Masalah dan alatan yang tidak disokong tidak disyorkan untuk digunakan dalam kursus kerana ketidakpatuhan terhadap satu atau lebih keperluan asas, seperti ujian, kebolehcapaian, pengantarabangsaan dan dokumentasi.

source: Highlights Enabled for Messaging
ms_my: Sorotan Didayakan untuk Pemesejan

source: Enter true or false. If true, any highlights associated with content in the course will be messaged to learners at their scheduled time.
ms_my: Masukkan benar atau salah. Jika benar, sebarang sorotan yang dikaitkan dengan kandungan dalam kursus akan dihantar kepada pelajar pada masa yang dijadualkan.

source: Course-wide Custom JS
ms_my: JS Tersuai seluruh kursus

source: Enter Javascript resource URLs you want to be loaded globally throughout the course pages.
ms_my: Masukkan URL sumber Javascript yang anda mahu dimuatkan secara global di seluruh halaman kursus.

source: Course-wide Custom CSS
ms_my: CSS Tersuai seluruh kursus

source: Enter CSS resource URLs you want to be loaded globally throughout the course pages.
ms_my: Masukkan URL sumber CSS yang anda mahu dimuatkan secara global di seluruh halaman kursus.

source: Other Course Settings
ms_my: Tetapan Kursus Lain

source: General
ms_my: Umum

source: Category
ms_my: kategori

source: Week 1
ms_my: Minggu 1

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
ms_my: Nama kategori untuk perbincangan. Nama ini muncul dalam anak tetingkap kiri forum perbincangan untuk kursus.

source: Subcategory
ms_my: Subkategori

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
ms_my: Nama subkategori untuk perbincangan. Nama ini muncul dalam anak tetingkap kiri forum perbincangan untuk kursus.

source: You are not signed in. To view the discussion content, {sign_in_link} or {register_link}, and enroll in this course.
ms_my: Anda tidak dilog masuk. Untuk melihat kandungan perbincangan, {sign_in_link} atau {register_link} dan daftar dalam kursus ini.

source: {assignment_type} = {weighted_percent:.2%} of a possible {weight:.2%}
ms_my: {assignment_type} = {weighted_percent:.2%} daripada kemungkinan {weight:.2%}

source: Generated
ms_my: Dijana

source: {section_type} {index} Unreleased - 0% (?/?)
ms_my: {section_type} {index} Belum Dikeluarkan - 0% (?/?)

source: The lowest {drop_count} {section_type} scores are dropped.
ms_my: Markah {drop_count} {section_type} terendah telah digugurkan.

source: {section_type} Average = {percent:.2%}
ms_my: {section_type} Purata = {percent:.2%}

source: {short_label} Avg
ms_my: {short_label} Purata

source: Html contents to display for this block
ms_my: Kandungan html untuk dipaparkan untuk blok ini

source: Source code for LaTeX documents. This feature is not well-supported.
ms_my: Kod sumber untuk dokumen LaTeX. Ciri ini tidak disokong dengan baik.

source: Select Visual to enter content and have the editor automatically create the HTML. Select Raw to edit HTML directly. If you change this setting, you must save the component and then re-open it for editing.
ms_my: Pilih Visual untuk memasukkan kandungan dan minta editor mencipta HTML secara automatik. Pilih Mentah untuk mengedit HTML secara langsung. Jika anda menukar tetapan ini, anda mesti menyimpan komponen dan kemudian membukanya semula untuk diedit.

source: Raw
ms_my: mentah

source: Hide Page From Learners
ms_my: Sembunyikan Halaman Daripada Pelajar

source: If you select this option, only course team members with the Staff or Admin role see this page.
ms_my: Jika anda memilih pilihan ini, hanya ahli pasukan kursus yang mempunyai peranan Kakitangan atau Pentadbir melihat halaman ini.

source: HTML for the additional pages
ms_my: HTML untuk halaman tambahan

source: List of course update items
ms_my: Senarai item kemas kini kursus

source: Count
ms_my: Kira

source: Enter the number of components to display to each student. Set it to -1 to display all components.
ms_my: Masukkan bilangan komponen untuk dipaparkan kepada setiap pelajar. Tetapkannya kepada -1 untuk memaparkan semua komponen.

source: The problem bank has been configured to show {count} problems. Please specify a positive number of problems, or specify -1 to show all problems.
ms_my: Bank masalah telah dikonfigurasikan untuk menunjukkan {count} masalah. Sila nyatakan bilangan masalah yang positif, atau nyatakan -1 untuk menunjukkan semua masalah.

source: Edit the problem bank configuration.
ms_my: Edit konfigurasi bank bermasalah.

source: The problem bank has been configured to show {count} problems, but only {actual} have been selected.
ms_my: Bank masalah telah dikonfigurasikan untuk menunjukkan {count} masalah, tetapi hanya {actual} telah dipilih.

source: Any Type
ms_my: Mana-mana Jenis

source: Library
ms_my: Perpustakaan

source: Select the library from which you want to draw content.
ms_my: Pilih pustaka dari mana anda ingin melukis kandungan.

source: Library Version
ms_my: Versi Perpustakaan

source: Problem Type
ms_my: Jenis Masalah

source: Source content library has not been specified.
ms_my: Pustaka kandungan sumber belum ditentukan.

source: Content libraries are not available in the current runtime.
ms_my: Pustaka kandungan tidak tersedia dalam masa jalan semasa.

source: Source content library does not exist: {source_library_id}
ms_my: Pustaka kandungan sumber tidak wujud: {source_library_id}

source: This component is out of date. The library has new content.
ms_my: Komponen ini sudah lapuk. Perpustakaan mempunyai kandungan baharu.

source: {refresh_icon} Update now.
ms_my: {refresh_icon} Kemas kini sekarang.

source: Library is invalid, corrupt, or has been deleted.
ms_my: Pustaka tidak sah, rosak atau telah dipadamkan.

source: Edit Library List.
ms_my: Edit Senarai Perpustakaan.

source: This course does not support content libraries. Contact your system administrator for more information.
ms_my: Kursus ini tidak menyokong perpustakaan kandungan. Hubungi pentadbir sistem anda untuk mendapatkan maklumat lanjut.

source: A library has not yet been selected.
ms_my: Sebuah perpustakaan belum lagi dipilih.

source: Select a Library.
ms_my: Pilih Perpustakaan.

source: There are no problems in the specified library of type {capa_type}.
ms_my: Tiada masalah dalam pustaka jenis {capa_type} yang ditentukan.

source: Select another problem type.
ms_my: Pilih jenis masalah lain.

source: The specified library is configured to fetch {count} problem,
ms_my: Pustaka yang ditentukan dikonfigurasikan untuk mengambil {count} masalah,

source: but there is only {actual} matching problem.
ms_my: tetapi terdapat masalah padanan {actual} sahaja.

source: Edit the library configuration.
ms_my: Edit konfigurasi perpustakaan.

source: Invalid Library
ms_my: Perpustakaan tidak sah

source: No Library Selected
ms_my: Tiada Perpustakaan Dipilih

source: Library Display Name
ms_my: Nama Paparan Perpustakaan

source: Enter the names of the advanced components to use in your library.
ms_my: Masukkan nama komponen lanjutan untuk digunakan dalam pustaka anda.

source: The display name for this component. Analytics reports may also use the display name to identify this component.
ms_my: Nama paparan untuk komponen ini. Laporan analitis juga boleh menggunakan nama paparan untuk mengenal pasti komponen ini.

source: LTI ID
ms_my: ID LTI

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.{break_tag}See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ms_my: Masukkan ID LTI untuk pembekal LTI luaran. Nilai ini mestilah ID LTI yang sama yang anda masukkan dalam tetapan LTI Passports pada halaman Tetapan Lanjutan.{break_tag}Lihat {docs_anchor_open}the edX LTI documentation{anchor_close} untuk mendapatkan butiran lanjut tentang tetapan ini.

source: LTI URL
ms_my: URL LTI

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.{break_tag}See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ms_my: Masukkan URL alat luaran yang dilancarkan oleh komponen ini. Tetapan ini hanya digunakan apabila Hide External Tool ditetapkan kepada False.{break_tag}Lihat {docs_anchor_open}the edX LTI documentation{anchor_close} untuk mendapatkan butiran lanjut tentang tetapan ini.

source: Custom Parameters
ms_my: Parameter Tersuai

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component.{break_tag}See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ms_my: Tambahkan pasangan kunci/nilai untuk sebarang parameter tersuai, seperti halaman yang sepatutnya dibuka oleh e-buku anda atau warna latar belakang untuk komponen ini.{break_tag}Lihat {docs_anchor_open}dokumentasi edX LTI{anchor_close} untuk mendapatkan butiran lanjut tentang tetapan ini.

source: Open in New Page
ms_my: Buka dalam Halaman Baharu

source: Select True if you want students to click a link that opens the LTI tool in a new window. Select False if you want the LTI content to open in an IFrame in the current page. This setting is only used when Hide External Tool is set to False.
ms_my: Pilih Benar jika anda mahu pelajar mengklik pautan yang membuka alat LTI dalam tetingkap baharu. Pilih Salah jika anda mahu kandungan LTI dibuka dalam IFrame dalam halaman semasa. Tetapan ini hanya digunakan apabila Hide External Tool ditetapkan kepada False.

source: Scored
ms_my: Menjaringkan gol

source: Select True if this component will receive a numerical score from the external LTI system.
ms_my: Pilih Benar jika komponen ini akan menerima skor berangka daripada sistem LTI luaran.

source: Weight
ms_my: Berat badan

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
ms_my: Masukkan bilangan mata yang mungkin untuk komponen ini. Nilai lalai ialah 1.0. Tetapan ini hanya digunakan apabila Skor ditetapkan kepada Benar.

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
ms_my: Skor disimpan dalam xblock KVS -- pendua skor yang diterbitkan dalam django DB

source: Comment as returned from grader, LTI2.0 spec
ms_my: Komen seperti yang dikembalikan daripada penggred, spesifikasi LTI2.0

source: Hide External Tool
ms_my: Sembunyikan Alat Luaran

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
ms_my: Pilih Benar jika anda ingin menggunakan komponen ini sebagai pemegang tempat untuk menyegerak dengan sistem penggredan luaran dan bukannya melancarkan alat luaran. Tetapan ini menyembunyikan butang Pelancaran dan sebarang IFrames untuk komponen ini.

source: Request user's username
ms_my: Minta nama pengguna pengguna

source: Select True to request the user's username.
ms_my: Pilih Benar untuk meminta nama pengguna pengguna.

source: Request user's email
ms_my: Minta e-mel pengguna

source: Select True to request the user's email address.
ms_my: Pilih Benar untuk meminta alamat e-mel pengguna.

source: LTI Application Information
ms_my: Maklumat Permohonan LTI

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
ms_my: Masukkan perihalan aplikasi pihak ketiga. Jika meminta nama pengguna dan/atau e-mel, gunakan kotak teks ini untuk memaklumkan pengguna mengapa nama pengguna dan/atau e-mel mereka akan dimajukan ke aplikasi pihak ketiga.

source: Button Text
ms_my: Teks Butang

source: Enter the text on the button used to launch the third party application.
ms_my: Masukkan teks pada butang yang digunakan untuk melancarkan aplikasi pihak ketiga.

source: Accept grades past deadline
ms_my: Terima gred melepasi tarikh akhir

source: Select True to allow third party systems to post grades past the deadline.
ms_my: Pilih Benar untuk membenarkan sistem pihak ketiga menyiarkan gred melepasi tarikh akhir.

source: Due Date
ms_my: Tarikh Akhir

source: Enter the default date by which problems are due.
ms_my: Masukkan tarikh lalai yang menyebabkan masalah.

source: Number of Relative Weeks Due By
ms_my: Bilangan Minggu Relatif Ditetapkan Oleh

source: Enter the number of weeks the problems are due by relative to the learner's enrollment date
ms_my: Masukkan bilangan minggu masalah disebabkan oleh relatif kepada tarikh pendaftaran pelajar

source: GIT URL
ms_my: URL GIT

source: Enter the URL for the course data GIT repository.
ms_my: Masukkan URL untuk repositori GIT data kursus.

source: XQA Key
ms_my: Kunci XQA

source: This setting is not currently supported.
ms_my: Tetapan ini tidak disokong pada masa ini.

source: Enter the ids for the content groups this problem belongs to.
ms_my: Masukkan id untuk kumpulan kandungan yang mempunyai masalah ini.

source: Days Early for Beta Users
ms_my: Hari Awal untuk Pengguna Beta

source: Enter the number of days before the start date that beta users can access the course.
ms_my: Masukkan bilangan hari sebelum tarikh mula pengguna beta boleh mengakses kursus.

source: Static Asset Path
ms_my: Laluan Aset Statik

source: Enter the path to use for files on the Files & Uploads page. This value overrides the Studio default, c4x://.
ms_my: Masukkan laluan untuk digunakan untuk fail pada halaman Fail dan Muat Naik. Nilai ini mengatasi lalai Studio, c4x://.

source: Enable LaTeX Compiler
ms_my: Dayakan Pengkompil LaTeX

source: Enter true or false. If true, you can use the LaTeX templates for HTML components and advanced Problem components.
ms_my: Masukkan benar atau salah. Jika benar, anda boleh menggunakan templat LaTeX untuk komponen HTML dan komponen Masalah lanjutan.

source: Enter the maximum number of times a student can try to answer problems. By default, Maximum Attempts is set to null, meaning that students have an unlimited number of attempts for problems. You can override this course-wide setting for individual problems. However, if the course-wide setting is a specific number, you cannot set the Maximum Attempts for individual problems to unlimited.
ms_my: Masukkan bilangan maksimum kali pelajar boleh cuba menjawab masalah. Secara lalai, Percubaan Maksimum ditetapkan kepada batal, bermakna pelajar mempunyai bilangan percubaan yang tidak terhad untuk masalah. Anda boleh mengatasi tetapan seluruh kursus ini untuk masalah individu. Walau bagaimanapun, jika tetapan seluruh kursus ialah nombor tertentu, anda tidak boleh menetapkan Percubaan Maksimum untuk masalah individu kepada tidak terhad.

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use in this course for the specified duration. Do not share the API key with other courses. Notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
ms_my: Masukkan kunci API yang disediakan oleh MathWorks untuk mengakses Perkhidmatan Dihoskan MATLAB. Kunci ini diberikan untuk kegunaan eksklusif dalam kursus ini untuk tempoh yang ditetapkan. Jangan kongsi kunci API dengan kursus lain. Beritahu MathWorks dengan segera jika anda percaya kunci itu terdedah atau terjejas. Untuk mendapatkan kunci kursus anda atau untuk melaporkan isu, sila hubungi moocsupport@mathworks.com

source: Group Configurations
ms_my: Konfigurasi Kumpulan

source: Enter the configurations that govern how students are grouped together.
ms_my: Masukkan konfigurasi yang mengawal cara pelajar dikumpulkan bersama.

source: Enable video caching system
ms_my: Dayakan sistem caching video

source: Enter true or false. If true, video caching will be used for HTML5 videos.
ms_my: Masukkan benar atau salah. Jika benar, caching video akan digunakan untuk video HTML5.

source: Enable video auto-advance
ms_my: Dayakan auto-maju video

source: Specify whether to show an auto-advance button in videos. If the student clicks it, when the last video in a unit finishes it will automatically move to the next unit and autoplay the first video.
ms_my: Tentukan sama ada untuk menunjukkan butang automajukan dalam video. Jika pelajar mengkliknya, apabila video terakhir dalam unit selesai, ia akan beralih secara automatik ke unit seterusnya dan automain video pertama.

source: Video Pre-Roll
ms_my: Pra-Guling Video

source: Identify a video, 5-10 seconds in length, to play before course videos. Enter the video ID from the Video Uploads page and one or more transcript files in the following format: {format}. For example, an entry for a video with two transcripts looks like this: {example}
ms_my: Kenal pasti video, 5-10 saat, untuk dimainkan sebelum video kursus. Masukkan ID video daripada halaman Muat Naik Video dan satu atau lebih fail transkrip dalam format berikut: {format}. Contohnya, entri untuk video dengan dua transkrip kelihatan seperti ini: {example}

source: Show Reset Button for Problems
ms_my: Tunjukkan Butang Tetapkan Semula untuk Masalah

source: Enter true or false. If true, problems in the course default to always displaying a 'Reset' button. You can override this in each problem's settings. All existing problems are affected when this course-wide setting is changed.
ms_my: Masukkan benar atau salah. Jika benar, masalah dalam kursus lalai untuk sentiasa memaparkan butang 'Reset'. Anda boleh mengatasi ini dalam setiap tetapan masalah. Semua masalah sedia ada terjejas apabila tetapan seluruh kursus ini ditukar.

source: Enable Student Notes
ms_my: Dayakan Nota Pelajar

source: Enter true or false. If true, students can use the Student Notes feature.
ms_my: Masukkan benar atau salah. Jika benar, pelajar boleh menggunakan ciri Nota Pelajar.

source: Indicates whether Student Notes are visible in the course. Students can also show or hide their notes in the courseware.
ms_my: Menunjukkan sama ada Nota Pelajar kelihatan dalam kursus. Pelajar juga boleh menunjukkan atau menyembunyikan nota mereka dalam perisian kursus.

source: Tag this block as part of an Entrance Exam section
ms_my: Tandai blok ini sebagai sebahagian daripada bahagian Peperiksaan Kemasukan

source: Enter true or false. If true, answer submissions for problem blocks will be considered in the Entrance Exam scoring/gating algorithm.
ms_my: Masukkan benar atau salah. Jika benar, penyerahan jawapan untuk blok masalah akan dipertimbangkan dalam algoritma pemarkahan/gating Peperiksaan Masuk.

source: Hide from Table of Contents
ms_my: Sembunyikan daripada Jadual Kandungan

source: Enter true or false. If true, this block will be hidden from the Table of Contents.
ms_my: Masukkan benar atau salah. Jika benar, blok ini akan disembunyikan daripada Jadual Kandungan.

source: Error while reading {}. Check file for XML errors.
ms_my: Ralat semasa membaca {}. Semak fail untuk ralat XML.

source: Failed to import block: {} at location: {}
ms_my: Gagal mengimport blok: {} di lokasi: {}

source: Enrollment Track Groups
ms_my: Kumpulan Jejak Pendaftaran

source: Partition for segmenting users by enrollment track
ms_my: Pembahagian untuk membahagikan pengguna mengikut trek pendaftaran

source: Whether this student has voted on the poll
ms_my: Sama ada pelajar ini telah mengundi pada tinjauan pendapat

source: Student answer
ms_my: Jawapan pelajar

source: Poll answers from all students
ms_my: Tinjauan jawapan daripada semua pelajar

source: Poll answers from xml
ms_my: Tinjauan jawapan daripada xml

source: Poll question
ms_my: Soalan tinjauan pendapat

source: Enter the date by which problems are due.
ms_my: Masukkan tarikh masalah berlaku.

source: Hide sequence content After Due Date
ms_my: Sembunyikan kandungan jujukan Selepas Tarikh Tamat

source: If set, the sequence content is hidden for non-staff users after the due date has passed.
ms_my: Jika ditetapkan, kandungan jujukan disembunyikan untuk pengguna bukan kakitangan selepas tarikh tamat tempoh telah berlalu.

source: Is Entrance Exam
ms_my: Adakah Peperiksaan Kemasukan

source: Tag this course block as an Entrance Exam. Note, you must enable Entrance Exams for this course setting to take effect.
ms_my: Tag blok kursus ini sebagai Peperiksaan Kemasukan. Ambil perhatian, anda mesti mendayakan Peperiksaan Kemasukan untuk tetapan kursus ini berkuat kuasa.

source: Is Time Limited
ms_my: Adakah Masa Terhad

source: This setting indicates whether students have a limited time to view or interact with this courseware component.
ms_my: Tetapan ini menunjukkan sama ada pelajar mempunyai masa yang terhad untuk melihat atau berinteraksi dengan komponen perisian kursus ini.

source: Time Limit in Minutes
ms_my: Had Masa dalam Minit

source: The number of minutes available to students for viewing or interacting with this courseware component.
ms_my: Bilangan minit yang tersedia kepada pelajar untuk melihat atau berinteraksi dengan komponen perisian kursus ini.

source: Is Proctoring Enabled
ms_my: Adakah Pengawasan Didayakan

source: This setting indicates whether this exam is a proctored exam.
ms_my: Tetapan ini menunjukkan sama ada peperiksaan ini adalah peperiksaan terkawal.

source: Software Secure Review Rules
ms_my: Peraturan Semakan Selamat Perisian

source: This setting indicates what rules the proctoring team should follow when viewing the videos.
ms_my: Tetapan ini menunjukkan peraturan yang perlu dipatuhi oleh pasukan pengawas semasa menonton video.

source: Is Practice Exam
ms_my: Adakah Peperiksaan Amalan
