Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
ms_my: Fail baharu anda akan dinamakan semula secara automatik agar sepadan dengan fail yang sedia ada. Fail dengan sambungan berbeza tidak dibenarkan.

source: The file may be referenced on other articles. Deleting it means that they will loose their references to this file. The following articles reference this file:
ms_my: Fail boleh dirujuk pada artikel lain. Memadamkannya bermakna mereka akan kehilangan rujukan mereka kepada fail ini. Artikel berikut merujuk fail ini:

source: Delete it!
ms_my: Padamkannya!

source: Remove
ms_my: Alih keluar

source: You can remove a reference to a file, but it will retain its references on other articles.
ms_my: Anda boleh mengalih keluar rujukan kepada fail, tetapi ia akan mengekalkan rujukannya pada artikel lain.

source: Remove reference
ms_my: Alih keluar rujukan

source: History of
ms_my: Sejarah

source: Date
ms_my: tarikh

source: User
ms_my: pengguna

source: File
ms_my: Fail

source: Action
ms_my: Tindakan

source: Download
ms_my: Muat turun

source: Use this!
ms_my: Gunakan ini!

source: Articles using
ms_my: Artikel menggunakan

source: Upload replacement
ms_my: Muat naik pengganti

source: Add file to
ms_my: Tambahkan fail ke

source: Add attachment from other article
ms_my: Tambah lampiran daripada artikel lain

source: Main article
ms_my: Rencana utama

source: Add to article
ms_my: Tambahkan pada artikel

source: Your search did not return any results
ms_my: Carian anda tidak memulangkan sebarang hasil

source: Help
ms_my: Tolong

source: Adding new articles
ms_my: Menambah artikel baharu

source: An external link
ms_my: Pautan luar

source: Headers
ms_my: Pengepala

source: Use these codes for headers and to automatically generate Tables of Contents.
ms_my: Gunakan kod ini untuk pengepala dan untuk menjana Jadual Kandungan secara automatik.

source: Typography
ms_my: Tipografi

source: Lists
ms_my: Senarai

source: Are you sure?
ms_my: Adakah anda pasti?

source: image
ms_my: imej

source: images
ms_my: imej

source: Current revision not set!!
ms_my: Semakan semasa tidak ditetapkan!!

source: image revision
ms_my: semakan imej

source: image revisions
ms_my: semakan imej

source: Images
ms_my: Imej

source: The following images are available for this article. Copy the markdown tag to directly refer to an image from the article text.
ms_my: Imej berikut tersedia untuk artikel ini. Salin teg markdown untuk merujuk terus kepada imej daripada teks artikel.

source: Back to edit page
ms_my: Kembali ke halaman edit

source: No file
ms_my: Tiada fail

source: Upload new image
ms_my: Muat naik imej baharu

source: Restore image
ms_my: Pulihkan imej

source: Remove image
ms_my: Alih keluar imej

source: Completely delete
ms_my: Padam sepenuhnya

source: Revert to this version
ms_my: Kembali ke versi ini

source: There are no images for this article.
ms_my: Tiada imej untuk artikel ini.

source: Purge deletion
ms_my: Bersihkan pemadaman

source: Purge image: Completely remove image file and all revisions.
ms_my: Bersihkan imej: Alih keluar sepenuhnya fail imej dan semua semakan.

source: Remove it completely!
ms_my: Keluarkan sepenuhnya!

source: Image not found
ms_my: Imej tidak ditemui

source: Replace image
ms_my: Gantikan imej

source: Choose an image file to replace current image.
ms_my: Pilih fail imej untuk menggantikan imej semasa.

source: Image id
ms_my: id imej

source: Insert
ms_my: Sisipkan

source: No images found for this article
ms_my: Tiada imej ditemui untuk artikel ini

source: Manage images
ms_my: Urus imej

source: Add new image
ms_my: Tambah imej baharu

source: Add image
ms_my: Tambah imej

source: You do not have permissions to add images.
ms_my: Anda tidak mempunyai kebenaran untuk menambah imej.

source: How to use images
ms_my: Cara menggunakan imej

source: After uploading an image, it is attached to this particular artice and can be used only here. Other users may replace the image, but older versions are kept. You probably want to show the image with a nice caption. To achieve this, press the Insert button and fill in the caption fields and possibly choose to have you image floating right or left of the content. You can use Markdown in the caption. The markdown code syntax for images looks like this, possible values for align are left/center/right:
ms_my: Selepas memuat naik imej, ia dilampirkan pada artikel khusus ini dan hanya boleh digunakan di sini. Pengguna lain boleh menggantikan imej, tetapi versi lama disimpan. Anda mungkin mahu menunjukkan imej dengan kapsyen yang bagus. Untuk mencapai matlamat ini, tekan butang Sisip dan isikan medan kapsyen dan mungkin memilih untuk memberikan anda imej terapung ke kanan atau kiri kandungan. Anda boleh menggunakan Markdown dalam kapsyen. Sintaks kod markdown untuk imej kelihatan seperti ini, nilai yang mungkin untuk penjajaran adalah kiri/tengah/kanan:

source: Links
ms_my: Pautan

source: Link to another wiki page
ms_my: Pautan ke halaman wiki lain

source: Type in something from another wiki page's title and auto-complete will help you create a tag for you wiki link. Tags for links look like this:
ms_my: Taipkan sesuatu daripada tajuk halaman wiki lain dan autolengkap akan membantu anda membuat teg untuk pautan wiki anda. Teg untuk pautan kelihatan seperti ini:

source: You can link to another website simply by inserting an address example.com or http://example.com or by using the markdown syntax:
ms_my: Anda boleh memaut ke tapak web lain hanya dengan memasukkan alamat example.com atau http://example.com atau dengan menggunakan sintaks markdown:

source: Notifications
ms_my: Pemberitahuan

source: When this article is edited
ms_my: Apabila artikel ini disunting

source: Also receive emails about article edits
ms_my: Juga terima e-mel tentang suntingan artikel

source: Your notification settings were updated.
ms_my: Tetapan pemberitahuan anda telah dikemas kini.

source: Your notification settings were unchanged, so nothing saved.
ms_my: Tetapan pemberitahuan anda tidak berubah, jadi tiada apa yang disimpan.

source: notifications
ms_my: pemberitahuan

source: No notifications
ms_my: Tiada pemberitahuan

source: Clear notifications list
ms_my: Kosongkan senarai pemberitahuan

source: Search...
ms_my: Cari...

source: Log in
ms_my: Log masuk

source: Sign up
ms_my: daftar

source: Article deleted
ms_my: Artikel dipadamkan

source: Article Deleted
ms_my: Artikel Dipadamkan

source: The article you were looking for has been deleted.
ms_my: Artikel yang anda cari telah dipadamkan.

source: You may restore this article and its children by clicking restore.
ms_my: Anda boleh memulihkan artikel ini dan anak-anaknya dengan mengklik pulihkan.

source: You may remove this article and any children permanently and free their slugs by clicking the below button. This action cannot be undone.
ms_my: Anda boleh mengalih keluar artikel ini dan mana-mana kanak-kanak secara kekal dan membebaskan slug mereka dengan mengklik butang di bawah. Tindakan ini tidak boleh dibuat asal.

source: Listing articles in
ms_my: Menyenaraikan artikel dalam

source: Up one level
ms_my: Naik satu tingkat

source: Add article
ms_my: Tambah artikel

source: clear
ms_my: jelas

source: article,articles
ms_my: artikel, artikel

source: matches,match
ms_my: perlawanan, perlawanan

source: is,are
ms_my: ialah, ialah

source: Last modified
ms_my: Terakhir diubah suai

source: no log message
ms_my: tiada mesej log

source: Sorry, you don't have permission to view this page.
ms_my: Maaf, anda tiada kebenaran untuk melihat halaman ini.

source: Previewing revision
ms_my: Mempratonton semakan

source: Previewing merge between
ms_my: Pratonton gabungan antara

source: and
ms_my: dan

source: Settings
ms_my: tetapan

source: Source of
ms_my: Sumber daripada

source: This article is currently locked for editing.
ms_my: Artikel ini sedang dikunci untuk diedit.

source: Please log in
ms_my: Sila log masuk

source: Log me in...
ms_my: Log masuk saya...

source: Don't have an account?
ms_my: Tiada akaun?

source: Sign me up...
ms_my: Daftarkan saya...

source: Create root article
ms_my: Buat artikel akar

source: Congratulations!
ms_my: tahniah!

source: You have django-wiki installed... but there are no articles. So it's time to create the first one, the root article. In the beginning, it will only be editable by administrators, but you can define permissions after.
ms_my: Anda telah memasang django-wiki... tetapi tiada artikel. Jadi sudah tiba masanya untuk mencipta yang pertama, artikel akar. Pada mulanya, ia hanya boleh diedit oleh pentadbir, tetapi anda boleh menentukan kebenaran selepas itu.

source: Root article
ms_my: Artikel akar

source: Create root
ms_my: Buat akar

source: You need to log in og sign up to use this function.
ms_my: Anda perlu log masuk dan mendaftar untuk menggunakan fungsi ini.

source: Changes
ms_my: Perubahan

source: View Source
ms_my: Lihat Sumber

source: View
ms_my: Lihat

source: Sub-articles for
ms_my: Sub-artikel untuk

source: No sub-articles
ms_my: Tiada sub-artikel

source: ...and more
ms_my: ...dan banyak lagi

source: Browse articles in this level
ms_my: Semak imbas artikel dalam tahap ini

source: New article next to
ms_my: Artikel baru di sebelah

source: New article below
ms_my: Artikel baru di bawah

source: by
ms_my: oleh

source: restored
ms_my: dipulihkan

source: unlocked
ms_my: tidak berkunci

source: You are now sign up... and now you can sign in!
ms_my: Anda kini mendaftar... dan kini anda boleh log masuk!

source: You are no longer logged in. Bye bye!
ms_my: Anda tidak log masuk lagi. Bye bye!

source: You are now logged in! Have fun!
ms_my: Anda kini telah log masuk! Berseronoklah!

source: There was an error creating this article.
ms_my: Terdapat ralat semasa membuat artikel ini.

source: This article cannot be deleted because it has children or is a root article.
ms_my: Artikel ini tidak boleh dipadamkan kerana ia mempunyai anak atau merupakan artikel akar.

source: This article together with all its contents are now completely gone! Thanks!
ms_my: Artikel ini bersama-sama dengan semua kandungannya kini telah hilang sepenuhnya! Terima kasih!

source: Your changes were saved.
ms_my: Perubahan anda telah disimpan.

source: A new revision of the article was successfully added.
ms_my: Semakan baharu artikel telah berjaya ditambah.

source: Restoring article
ms_my: Memulihkan artikel

source: New title
ms_my: Tajuk baru

source: Once you have verified your identity and reviewed the exam guidelines in Proctortrack, you will be redirected back to this page.
ms_my: Setelah anda mengesahkan identiti anda dan menyemak garis panduan peperiksaan dalam Proctortrack, anda akan dialihkan semula ke halaman ini.

source: To confirm that proctoring has started, make sure your webcam feed and the blue Proctortrack box are both visible on your screen.
ms_my: Untuk mengesahkan bahawa pengawasan telah dimulakan, pastikan suapan kamera web anda dan kotak Proctortrack biru kedua-duanya kelihatan pada skrin anda.

source: Page Not Found
ms_my: Halaman Tidak Ditemui

source: Page not found
ms_my: Halaman tidak ditemui

source: The page that you were looking for was not found.
ms_my: Halaman yang anda cari tidak ditemui.

source: Go back to the {homepage}.
ms_my: Kembali ke {homepage}.

source: {studio_name} Server Error
ms_my: Ralat Pelayan {studio_name}.

source: The {em_start}{studio_name}{em_end} servers encountered an error
ms_my: Pelayan {em_start}{studio_name}{em_end} mengalami ralat

source: An error occurred in {studio_name} and the page could not be loaded. Please try again in a few moments.
ms_my: Ralat berlaku dalam {studio_name} dan halaman tidak dapat dimuatkan. Sila cuba lagi dalam beberapa saat.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
ms_my: Kami telah mencatatkan ralat dan kakitangan kami sedang berusaha untuk menyelesaikan ralat ini secepat mungkin.

source: Studio Accessibility Policy
ms_my: Dasar Kebolehcapaian Studio

source: Files
ms_my: Fail

source: Content
ms_my: kandungan

source: Course Certificates
ms_my: Sijil Kursus

source: This module is not enabled.
ms_my: Modul ini tidak didayakan.

source: This course does not use a mode that offers certificates.
ms_my: Kursus ini tidak menggunakan mod yang menawarkan sijil.

source: Working with Certificates
ms_my: Bekerja dengan Sijil

source: Specify a course title to use on the certificate if the course's official title is too long to be displayed well.
ms_my: Nyatakan tajuk kursus untuk digunakan pada sijil jika tajuk rasmi kursus terlalu panjang untuk dipaparkan dengan baik.

source: For verified certificates, specify between one and four signatories and upload the associated images.
ms_my: Untuk sijil yang disahkan, nyatakan antara satu dan empat penandatangan dan muat naik imej yang berkaitan.

source: To edit or delete a certificate before it is activated, hover over the top right corner of the form and select {em_start}Edit{em_end} or the delete icon.
ms_my: Untuk mengedit atau memadam sijil sebelum ia diaktifkan, tuding pada penjuru kanan sebelah atas borang dan pilih {em_start}Edit{em_end} atau ikon padam.

source: To view a sample certificate, choose a course mode and select {em_start}Preview Certificate{em_end}.
ms_my: Untuk melihat sijil sampel, pilih mod kursus dan pilih {em_start}Pratonton Sijil{em_end}.

source: Issuing Certificates to Learners
ms_my: Mengeluarkan Sijil kepada Pelajar

source: To begin issuing course certificates, a course team member with either the Staff or Admin role selects {em_start}Activate{em_end}. Only course team members with these roles can edit or delete an activated certificate.
ms_my: Untuk mula mengeluarkan sijil kursus, ahli pasukan kursus dengan sama ada Staf atau peranan Pentadbir memilih {em_start}Aktifkan{em_end}. Hanya ahli pasukan kursus dengan peranan ini boleh mengedit atau memadam sijil yang diaktifkan.

source: {em_start}Do not{em_end} delete certificates after a course has started; learners who have already earned certificates will no longer be able to access them.
ms_my: {em_start}Jangan{em_end} padamkan sijil selepas kursus dimulakan; pelajar yang telah memperoleh sijil tidak akan dapat mengaksesnya lagi.

source: Learn more about certificates
ms_my: Ketahui lebih lanjut tentang sijil

source: Details & Schedule
ms_my: Butiran dan Jadual

source: Grading
ms_my: Penggredan

source: Course Team
ms_my: Pasukan Kursus

source: Advanced Settings
ms_my: Tetapan Lanjutan

source: Proctored Exam Settings
ms_my: Tetapan Peperiksaan Terlindung

source: Checklists
ms_my: Senarai semak

source: Tools
ms_my: Alatan

source: Duplicate
ms_my: Pendua

source: Duplicate this component
ms_my: Duplikat komponen ini

source: Move
ms_my: Bergerak

source: Delete this component
ms_my: Padamkan komponen ini

source: Drag to reorder
ms_my: Seret untuk menyusun semula

source: Page Actions
ms_my: Tindakan Halaman

source: Open the courseware in the LMS
ms_my: Buka perisian kursus dalam LMS

source: View Live Version
ms_my: Lihat Versi Langsung

source: Preview the courseware in the LMS
ms_my: Pratonton perisian kursus dalam LMS

source: Collapse All
ms_my: Runtuhkan Semua

source: Adding components
ms_my: Menambah komponen

source: Select a component type under {strong_start}Add New Component{strong_end}. Then select a template.
ms_my: Pilih jenis komponen di bawah {strong_start}Tambah Komponen Baharu{strong_end}. Kemudian pilih templat.

source: The new component is added at the bottom of the page or group. You can then edit and move the component.
ms_my: Komponen baharu ditambahkan di bahagian bawah halaman atau kumpulan. Anda kemudian boleh mengedit dan memindahkan komponen.

source: Editing components
ms_my: Mengedit komponen

source: Click the {strong_start}Edit{strong_end} icon in a component to edit its content.
ms_my: Klik ikon {strong_start}Edit{strong_end} dalam komponen untuk mengedit kandungannya.

source: Reorganizing components
ms_my: Menyusun semula komponen

source: Drag components to new locations within this component.
ms_my: Seret komponen ke lokasi baharu dalam komponen ini.

source: For content experiments, you can drag components to other groups.
ms_my: Untuk percubaan kandungan, anda boleh menyeret komponen ke kumpulan lain.

source: Working with content experiments
ms_my: Bekerja dengan eksperimen kandungan

source: Confirm that you have properly configured content in each of your experiment groups.
ms_my: Sahkan bahawa anda telah mengkonfigurasi kandungan dengan betul dalam setiap kumpulan percubaan anda.

source: Learn more about component containers
ms_my: Ketahui lebih lanjut tentang bekas komponen

source: Unit Location
ms_my: Lokasi Unit

source: Location ID
ms_my: ID lokasi

source: To create a link to this unit from an HTML component in this course, enter {unit_link} as the URL value.
ms_my: Untuk membuat pautan ke unit ini daripada komponen HTML dalam kursus ini, masukkan {unit_link} sebagai nilai URL.

source: Create a Course Rerun of:
ms_my: Buat Tayangan Semula Kursus:

source: Create a re-run of a course
ms_my: Buat larian semula kursus

source: You are creating a re-run from:
ms_my: Anda sedang membuat larian semula daripada:

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
ms_my: Menyediakan maklumat pengenalpastian untuk kursus ini dijalankan semula. Kursus asal tidak terjejas dalam apa-apa cara oleh larian semula.

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
ms_my: Nota: Bersama-sama, organisasi, nombor kursus dan kursus berjalan mesti mengenal pasti secara unik contoh kursus baharu ini.

source: Required Information to Create a re-run of a course
ms_my: Maklumat yang Diperlukan untuk Membuat tayangan semula kursus

source: Course Name
ms_my: Nama Kursus

source: e.g. Introduction to Computer Science
ms_my: cth. Pengenalan kepada Sains Komputer

source: The public display name for the new course. (This name is often the same as the original course name.)
ms_my: Nama paparan awam untuk kursus baharu. (Nama ini selalunya sama dengan nama kursus asal.)

source: Organization
ms_my: Organisasi

source: e.g. UniversityX or OrganizationX
ms_my: cth. UniversitiX atau OrganizationX

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
ms_my: Nama organisasi yang menaja kursus baru. (Nama ini selalunya sama dengan nama organisasi asal.)

source: Note: No spaces or special characters are allowed.
ms_my: Nota: Tiada ruang atau aksara khas dibenarkan.

source: Course Number
ms_my: Nombor Kursus

source: e.g. CS101
ms_my: cth. CS101

source: The unique number that identifies the new course within the organization. (This number will be the same as the original course number and cannot be changed.)
ms_my: Nombor unik yang mengenal pasti kursus baharu dalam organisasi. (Nombor ini akan sama dengan nombor kursus asal dan tidak boleh diubah.)

source: e.g. 2014_T1
ms_my: cth. 2014_T1

source: The term in which the new course will run. (This value is often different than the original course run value.)
ms_my: Istilah di mana kursus baru akan dijalankan. (Nilai ini selalunya berbeza daripada nilai larian kursus asal.)

source: Create Re-run
ms_my: Cipta Jalankan Semula

source: When will my course re-run start?
ms_my: Bilakah kursus saya akan dijalankan semula?

source: The new course is set to start on January 1, 2030 at midnight (UTC).
ms_my: Kursus baharu ini ditetapkan untuk bermula pada 1 Januari 2030 pada tengah malam (UTC).

source: What transfers from the original course?
ms_my: Apakah pemindahan dari kursus asal?

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
ms_my: Kursus baharu ini mempunyai rangka kursus dan kandungan yang sama seperti kursus asal. Semua masalah, video, pengumuman dan fail lain diduplikasi kepada kursus baharu.

source: What does not transfer from the original course?
ms_my: Apa yang tidak dipindahkan dari kursus asal?

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
ms_my: Anda adalah satu-satunya ahli kakitangan kursus baharu itu. Tiada pelajar didaftarkan dalam kursus dan tiada data pelajar. Tiada kandungan dalam topik perbincangan atau wiki.

source: Learn more about Course Re-runs
ms_my: Ketahui lebih lanjut tentang Kursus Larian Semula

source: Course Updates
ms_my: Kemas Kini Kursus

source: New Update
ms_my: Kemas Kini Baharu

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
ms_my: Gunakan kemas kini kursus untuk memberitahu pelajar tentang tarikh atau peperiksaan penting, menyerlahkan perbincangan tertentu dalam forum, mengumumkan perubahan jadual dan menjawab soalan pelajar. Anda menambah atau mengedit kemas kini dalam HTML.

source: Course Outline
ms_my: Rangka Kursus

source: This course was created as a re-run. Some manual configuration is needed.
ms_my: Kursus ini dibuat sebagai larian semula. Beberapa konfigurasi manual diperlukan.

source: No course content is currently visible, and no learners are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
ms_my: Tiada kandungan kursus kelihatan pada masa ini dan tiada pelajar didaftarkan. Pastikan anda menyemak dan menetapkan semula semua tarikh, termasuk Tarikh Mula Kursus; menubuhkan pasukan kursus; menyemak kemas kini kursus dan aset lain untuk bahan bertarikh; dan benih perbincangan dan wiki.

source: This course run is using an upgraded version of edx discussion forum. In order to display the discussions sidebar, discussions xBlocks will no longer be visible to learners.
ms_my: Kursus ini dijalankan menggunakan versi forum perbincangan edx yang dipertingkatkan. Untuk memaparkan bar sisi perbincangan, perbincangan xBlocks tidak akan kelihatan kepada pelajar lagi.

source: Learn more
ms_my: Ketahui lebih lanjut

source: Share feedback
ms_my: Kongsi maklum balas

source: Warning
ms_my: Amaran

source: This course uses features that are no longer supported.
ms_my: Kursus ini menggunakan ciri yang tidak lagi disokong.

source: You must delete or replace the following components.
ms_my: Anda mesti memadam atau menggantikan komponen berikut.

source: Unsupported Components
ms_my: Komponen Tidak Disokong

source: Deprecated Component
ms_my: Komponen Dihentikan

source: Unsupported Advance Modules
ms_my: Modul Pendahuluan Tidak Disokong

source: This course has proctored exam settings that are incomplete or invalid.
ms_my: Kursus ini mempunyai tetapan peperiksaan terkawal yang tidak lengkap atau tidak sah.

source: To update these settings go to the {link_start}Proctored Exam Settings page{link_end}.
ms_my: Untuk mengemas kini tetapan ini pergi ke {link_start}halaman Tetapan Peperiksaan Terlindung{link_end}.

source: To update these settings go to the {link_start}Advanced Settings page{link_end}.
ms_my: Untuk mengemas kini tetapan ini pergi ke {link_start}halaman Tetapan Lanjutan{link_end}.

source: Proctoring Settings Errors
ms_my: Ralat Tetapan Proctoring
