Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: Error generating proctored exam results. Please try again.
ms_my: Ralat menjana keputusan peperiksaan terkawal. Sila cuba lagi.

source: Error generating survey results. Please try again.
ms_my: Ralat menjana hasil tinjauan. Sila cuba lagi.

source: Error generating student profile information. Please try again.
ms_my: Ralat menjana maklumat profil pelajar. Sila cuba lagi.

source: Loading
ms_my: Memuatkan

source: Error getting student list.
ms_my: Ralat mendapatkan senarai pelajar.

source: Error generating list of students who may enroll. Please try again.
ms_my: Ralat menjana senarai pelajar yang mungkin mendaftar. Sila cuba lagi.

source: Error retrieving grading configuration.
ms_my: Ralat mendapatkan semula konfigurasi penggredan.

source: Error generating grades. Please try again.
ms_my: Ralat menjana gred. Sila cuba lagi.

source: Error generating problem grade report. Please try again.
ms_my: Ralat menjana laporan gred masalah. Sila cuba lagi.

source: Error generating ORA data report. Please try again.
ms_my: Ralat menjana laporan data ORA. Sila cuba lagi.

source: There was a problem creating the report. Select "Create Executive Summary" to try again.
ms_my: Terdapat masalah membuat laporan. Pilih "Buat Ringkasan Eksekutif" untuk mencuba lagi.

source: Enter the enrollment code.
ms_my: Masukkan kod pendaftaran.

source: Cancel enrollment code
ms_my: Batalkan kod pendaftaran

source: Restore enrollment code
ms_my: Pulihkan kod pendaftaran

source: Mark enrollment code as unused
ms_my: Tandai kod pendaftaran sebagai tidak digunakan

source: Username
ms_my: Nama pengguna

source: Email
ms_my: E-mel

source: Revoke access
ms_my: Batalkan akses

source: Group
ms_my: Kumpulan

source: Enter username or email
ms_my: Masukkan nama pengguna atau e-mel

source: Please enter a username or email.
ms_my: Sila masukkan nama pengguna atau e-mel.

source: This role requires a divided discussions scheme.
ms_my: Peranan ini memerlukan skema perbincangan yang dibahagikan.

source: Error changing user's permissions.
ms_my: Ralat menukar kebenaran pengguna.

source: Could not find a user with username or email address '<%- identifier %>'.
ms_my: Tidak dapat mencari pengguna dengan nama pengguna atau alamat e-mel '<%- identifier %>'.

source: Error: You cannot remove yourself from the Instructor group!
ms_my: Ralat: Anda tidak boleh mengalih keluar diri anda daripada kumpulan Pengajar!

source: Errors
ms_my: ralat

source: The following errors were generated:
ms_my: Ralat berikut telah dihasilkan:

source: Warnings
ms_my: Amaran

source: The following warnings were generated:
ms_my: Amaran berikut telah dihasilkan:

source: Success
ms_my: Kejayaan

source: All accounts were created successfully.
ms_my: Semua akaun berjaya dibuat.

source: Error adding/removing users as beta testers.
ms_my: Ralat menambah/mengalih keluar pengguna sebagai penguji beta.

source: This field must not be blank
ms_my: Medan ini tidak boleh kosong

source: These users were successfully added as beta testers:
ms_my: Pengguna ini telah berjaya ditambahkan sebagai penguji beta:

source: These users could not be added as beta testers because their accounts are not yet activated:
ms_my: Pengguna ini tidak dapat ditambahkan sebagai penguji beta kerana akaun mereka belum diaktifkan:

source: These users were successfully removed as beta testers:
ms_my: Pengguna ini berjaya dialih keluar sebagai penguji beta:

source: These users were not added as beta testers:
ms_my: Pengguna ini tidak ditambahkan sebagai penguji beta:

source: These users were not removed as beta testers:
ms_my: Pengguna ini tidak dialih keluar sebagai penguji beta:

source: Could not find users associated with the following identifiers:
ms_my: Tidak dapat mencari pengguna yang dikaitkan dengan pengecam berikut:

source: Users must create and activate their account before they can be promoted to beta tester.
ms_my: Pengguna mesti membuat dan mengaktifkan akaun mereka sebelum mereka boleh dinaikkan pangkat kepada penguji beta.

source: Reason field should not be left blank.
ms_my: Medan sebab tidak boleh dibiarkan kosong.

source: Error enrolling/unenrolling users.
ms_my: Ralat semasa mendaftar/menyahdaftar pengguna.

source: The following email addresses and/or usernames are invalid:
ms_my: Alamat e-mel dan/atau nama pengguna berikut adalah tidak sah:

source: Successfully enrolled and sent email to the following users:
ms_my: Berjaya mendaftar dan menghantar e-mel kepada pengguna berikut:

source: Successfully enrolled the following users:
ms_my: Berjaya mendaftarkan pengguna berikut:

source: Email cannot be sent to the following users via batch enrollment. They will be allowed to enroll once they register:
ms_my: E-mel tidak boleh dihantar kepada pengguna berikut melalui pendaftaran kelompok. Mereka akan dibenarkan mendaftar sebaik sahaja mereka mendaftar:

source: These users will be allowed to enroll once they register:
ms_my: Pengguna ini akan dibenarkan untuk mendaftar setelah mereka mendaftar:

source: Email cannot be sent to the following users via batch enrollment. They will be enrolled once they register:
ms_my: E-mel tidak boleh dihantar kepada pengguna berikut melalui pendaftaran kelompok. Mereka akan didaftarkan sebaik sahaja mereka mendaftar:

source: These users will be enrolled once they register:
ms_my: Pengguna ini akan didaftarkan sebaik sahaja mereka mendaftar:

source: Emails successfully sent. The following users are no longer enrolled in the course:
ms_my: E-mel berjaya dihantar. Pengguna berikut tidak lagi mendaftar dalam kursus:

source: The following users are no longer enrolled in the course:
ms_my: Pengguna berikut tidak lagi mendaftar dalam kursus:

source: These users were not affiliated with the course so could not be unenrolled:
ms_my: Pengguna ini tidak bergabung dengan kursus jadi tidak boleh dibatalkan pendaftaran:

source: Your message must have a subject.
ms_my: Mesej anda mesti mempunyai subjek.

source: Your message cannot be blank.
ms_my: Mesej anda tidak boleh kosong.

source: Your message must have at least one target.
ms_my: Mesej anda mesti mempunyai sekurang-kurangnya satu sasaran.

source: There are invalid keywords in your email. Check the following keywords and try again.
ms_my: Terdapat kata kunci yang tidak sah dalam e-mel anda. Semak kata kunci berikut dan cuba lagi.

source: Yourself
ms_my: diri sendiri

source: Everyone who has staff privileges in this course
ms_my: Setiap orang yang mempunyai keistimewaan kakitangan dalam kursus ini

source: All learners who are enrolled in this course
ms_my: Semua pelajar yang mendaftar dalam kursus ini

source: All learners in the {cohort_name} cohort
ms_my: Semua pelajar dalam kohort {cohort_name}.

source: All learners in the {track_name} track
ms_my: Semua pelajar dalam trek {track_name}.

source: Your email message was successfully queued for sending. In courses with a large number of learners, email messages to learners might take up to an hour to be sent.
ms_my: Mesej e-mel anda telah berjaya dalam baris gilir untuk dihantar. Dalam kursus dengan bilangan pelajar yang ramai, mesej e-mel kepada pelajar mungkin mengambil masa sehingga satu jam untuk dihantar.

source: You are sending an email message with the subject {subject} to the following recipients.
ms_my: Anda sedang menghantar mesej e-mel dengan subjek {subject} kepada penerima berikut.

source: Is this OK?
ms_my: Adakah ini OK?

source: Error sending email.
ms_my: Ralat menghantar e-mel.

source: There is no email history for this course.
ms_my: Tiada sejarah e-mel untuk kursus ini.

source: There was an error obtaining email task history for this course.
ms_my: Terdapat ralat mendapatkan sejarah tugasan e-mel untuk kursus ini.

source: There was an error obtaining email content history for this course.
ms_my: Terdapat ralat mendapatkan sejarah kandungan e-mel untuk kursus ini.

source: Send to:
ms_my: Hantar kepada:

source: Please enter a student email address or username.
ms_my: Sila masukkan alamat e-mel atau nama pengguna pelajar.

source: Error getting enrollment status for '<%- student_id %>'. Make sure that the student identifier is spelled correctly.
ms_my: Ralat mendapatkan status pendaftaran untuk '<%- student_id %>'. Pastikan pengecam pelajar dieja dengan betul.

source: Retrieving enrollment status...
ms_my: Mendapatkan semula status pendaftaran...

source: Error getting student progress url for '<%- student_id %>'. Make sure that the student identifier is spelled correctly.
ms_my: Ralat mendapatkan url kemajuan pelajar untuk '<%- student_id %>'. Pastikan pengecam pelajar dieja dengan betul.

source: Please enter a problem location.
ms_my: Sila masukkan lokasi masalah.

source: Success! Problem attempts reset for problem '<%- problem_id %>' and student '<%- student_id %>'.
ms_my: Berjaya! Percubaan masalah ditetapkan semula untuk masalah '<%- problem_id %>' dan pelajar '<%- student_id %>'.

source: Error resetting problem attempts for problem '<%- problem_id %>' and student '<%- student_id %>'. Make sure that the problem and student identifiers are complete and correct.
ms_my: Ralat semasa menetapkan semula percubaan masalah untuk masalah '<%- problem_id %>' dan pelajar '<%- student_id %>'. Pastikan masalah dan pengecam pelajar adalah lengkap dan betul.

source: Delete student '<%- student_id %>'s state on problem '<%- problem_id %>'?
ms_my: Padam keadaan pelajar '<%- student_id %>' pada masalah '<%- problem_id %>'?

source: Error deleting student '<%- student_id %>'s state on problem '<%- problem_id %>'. Make sure that the problem and student identifiers are complete and correct.
ms_my: Ralat semasa memadam keadaan pelajar '<%- student_id %>' pada masalah '<%- problem_id %>'. Pastikan masalah dan pengecam pelajar adalah lengkap dan betul.

source: Module state successfully deleted.
ms_my: Keadaan modul berjaya dipadamkan.

source: Error getting task history for problem '<%- problem_id %>' and student '<%- student_id %>'. Make sure that the problem and student identifiers are complete and correct.
ms_my: Ralat mendapatkan sejarah tugasan untuk masalah '<%- problem_id %>' dan pelajar '<%- student_id %>'. Pastikan masalah dan pengecam pelajar adalah lengkap dan betul.

source: Entrance exam attempts is being reset for student '{student_id}'.
ms_my: Percubaan peperiksaan kemasukan sedang ditetapkan semula untuk pelajar '{student_id}'.

source: Error resetting entrance exam attempts for student '{student_id}'. Make sure student identifier is correct.
ms_my: Ralat semasa menetapkan semula percubaan peperiksaan masuk untuk pelajar '{student_id}'. Pastikan pengecam pelajar adalah betul.

source: Enter a student's username or email address.
ms_my: Masukkan nama pengguna atau alamat e-mel pelajar.

source: Do you want to allow this student ('{student_id}') to skip the entrance exam?
ms_my: Adakah anda mahu membenarkan pelajar ini ('{student_id}') melangkau peperiksaan kemasukan?

source: An error occurred. Make sure that the student's username or email address is correct and try again.
ms_my: Ralat berlaku. Pastikan nama pengguna atau alamat e-mel pelajar adalah betul dan cuba lagi.

source: Entrance exam state is being deleted for student '{student_id}'.
ms_my: Keadaan peperiksaan kemasukan sedang dipadamkan untuk pelajar '{student_id}'.

source: Error deleting entrance exam state for student '{student_id}'. Make sure student identifier is correct.
ms_my: Ralat memadamkan keadaan peperiksaan kemasukan untuk pelajar '{student_id}'. Pastikan pengecam pelajar adalah betul.

source: Error getting entrance exam task history for student '{student_id}'. Make sure student identifier is correct.
ms_my: Ralat mendapatkan sejarah tugas peperiksaan kemasukan untuk pelajar '{student_id}'. Pastikan pengecam pelajar adalah betul.

source: Reset attempts for all students on problem '<%- problem_id %>'?
ms_my: Tetapkan semula percubaan untuk semua pelajar tentang masalah '<%- problem_id %>'?

source: Successfully started task to reset attempts for problem '<%- problem_id %>'. Click the 'Show Task Status' button to see the status of the task.
ms_my: Berjaya memulakan tugas untuk menetapkan semula percubaan untuk masalah '<%- problem_id %>'. Klik butang 'Tunjukkan Status Tugas' untuk melihat status tugasan.

source: Error starting a task to reset attempts for all students on problem '<%- problem_id %>'. Make sure that the problem identifier is complete and correct.
ms_my: Ralat memulakan tugas untuk menetapkan semula percubaan untuk semua pelajar tentang masalah '<%- problem_id %>'. Pastikan pengecam masalah lengkap dan betul.

source: Error listing task history for this student and problem.
ms_my: Ralat menyenaraikan sejarah tugasan untuk pelajar dan masalah ini.

source: Started rescore problem task for problem '<%- problem_id %>' and student '<%- student_id %>'. Click the 'Show Task Status' button to see the status of the task.
ms_my: Memulakan tugasan masalah skor untuk masalah '<%- problem_id %>' dan pelajar '<%- student_id %>'. Klik butang 'Tunjukkan Status Tugas' untuk melihat status tugasan.

source: Error starting a task to rescore problem '<%- problem_id %>' for student '<%- student_id %>'. Make sure that the the problem and student identifiers are complete and correct.
ms_my: Ralat memulakan tugas untuk menjaringkan semula masalah '<%- problem_id %>' untuk pelajar '<%- student_id %>'. Pastikan masalah dan pengecam pelajar adalah lengkap dan betul.

source: Please enter a score.
ms_my: Sila masukkan markah.

source: Started task to override the score for problem '<%- problem_id %>' and student '<%- student_id %>'. Click the 'Show Task Status' button to see the status of the task.
ms_my: Memulakan tugas untuk mengatasi markah untuk masalah '<%- problem_id %>' dan pelajar '<%- student_id %>'. Klik butang 'Tunjukkan Status Tugas' untuk melihat status tugasan.

source: Error starting a task to override score for problem '<%- problem_id %>' for student '<%- student_id %>'. Make sure that the the score and the problem and student identifiers are complete and correct.
ms_my: Ralat memulakan tugas untuk mengatasi markah untuk masalah '<%- problem_id %>' untuk pelajar '<%- student_id %>'. Pastikan markah dan masalah dan pengecam pelajar adalah lengkap dan betul.

source: Started entrance exam rescore task for student '{student_id}'. Click the 'Show Task Status' button to see the status of the task.
ms_my: Memulakan tugas markah peperiksaan kemasukan untuk pelajar '{student_id}'. Klik butang 'Tunjukkan Status Tugas' untuk melihat status tugasan.

source: Error starting a task to rescore entrance exam for student '{student_id}'. Make sure that entrance exam has problems in it and student identifier is correct.
ms_my: Ralat semasa memulakan tugas untuk menilai semula peperiksaan kemasukan pelajar '{student_id}'. Pastikan peperiksaan kemasukan mempunyai masalah dan pengecam pelajar adalah betul.

source: Rescore problem '<%- problem_id %>' for all students?
ms_my: Masalah skor semula '<%- problem_id %>' untuk semua pelajar?

source: Successfully started task to rescore problem '<%- problem_id %>' for all students. Click the 'Show Task Status' button to see the status of the task.
ms_my: Berjaya memulakan tugas untuk menjaringkan semula masalah '<%- problem_id %>' untuk semua pelajar. Klik butang 'Tunjukkan Status Tugas' untuk melihat status tugasan.

source: Error starting a task to rescore problem '<%- problem_id %>'. Make sure that the problem identifier is complete and correct.
ms_my: Ralat memulakan tugas untuk menjaringkan semula masalah '<%- problem_id %>'. Pastikan pengecam masalah lengkap dan betul.

source: Task Type
ms_my: Jenis Tugas

source: Task inputs
ms_my: Input tugas

source: Task ID
ms_my: ID tugas

source: Requester
ms_my: Peminta

source: Submitted
ms_my: diserahkan

source: Duration (sec)
ms_my: Tempoh (saat)

source: State
ms_my: negeri

source: Task Status
ms_my: Status Tugas

source: Task Progress
ms_my: Kemajuan Tugas

source: An error occurred retrieving your email. Please try again later, and contact technical support if the problem persists.
ms_my: Ralat berlaku semasa mendapatkan semula e-mel anda. Sila cuba lagi kemudian, dan hubungi sokongan teknikal jika masalah berterusan.

source: Sent By
ms_my: Dihantar Oleh

source: Sent To
ms_my: Dihantar Kepada

source: Time Sent
ms_my: Masa Dihantar

source: Number Sent
ms_my: Nombor Dihantar

source: Copy Email To Editor
ms_my: Salin E-mel Kepada Editor

source: Subject:
ms_my: Subjek:

source: Sent By:
ms_my: Dihantar Oleh:

source: Time Sent:
ms_my: Masa Dihantar:

source: Sent To:
ms_my: Dihantar Kepada:

source: Message:
ms_my: Mesej:

source: No tasks currently running.
ms_my: Tiada tugas yang sedang dijalankan.

source: File Name
ms_my: Nama Fail

source: Links are generated on demand and expire within 5 minutes due to the sensitive nature of student information.
ms_my: Pautan dijana atas permintaan dan tamat tempoh dalam masa 5 minit kerana sifat sensitif maklumat pelajar.

source: You have access to the {enterpriseName} dashboard
ms_my: Anda mempunyai akses kepada papan pemuka {enterpriseName}.

source: To access the courses available to you through {enterpriseName}, visit the {enterpriseName} dashboard.
ms_my: Untuk mengakses kursus yang tersedia untuk anda melalui {enterpriseName}, lawati papan pemuka {enterpriseName}.

source: Go to dashboard
ms_my: Pergi ke papan pemuka

source: (Self-paced) Starts {start}
ms_my: (Sendiri) Bermula {start}

source: (Self-paced) Started {start}
ms_my: (Sendiri) Bermula {start}

source: (Self-paced) Ends {end}
ms_my: (Sendiri) Tamat {end}

source: (Self-paced) Ended {end}
ms_my: (Sendiri) Tamat {end}

source: Starts {start}
ms_my: Bermula {mula}

source: Started {start}
ms_my: Bermula {mula}

source: Ends {end}
ms_my: Tamat {end}

source: You must select a session to access the course.
ms_my: Anda mesti memilih sesi untuk mengakses kursus.

source: There was an error. Please reload the page and try again.
ms_my: Terdapat ralat. Sila muat semula halaman dan cuba lagi.

source: Change Session
ms_my: Tukar Sesi

source: Select Session
ms_my: Pilih Sesi

source: Leave Current Session
ms_my: Tinggalkan Sesi Semasa

source: Are you sure you want to select this session?
ms_my: Adakah anda pasti mahu memilih sesi ini?

source: Are you sure you want to change to a different session?
ms_my: Adakah anda pasti mahu menukar kepada sesi lain?

source: Any course progress or grades from your current session will be lost.
ms_my: Sebarang kemajuan kursus atau gred daripada sesi semasa anda akan hilang.

source: Are you sure that you want to leave this session?
ms_my: Adakah anda pasti mahu meninggalkan sesi ini?

source: Your unenrollment request could not be processed. Please try again later.
ms_my: Permintaan pembatalan pendaftaran anda tidak dapat diproses. Sila cuba lagi kemudian.

source: Are you sure you want to unenroll from {courseName} ({courseNumber})? You will be refunded the amount you paid.
ms_my: Adakah anda pasti mahu membatalkan pendaftaran daripada {courseName} ({courseNumber})? Anda akan dikembalikan jumlah yang anda bayar.

source: {type} Progress
ms_my: {type} Kemajuan

source: Earned Certificates
ms_my: Sijil Diperolehi

source: Enrolled
ms_my: Didaftarkan

source: Successfully reset the attempts for user {user}
ms_my: Berjaya menetapkan semula percubaan untuk pengguna {user}

source: Failed to reset attempts for user.
ms_my: Gagal menetapkan semula percubaan untuk pengguna.

source: Successfully deleted student state for user {user}
ms_my: Berjaya memadamkan keadaan pelajar untuk pengguna {user}

source: Failed to delete student state for user.
ms_my: Gagal memadamkan keadaan pelajar untuk pengguna.

source: Successfully rescored problem for user {user}
ms_my: Berjaya memulihkan masalah untuk pengguna {user}

source: Failed to rescore problem for user.
ms_my: Gagal menjaringkan semula masalah untuk pengguna.

source: Successfully rescored problem to improve score for user {user}
ms_my: Berjaya memulihkan masalah untuk meningkatkan skor untuk pengguna {user}

source: Failed to rescore problem to improve score for user.
ms_my: Gagal menjaringkan semula masalah untuk meningkatkan skor untuk pengguna.

source: Successfully overrode problem score for {user}
ms_my: Berjaya mengatasi markah masalah untuk {user}

source: Could not override problem score for {user}.
ms_my: Tidak dapat mengatasi markah masalah untuk {user}.

source: Enter and confirm your new password.
ms_my: Masukkan dan sahkan kata laluan baharu anda.

source: New Password
ms_my: Kata laluan baharu

source: Confirm Password
ms_my: Sahkan kata laluan

source: Passwords do not match.
ms_my: Kata laluan tidak sepadan

source: Reset My Password
ms_my: Tetapkan Semula Kata Laluan Saya

source: Reset Your Password
ms_my: Tetapkan Semula Kata Laluan Anda

source: Error:
ms_my: Ralat:

source: You may also lose access to verified certificates and other program credentials. You can make a copy of these for your records before proceeding with deletion.
ms_my: Anda juga mungkin kehilangan akses kepada sijil yang disahkan dan kelayakan program lain. Anda boleh membuat salinan ini untuk rekod anda sebelum meneruskan pemadaman.

source: Before proceeding, please {htmlStart}unlink all social media accounts{htmlEnd}.
ms_my: Sebelum meneruskan, sila {htmlStart}nyahpaut semua akaun media sosial{htmlEnd}.

source: Before proceeding, please {htmlStart}{emailMsg}{htmlEnd}.
ms_my: Sebelum meneruskan, sila {htmlStart}{emailMsg}{htmlEnd}.

source: {htmlStart}Want to change your email, name, or password instead?{htmlEnd}
ms_my: {htmlStart}Mahu menukar e-mel, nama atau kata laluan anda?{htmlTamat}

source: {strongStart}Warning: Account deletion is permanent.{strongEnd} Please read the above carefully before proceeding. This is an irreversible action, and {strongStart}you will no longer be able to use the same email on {platformName}.{strongEnd}
ms_my: {strongStart}Amaran: Pemadaman akaun adalah kekal.{strongEnd} Sila baca di atas dengan teliti sebelum meneruskan. Ini ialah tindakan yang tidak boleh diterbalikkan dan {strongStart}anda tidak lagi boleh menggunakan e-mel yang sama pada {platformName}.{strongEnd}

source: Please note: Deletion of your account and personal data is permanent and cannot be undone. {platformName} will not be able to recover your account or the data that is deleted.
ms_my: Sila ambil perhatian: Pemadaman akaun dan data peribadi anda adalah kekal dan tidak boleh dibuat asal. {platformName} tidak akan dapat memulihkan akaun anda atau data yang dipadamkan.

source: Once your account is deleted, you cannot use it to take courses on the {platformName} app, {siteName}, or any other site hosted by {platformName}.
ms_my: Setelah akaun anda dipadamkan, anda tidak boleh menggunakannya untuk mengikuti kursus pada apl {platformName}, {siteName} atau mana-mana tapak lain yang dihoskan oleh {platformName}.

source: This includes access to {siteName} from your employer’s or university’s system{additionalSiteSpecificDeletionText}.
ms_my: Ini termasuk akses kepada {siteName} daripada sistem majikan atau universiti anda{additionalSiteSpecificDeletionText}.

source: We’re sorry to see you go!
ms_my: Kami kesal melihat anda pergi!

source: Delete My Account
ms_my: Padam Akaun Saya

source: Password is incorrect
ms_my: Kata laluan tidak betul

source: Unable to delete account
ms_my: Tidak dapat memadam akaun

source: Please re-enter your password.
ms_my: Sila masukkan semula kata laluan anda.

source: Sorry, there was an error trying to process your request. Please try again later.
ms_my: Maaf, terdapat ralat semasa cuba memproses permintaan anda. Sila cuba lagi kemudian.

source: A Password is required
ms_my: Kata laluan diperlukan
