Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: We hope you're enjoying {start_strong}{course_name}{end_strong}! We want to let you know what you can look forward to in week {week_num}:
ms_my: Kami harap anda menikmati {start_strong}{course_name}{end_strong}! Kami ingin memberitahu anda perkara yang anda boleh nantikan dalam minggu {week_num}:

source: With self-paced courses, you learn on your own schedule. We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
ms_my: Dengan kursus kendiri, anda belajar mengikut jadual anda sendiri. Kami menggalakkan anda meluangkan masa dengan kursus setiap minggu. Perhatian tertumpu anda akan membuahkan hasil pada akhirnya!

source: Resume your course now
ms_my: Sambung semula kursus anda sekarang

source: We hope you're enjoying %(course_name)s! We want to let you know what you can look forward to in week %(week_num)s:
ms_my: Kami harap anda menikmati %(course_name)s! Kami ingin memberitahu anda perkara yang anda boleh nantikan dalam minggu %(week_num)s:

source: Welcome to week %(week_num)s
ms_my: Selamat datang ke minggu %(week_num)s

source: We hope you're enjoying {start_strong}{course_name}{end_strong}! We want to let you know what you can look forward to in the coming weeks:
ms_my: Kami harap anda menikmati {start_strong}{course_name}{end_strong}! Kami ingin memberitahu anda perkara yang anda boleh nantikan dalam minggu-minggu akan datang:

source: We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
ms_my: Kami menggalakkan anda meluangkan masa dengan kursus setiap minggu. Perhatian tertumpu anda akan membuahkan hasil pada akhirnya!

source: We hope you're enjoying %(course_name)s! We want to let you know what you can look forward to in the coming weeks:
ms_my: Kami harap anda menikmati %(course_name)s! Kami ingin memberitahu anda perkara yang anda boleh nantikan dalam minggu-minggu akan datang:

source: %(course_name)s Weekly Update
ms_my: %(course_name)s Kemas Kini Mingguan

source: Many %(platform_name)s learners are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ms_my: Ramai pelajar %(platform_name)s sedang menyelesaikan lebih banyak masalah setiap minggu dan mengambil bahagian dalam forum perbincangan. Apa yang anda mahu lakukan untuk terus belajar?

source: Many %(platform_name)s learners in %(course_name)s are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ms_my: Ramai %(platform_name)s pelajar dalam %(course_name)s sedang menyelesaikan lebih banyak masalah setiap minggu dan mengambil bahagian dalam forum perbincangan. Apa yang anda mahu lakukan untuk terus belajar?

source: Keep up the momentum!
ms_my: Kekalkan momentum!

source: Many {platform_name} learners in {start_strong}{course_name}{end_strong} are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ms_my: Ramai pelajar {platform_name} di {start_strong}{course_name}{end_strong} sedang menyelesaikan lebih banyak masalah setiap minggu dan mengambil bahagian dalam forum perbincangan. Apa yang anda mahu lakukan untuk terus belajar?

source: Keep learning
ms_my: Teruskan belajar

source: Keep learning today
ms_my: Teruskan belajar hari ini

source: Remember when you enrolled in {start_strong}{course_name}{end_strong}, and other courses on {platform_name}? We do, and we’re glad to have you! Come see what everyone is learning.
ms_my: Ingat semasa anda mendaftar dalam {start_strong}{course_name}{end_strong} dan kursus lain di {platform_name}? Kami melakukannya, dan kami gembira untuk memiliki anda! Mari lihat apa yang semua orang belajar.

source: Remember when you enrolled in {start_strong}{course_name}{end_strong} on {platform_name}? We do, and we’re glad to have you! Come see what everyone is learning.
ms_my: Ingat semasa anda mendaftar dalam {start_strong}{course_name}{end_strong} di {platform_name}? Kami melakukannya, dan kami gembira untuk memiliki anda! Mari lihat apa yang semua orang belajar.

source: Start learning now
ms_my: Mula belajar sekarang

source: Upgrade now
ms_my: Tingkatkan sekarang

source: We hope you are enjoying learning with us so far in {start_strong}{first_course_name}{end_strong}! A verified certificate allows you to highlight your new knowledge and skills. An {platform_name} certificate is official and easily shareable.
ms_my: Kami harap anda seronok belajar bersama kami setakat ini di {start_strong}{first_course_name}{end_strong}! Sijil yang disahkan membolehkan anda menyerlahkan pengetahuan dan kemahiran baharu anda. Sijil {platform_name} adalah rasmi dan mudah dikongsi.

source: You are eligible to upgrade in these courses:
ms_my: Anda layak untuk menaik taraf dalam kursus ini:

source: Example of a verified certificate
ms_my: Contoh sijil yang disahkan

source: Upgrade now at
ms_my: Naik taraf sekarang di

source: Site theme changed to {site_theme}
ms_my: Tema tapak ditukar kepada {site_theme}

source: Theme {site_theme} does not exist
ms_my: Tema {site_theme} tidak wujud

source: Site theme reverted to the default
ms_my: Tema tapak dikembalikan kepada lalai

source: Theming Administration
ms_my: Pentadbiran Tema

source: Usernames can only contain letters (A-Z, a-z), numerals (0-9), underscores (_), and hyphens (-).
ms_my: Nama pengguna hanya boleh mengandungi huruf (A-Z, a-z), angka (0-9), garis bawah (_), dan sempang (-).

source: Usernames can only contain letters, numerals, and @/./+/-/_ characters.
ms_my: Nama pengguna hanya boleh mengandungi huruf, angka dan aksara @/./+/-/_.

source: It looks like {email_address} belongs to an existing account. Try again with a different email address.
ms_my: Nampaknya {email_address} tergolong dalam akaun sedia ada. Cuba lagi dengan alamat e-mel lain.

source: This email is already associated with an existing account
ms_my: E-mel ini telah pun dikaitkan dengan akaun sedia ada

source: This email is associated to a retired account.
ms_my: E-mel ini dikaitkan dengan akaun bersara.

source: The password you entered is on a list of known compromised passwords. Please choose a different one.
ms_my: Kata laluan yang anda masukkan terdapat dalam senarai kata laluan yang diketahui terjejas. Sila pilih yang lain.

source: It looks like {username} belongs to an existing account. Try again with a different username.
ms_my: Nampaknya {username} tergolong dalam akaun sedia ada. Cuba lagi dengan nama pengguna lain.

source: It looks like this username is already taken
ms_my: Nampaknya nama pengguna ini sudah diambil

source: Username must be between {min} and {max} characters long.
ms_my: Nama pengguna mestilah antara {min} dan {maks} aksara panjang.

source: Enter a valid email address that contains at least {min} characters.
ms_my: Masukkan alamat e-mel yang sah yang mengandungi sekurang-kurangnya {min} aksara.

source: Enter your full name
ms_my: Masukkan nama penuh anda

source: Enter your first name
ms_my: Masukkan nama pertama anda

source: Enter your last name
ms_my: Masukkan nama keluarga anda

source: The email addresses do not match
ms_my: Alamat e-mel tidak sepadan

source: Enter your confirm email
ms_my: Masukkan e-mel pengesahan anda

source: Select your country or region of residence
ms_my: Pilih negara atau wilayah tempat tinggal anda

source: Select your profession
ms_my: Pilih profesion anda

source: Select your specialty
ms_my: Pilih kepakaran anda

source: Enter your profession
ms_my: Masukkan profesion anda

source: Enter your specialty
ms_my: Masukkan kepakaran anda

source: Enter your state
ms_my: Masukkan negeri anda

source: Enter your city
ms_my: Masukkan bandar anda

source: Tell us your goals
ms_my: Beritahu kami matlamat anda

source: Select the highest level of education you have completed
ms_my: Pilih tahap pendidikan tertinggi yang telah anda selesaikan

source: Select your year of birth
ms_my: Pilih tahun lahir anda

source: Select your gender
ms_my: Pilih jantina anda

source: Enter your mailing address
ms_my: Masukkan alamat surat-menyurat anda

source: Our system detected that your password is vulnerable. Change your password so that your account stays secure.
ms_my: Sistem kami mengesan bahawa kata laluan anda terdedah. Tukar kata laluan anda supaya akaun anda kekal selamat.

source: Our system detected that your password is vulnerable. We recommend you change it so that your account stays secure.
ms_my: Sistem kami mengesan bahawa kata laluan anda terdedah. Kami mengesyorkan anda menukarnya supaya akaun anda kekal selamat.

source: Full name can't be longer than 255 symbols
ms_my: Nama penuh tidak boleh melebihi 255 simbol

source: Enter a valid name
ms_my: Masukkan nama yang sah

source: First Name
ms_my: Nama Pertama

source: Last Name
ms_my: Nama Akhir

source: State/Province/Region
ms_my: Negeri/Wilayah/Wilayah

source: Company
ms_my: Syarikat

source: Title
ms_my: Tajuk

source: Job Title
ms_my: Jawatan Kosong

source: Mailing address
ms_my: Alamat surat menyurat

source: Tell us why you're interested in {platform_name}
ms_my: Beritahu kami sebab anda berminat dengan {platform_name}

source: Profession
ms_my: Profesion

source: Specialty
ms_my: keistimewaan

source: Work experience
ms_my: Pengalaman kerja

source: This account has been temporarily locked due to excessive login failures. Try again later.
ms_my: Akaun ini telah dikunci buat sementara waktu kerana kegagalan log masuk yang berlebihan. Cuba lagi nanti.

source: Email or password is incorrect.
ms_my: E-mel atau kata laluan tidak betul.

source: Permission Denied
ms_my: Kebenaran Ditolak

source: Retirement does not exist!
ms_my: Persaraan tidak wujud!

source: Success
ms_my: Kejayaan

source: Actions
ms_my: Tindakan

source: Comma separated file that have username and user_email of the users that needs to be retired
ms_my: Fail dipisahkan koma yang mempunyai nama pengguna dan e-mel pengguna pengguna yang perlu dihentikan

source: No data provided for user preference update
ms_my: Tiada data disediakan untuk kemas kini pilihan pengguna

source: Your account will be deleted shortly. Account deletion, including removal from email lists, may take a few weeks to fully process through our system. If you want to opt-out of emails before then, please unsubscribe from the footer of any email.
ms_my: Akaun anda akan dipadamkan sebentar lagi. Pemadaman akaun, termasuk pengalihan keluar daripada senarai e-mel, mungkin mengambil masa beberapa minggu untuk diproses sepenuhnya melalui sistem kami. Jika anda ingin menarik diri daripada e-mel sebelum itu, sila nyahlanggan daripada pengaki mana-mana e-mel.

source: Your Account Has Been Queued For Deletion
ms_my: Akaun Anda Telah Dibaris Gilir Untuk Pemadaman

source: Highest level of education completed
ms_my: Tahap pendidikan tertinggi tamat

source: Year of birth
ms_my: Tahun lahir

source: Password reset
ms_my: Tetapan semula kata laluan

source: If you did not request this change, you can ignore this email.
ms_my: Jika anda tidak meminta perubahan ini, anda boleh mengabaikan e-mel ini.

source: Reset my password
ms_my: Tetapkan semula kata laluan saya

source: Please go to the following page and choose a new password:
ms_my: Sila pergi ke halaman berikut dan pilih kata laluan baharu:

source: Password reset success
ms_my: Kejayaan tetapan semula kata laluan

source: Superuser creation not allowed
ms_my: Penciptaan superuser tidak dibenarkan

source: Account modification not allowed.
ms_my: Pengubahsuaian akaun tidak dibenarkan.

source: Account creation not allowed.
ms_my: Pembuatan akaun tidak dibenarkan.

source: You've successfully signed in to your {provider_name} account, but this account isn't linked with your {platform_name} account yet. {blank_lines}Use your {platform_name} username and password to sign in to {platform_name} below, and then link your {platform_name} account with {provider_name} from your dashboard. {blank_lines}If you don't have an account on {platform_name} yet, click {register_label_strong} at the top of the page.
ms_my: Anda telah berjaya melog masuk ke akaun {provider_name} anda, tetapi akaun ini belum dipautkan dengan akaun {platform_name} anda lagi. {blank_lines}Gunakan nama pengguna dan kata laluan {platform_name} anda untuk log masuk ke {platform_name} di bawah, kemudian pautkan akaun {platform_name} anda dengan {provider_name} daripada papan pemuka anda. {blank_lines}Jika anda belum mempunyai akaun di {platform_name} lagi, klik {register_label_strong} di bahagian atas halaman.

source: Register
ms_my: Daftar

source: There was an error receiving your login information. Please email us.
ms_my: Terdapat ralat menerima maklumat log masuk anda. Sila email kepada kami.

source: To protect your account, it’s been temporarily locked. Try again in {locked_out_period} minutes.{li_start}To be on the safe side, you can reset your password {link_start}here{link_end} before you try again.
ms_my: Untuk melindungi akaun anda, akaun itu telah dikunci buat sementara waktu. Cuba lagi dalam {locked_out_period} minit.{li_start}Untuk berada di pihak yang selamat, anda boleh menetapkan semula kata laluan anda {link_start}di sini{link_end} sebelum anda mencuba lagi.

source: Too many failed login attempts. Try again later.
ms_my: Terlalu banyak percubaan log masuk yang gagal. Cuba lagi nanti.

source: Email or password is incorrect.{li_start}You have {remaining_attempts} more sign-in attempts before your account is temporarily locked.{li_end}{li_start}If you've forgotten your password, click {link_start}here{link_end} to reset.{li_end}
ms_my: E-mel atau kata laluan tidak betul.{li_start}Anda mempunyai {remaining_attempts} lagi percubaan log masuk sebelum akaun anda dikunci buat sementara waktu.{li_end}{li_start}Jika anda terlupa kata laluan anda, klik {link_start}di sini{link_end} untuk menetapkan semula.{li_end}

source: As {allowed_domain} user, You must login with your {allowed_domain} {link_start}{provider} account{link_end}.
ms_my: Sebagai pengguna {allowed_domain}, Anda mesti log masuk menggunakan akaun {link_start}{provider} {link_end} {allowed_domain} anda.

source: The email address you used to register with {platform_name}
ms_my: Alamat e-mel yang anda gunakan untuk mendaftar dengan {platform_name}

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
ms_my: Alamat e-mel itu tidak mempunyai akaun pengguna yang berkaitan. Adakah anda pasti anda telah mendaftar?

source: The user account associated with this e-mail address cannot reset the password.
ms_my: Akaun pengguna yang dikaitkan dengan alamat e-mel ini tidak boleh menetapkan semula kata laluan.

source: Your previous request is in progress, please try again in a few moments.
ms_my: Permintaan anda sebelum ini sedang dijalankan, sila cuba lagi dalam beberapa saat.

source: Password reset unsuccessful
ms_my: Tetapan semula kata laluan tidak berjaya

source: Error in resetting your password.
ms_my: Ralat dalam menetapkan semula kata laluan anda.

source: Error in resetting your password. Please try again.
ms_my: Ralat dalam menetapkan semula kata laluan anda. Sila cuba lagi.

source: {html_start}Password Creation Complete{html_end}Your password has been created. {bold_start}{email}{bold_end} is now your primary login email.
ms_my: {html_start}Pembuatan Kata Laluan Selesai{html_end}Kata laluan anda telah dibuat. {bold_start}{email}{bold_end} kini ialah e-mel log masuk utama anda.

source: Some error occurred during password change. Please try again
ms_my: Beberapa ralat berlaku semasa penukaran kata laluan. Sila cuba lagi

source: No email address provided.
ms_my: Tiada alamat e-mel diberikan.

source: An error has occurred. Try refreshing the page, or check your internet connection.
ms_my: Ralat telah berlaku. Cuba muat semula halaman atau semak sambungan Internet anda.

source: Registration using {provider} has timed out.
ms_my: Pendaftaran menggunakan {provider} telah tamat masa.

source: An access_token is required when passing value ({}) for provider.
ms_my: Token_akses diperlukan apabila menghantar nilai ({}) untuk pembekal.

source: The provided access_token is already associated with another user.
ms_my: Token akses yang disediakan telah pun dikaitkan dengan pengguna lain.

source: The provided access_token is not valid.
ms_my: Token akses yang diberikan tidak sah.

source: Full Name cannot contain the following characters: < >
ms_my: Nama Penuh tidak boleh mengandungi aksara berikut: < >

source: A properly formatted e-mail is required
ms_my: E-mel yang diformat dengan betul diperlukan

source: Your legal name must be a minimum of one character long
ms_my: Panjang nama sah anda mestilah sekurang-kurangnya satu aksara

source: You must accept the terms of service.
ms_my: Anda mesti menerima syarat perkhidmatan.

source: A level of education is required
ms_my: Tahap pendidikan diperlukan

source: Your gender is required
ms_my: Jantina anda diperlukan

source: Your year of birth is required
ms_my: Tahun lahir anda diperlukan

source: Your mailing address is required
ms_my: Alamat surat-menyurat anda diperlukan

source: A description of your goals is required
ms_my: Penerangan tentang matlamat anda diperlukan

source: A city is required
ms_my: Sebuah bandar diperlukan

source: A country is required
ms_my: Sebuah negara diperlukan

source: To enroll, you must follow the honor code.
ms_my: Untuk mendaftar, anda mesti mengikut kod kehormat.

source: You are missing one or more required fields
ms_my: Anda kehilangan satu atau lebih medan yang diperlukan

source: Unauthorized email address.
ms_my: Alamat e-mel yang tidak dibenarkan.

source: It looks like {email} belongs to an existing account. Try again with a different email address.
ms_my: Nampaknya {email} milik akaun sedia ada. Cuba lagi dengan alamat e-mel lain.

source: Registration from this country is not allowed due to restrictions.
ms_my: Pendaftaran dari negara ini tidak dibenarkan kerana sekatan.

source: This is what you will use to login.
ms_my: Inilah yang anda akan gunakan untuk log masuk.

source: This name will be used on any certificates that you earn.
ms_my: Nama ini akan digunakan pada mana-mana sijil yang anda perolehi.

source: Public Username
ms_my: Nama Pengguna Awam

source: The name that will identify you in your courses. It cannot be changed later.
ms_my: Nama yang akan mengenal pasti anda dalam kursus anda. Ia tidak boleh diubah kemudian.

source: I agree that {platform_name} may send me marketing messages.
ms_my: Saya bersetuju bahawa {platform_name} boleh menghantar mesej pemasaran kepada saya.

source: Country or Region of Residence
ms_my: Negara atau Wilayah Tempat Tinggal

source: The country or region where you live.
ms_my: Negara atau wilayah tempat anda tinggal.

source: Terms of Service and Honor Code
ms_my: Syarat Perkhidmatan dan Kod Kehormat

source: I agree to the {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}
ms_my: Saya bersetuju menerima {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}

source: You must agree to the {platform_name} {terms_of_service}
ms_my: Anda mesti bersetuju menerima {platform_name} {terms_of_service}

source: By creating an account, you agree to the {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} and you acknowledge that {platform_name} and each Member process your personal data in accordance with the {privacy_policy_link_start}Privacy Policy{privacy_policy_link_end}.
ms_my: Dengan membuat akaun, anda bersetuju menerima {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} dan anda mengakui bahawa {platform_name} dan setiap Ahli memproses data peribadi anda mengikut {privacy_policy_link_start}Dasar Privasi{privacy_policy_link_end}.

source: I agree to the {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}
ms_my: Saya bersetuju menerima {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}

source: Create Account
ms_my: Buat Akaun

source: Dismiss
ms_my: Tolak

source: Oauth client name of VEM service.
ms_my: Nama pelanggan Oauth perkhidmatan VEM.

source: video encode manager API URL.
ms_my: URL API pengurus pengekodan video.

source: Username created for VEM Integration, e.g. vem_service_user.
ms_my: Nama pengguna dicipta untuk Integrasi VEM, mis. vem_service_user.

source: Force On
ms_my: Paksa Hidup

source: Force Off
ms_my: Paksa Mati

source: This content is only accessible to registered learners. Sign in or register to view it.
ms_my: Kandungan ini hanya boleh diakses oleh pelajar berdaftar. Log masuk atau daftar untuk melihatnya.

source: This content is only accessible to enrolled learners.
ms_my: Kandungan ini hanya boleh diakses oleh pelajar yang berdaftar.

source: The about me field must be at most {BIO_MAX_LENGTH} characters long.
ms_my: Panjang medan tentang saya mestilah paling banyak {BIO_MAX_LENGTH} aksara.

source: This value is invalid.
ms_my: Nilai ini tidak sah.

source: This field is not editable
ms_my: Medan ini tidak boleh diedit

source: Gating milestone for {usage_key}
ms_my: Pencapaian penting untuk {usage_key}

source: License
ms_my: Lesen

source: A license defines how the contents of this block can be shared and reused.
ms_my: Lesen mentakrifkan cara kandungan blok ini boleh dikongsi dan digunakan semula.

source: Team Group: {team_set_name}
ms_my: Kumpulan Pasukan: {team_set_name}

source: Partition for segmenting users by team-set
ms_my: Pembahagian untuk membahagikan pengguna mengikut set pasukan

source: {assignment} is due for {course}.
ms_my: {assignment} sepatutnya untuk {course}.

source: Calendar Sync
ms_my: Penyegerakan Kalendar

source: Unsubscribe from calendar updates
ms_my: Nyahlanggan kemas kini kalendar

source: Subscribe to calendar updates
ms_my: Langgan kemas kini kalendar

source: Sync {course} to your calendar
ms_my: Segerakkan {course} ke kalendar anda

source: Sticking to a schedule is the best way to ensure that you successfully complete your self-paced course. This schedule for {course} will help you stay on track!
ms_my: Berpegang pada jadual adalah cara terbaik untuk memastikan anda berjaya menyelesaikan kursus kendiri anda. Jadual untuk {course} ini akan membantu anda kekal di landasan yang betul!

source: Once you sync your course schedule to your calendar, any updates to the course from your instructor will be automatically reflected. You can remove the course from your calendar at any time.
ms_my: Sebaik sahaja anda menyegerakkan jadual kursus anda ke kalendar anda, sebarang kemas kini kursus daripada pengajar anda akan dipaparkan secara automatik. Anda boleh mengalih keluar kursus daripada kalendar anda pada bila-bila masa.

source: {course} dates have been updated on your calendar
ms_my: Tarikh {course} telah dikemas kini pada kalendar anda

source: You have successfully shifted your course schedule and your calendar is up to date.
ms_my: Anda telah berjaya mengalihkan jadual kursus anda dan kalendar anda adalah terkini.

source: Enabled As Of
ms_my: Didayakan Mulai

source: If the configuration is Enabled, then all enrollments created after this date and time (user local time) will be affected.
ms_my: Jika konfigurasi Didayakan, maka semua pendaftaran yang dibuat selepas tarikh dan masa ini (waktu tempatan pengguna) akan terjejas.

source: Studio Override Enabled
ms_my: Studio Override Didayakan

source: Allow Feature Based Enrollment visibility to be overriden on a per-component basis in Studio.
ms_my: Benarkan keterlihatan Pendaftaran Berasaskan Ciri ditindih pada asas setiap komponen dalam Studio.
