Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: Government-Issued Photo ID
ms_my: ID Foto Keluaran Kerajaan

source: ID-Verification is not required for this Professional Education course.
ms_my: Pengesahan ID tidak diperlukan untuk kursus Pendidikan Profesional ini.

source: All professional education courses are fee-based, and require payment to complete the enrollment process.
ms_my: Semua kursus pendidikan profesional adalah berasaskan yuran, dan memerlukan bayaran untuk melengkapkan proses pendaftaran.

source: You have already verified your ID!
ms_my: Anda telah pun mengesahkan ID anda!

source: Your verification status is good until {verificationGoodUntil}.
ms_my: Status pengesahan anda baik sehingga {verificationGoodUntil}.

source: price
ms_my: harga

source: Account Not Activated
ms_my: Akaun Tidak Diaktifkan

source: Upgrade to a Verified Certificate for {courseName}
ms_my: Naik taraf kepada Sijil Disahkan untuk {courseName}

source: Before you upgrade to a certificate track, you must activate your account.
ms_my: Sebelum anda menaik taraf kepada trek sijil, anda mesti mengaktifkan akaun anda.

source: Check your email for an activation message.
ms_my: Semak e-mel anda untuk mesej pengaktifan.

source: Total
ms_my: Jumlah

source: Professional Certificate for {courseName}
ms_my: Sijil Profesional untuk {courseName}

source: Verified Certificate for {courseName}
ms_my: Sijil Disahkan untuk {courseName}

source: To receive a certificate, you must also verify your identity before {date}.
ms_my: Untuk menerima sijil, anda juga mesti mengesahkan identiti anda sebelum {date}.

source: To receive a certificate, you must also verify your identity.
ms_my: Untuk menerima sijil, anda juga mesti mengesahkan identiti anda.

source: To verify your identity, you need a webcam and a government-issued photo ID.
ms_my: Untuk mengesahkan identiti anda, anda memerlukan kamera web dan ID foto keluaran kerajaan.

source: Your ID must be a government-issued photo ID that clearly shows your face.
ms_my: ID anda mestilah ID foto keluaran kerajaan yang menunjukkan wajah anda dengan jelas.

source: You will use your webcam to take a picture of your face and of your government-issued photo ID.
ms_my: Anda akan menggunakan kamera web anda untuk mengambil gambar wajah anda dan ID foto keluaran kerajaan anda.

source: Identity Verification In Progress
ms_my: Pengesahan Identiti Sedang Dijalankan

source: We have received your information and are verifying your identity. You will see a message on your dashboard when the verification process is complete (usually within 5-7 days). In the meantime, you can still access all available course content.
ms_my: Kami telah menerima maklumat anda dan sedang mengesahkan identiti anda. Anda akan melihat mesej pada papan pemuka anda apabila proses pengesahan selesai (biasanya dalam masa 5-7 hari). Sementara itu, anda masih boleh mengakses semua kandungan kursus yang tersedia.

source: Return to Your Dashboard
ms_my: Kembali ke Papan Pemuka Anda

source: Make sure we can verify your identity with the photos and information you have provided.
ms_my: Pastikan kami boleh mengesahkan identiti anda dengan foto dan maklumat yang anda berikan.

source: Photo of %(fullName)s
ms_my: Foto %(fullName)s

source: Photo requirements:
ms_my: Keperluan foto:

source: Does the photo of you show your whole face?
ms_my: Adakah foto anda menunjukkan seluruh wajah anda?

source: Is your name on your ID readable?
ms_my: Adakah nama anda pada ID anda boleh dibaca?

source: Does the name on your ID match your account name: %(fullName)s?
ms_my: Adakah nama pada ID anda sepadan dengan nama akaun anda: %(fullName)s?

source: Edit Your Name
ms_my: Edit Nama Anda

source: Make sure that the full name on your account matches the name on your ID.
ms_my: Pastikan nama penuh pada akaun anda sepadan dengan nama pada ID anda.

source: Photos don't meet the requirements?
ms_my: Foto tidak memenuhi keperluan?

source: Retake Your Photos
ms_my: Ambil Semula Foto Anda

source: Before proceeding, please confirm that your details match
ms_my: Sebelum meneruskan, sila sahkan bahawa butiran anda sepadan

source: Don't see your picture? Make sure to allow your browser to use your camera when it asks for permission.
ms_my: Tidak melihat gambar anda? Pastikan untuk membenarkan penyemak imbas anda menggunakan kamera anda apabila ia meminta kebenaran.

source: Live view of webcam
ms_my: Pandangan langsung webcam

source: Retake Photo
ms_my: Ambil Semula Foto

source: Take Photo
ms_my: Ambil Foto

source: Bookmarked on
ms_my: Ditandakan pada

source: You have not bookmarked any courseware pages yet
ms_my: Anda belum menanda halaman mana-mana perisian kursus lagi

source: Use bookmarks to help you easily return to courseware pages. To bookmark a page, click "Bookmark this page" under the page title.
ms_my: Gunakan penanda halaman untuk membantu anda kembali ke halaman perisian kursus dengan mudah. Untuk menanda halaman halaman, klik "Tanda halaman halaman ini" di bawah tajuk halaman.

source: Load next {num_items} result
ms_my: Muatkan {num_items} hasil carian seterusnya

source: Sorry, no results were found.
ms_my: Maaf, tiada keputusan ditemui.

source: You are currently sharing a limited profile.
ms_my: Anda sedang berkongsi profil terhad.

source: This learner is currently sharing a limited profile.
ms_my: Pelajar ini sedang berkongsi profil terhad.
