Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: This may be happening because of an error with our server or your internet connection. Try refreshing the page or making sure you are online.
ms_my: Ini mungkin berlaku kerana ralat dengan pelayan kami atau sambungan internet anda. Cuba muat semula halaman atau pastikan anda berada dalam talian.

source: Studio's having trouble saving your work
ms_my: Studio menghadapi masalah menyimpan kerja anda

source: OpenAssessment Save Error
ms_my: Ralat Simpan OpenAssessment

source: Saving
ms_my: Menyimpan

source: This link will open in a new browser window/tab
ms_my: Pautan ini akan dibuka dalam tetingkap/tab penyemak imbas baharu

source: This link will open in a modal window
ms_my: Pautan ini akan dibuka dalam tetingkap modal

source: Certificate name is required.
ms_my: Nama sijil diperlukan.

source: Signatory field(s) has invalid data.
ms_my: Medan penandatangan mempunyai data yang tidak sah.

source: Edit this certificate?
ms_my: Edit sijil ini?

source: This certificate has already been activated and is live. Are you sure you want to continue editing?
ms_my: Sijil ini telah pun diaktifkan dan disiarkan secara langsung. Adakah anda pasti mahu meneruskan pengeditan?

source: Yes, allow edits to the active Certificate
ms_my: Ya, benarkan pengeditan pada Sijil yang aktif

source: certificate
ms_my: sijil

source: Deactivating
ms_my: Menyahaktifkan

source: Set up your certificate
ms_my: Sediakan sijil anda

source: You have not created any certificates yet.
ms_my: Anda belum mencipta sebarang sijil lagi.

source: Delete "<%- signatoryName %>" from the list of signatories?
ms_my: Padamkan "<%- signatoryName %>" daripada senarai penandatangan?

source: This action cannot be undone.
ms_my: Tindakan ini tidak boleh dibuat asal.

source: Delete
ms_my: Padam

source: Deleting
ms_my: Memadam

source: Cancel
ms_my: Batal

source: Upload signature image.
ms_my: Muat naik imej tandatangan.

source: Image must be in PNG format.
ms_my: Imej mestilah dalam format PNG.

source: Group %s
ms_my: Kumpulan%s

source: Your export has failed.
ms_my: Eksport anda telah gagal.

source: Already a course team member
ms_my: Sudah menjadi ahli pasukan kursus

source: Are you sure you want to delete {email} from the course team for “{container}”?
ms_my: Adakah anda pasti mahu memadamkan {email} daripada pasukan kursus untuk “{container}”?

source: Staff
ms_my: Kakitangan

source: Already a library team member
ms_my: Sudah menjadi ahli pasukan perpustakaan

source: Are you sure you want to delete {email} from the library “{container}”?
ms_my: Adakah anda pasti mahu memadamkan {email} daripada pustaka “{container}”?

source: Library User
ms_my: Pengguna Perpustakaan

source: Hide Deprecated Settings
ms_my: Sembunyikan Tetapan Dihentikan

source: Show Deprecated Settings
ms_my: Tunjukkan Tetapan Dihentikan

source: You have unsaved changes. Do you really want to leave this page?
ms_my: Anda mempunyai perubahan yang belum disimpan. Adakah anda benar-benar mahu meninggalkan halaman ini?

source: There was an error during the upload process.
ms_my: Terdapat ralat semasa proses muat naik.

source: There was an error while unpacking the file.
ms_my: Terdapat ralat semasa membongkar fail.

source: There was an error while verifying the file you submitted.
ms_my: Terdapat ralat semasa mengesahkan fail yang anda serahkan.

source: Choose new file
ms_my: Pilih fail baharu

source: File format not supported. Please upload a file with a {ext} extension.
ms_my: Format fail tidak disokong. Sila muat naik fail dengan sambungan {ext}.

source: There was an error while importing the new library to our database.
ms_my: Terdapat ralat semasa mengimport pustaka baharu ke pangkalan data kami.

source: There was an error while importing the new course to our database.
ms_my: Terdapat ralat semasa mengimport kursus baharu ke pangkalan data kami.

source: Your import has failed.
ms_my: Import anda telah gagal.

source: Your import is in progress; navigating away will abort it.
ms_my: Import anda sedang dijalankan; menavigasi jauh akan membatalkannya.

source: Error importing course
ms_my: Ralat mengimport kursus

source: There was an error with the upload
ms_my: Terdapat ralat dengan muat naik

source: Queued
ms_my: Beratur

source: Uploading
ms_my: Memuat naik

source: Upload completed
ms_my: Muat naik selesai

source: Upload failed
ms_my: Muat naik gagal

source: Chapter name and asset_path are both required
ms_my: Nama bab dan asset_path kedua-duanya diperlukan

source: Chapter name is required
ms_my: Nama bab diperlukan

source: asset_path is required
ms_my: asset_path diperlukan

source: You must specify a name
ms_my: Anda mesti menyatakan nama

source: Action required: Enter a valid date.
ms_my: Tindakan diperlukan: Masukkan tarikh yang sah.

source: Group name is required
ms_my: Nama kumpulan diperlukan

source: Group A
ms_my: Kumpulan A

source: Group B
ms_my: Kumpulan B

source: Group Configuration name is required.
ms_my: Nama Konfigurasi Kumpulan diperlukan.

source: There must be at least one group.
ms_my: Mesti ada sekurang-kurangnya satu kumpulan.

source: All groups must have a name.
ms_my: Semua kumpulan mesti mempunyai nama.

source: All groups must have a unique name.
ms_my: Semua kumpulan mesti mempunyai nama yang unik.

source: The course must have an assigned start date.
ms_my: Kursus mesti mempunyai tarikh mula yang ditetapkan.

source: The course end date must be later than the course start date.
ms_my: Tarikh tamat kursus mestilah lewat daripada tarikh mula kursus.

source: The course start date must be later than the enrollment start date.
ms_my: Tarikh mula kursus mestilah lewat daripada tarikh mula pendaftaran.

source: The enrollment start date cannot be after the enrollment end date.
ms_my: Tarikh mula pendaftaran tidak boleh selepas tarikh tamat pendaftaran.

source: The enrollment end date cannot be after the course end date.
ms_my: Tarikh tamat pendaftaran tidak boleh selepas tarikh tamat kursus.

source: The certificate available date must be later than the course end date.
ms_my: Tarikh tersedia sijil mestilah lewat daripada tarikh tamat kursus.

source: The certificate display behavior must be one of: {behavior_options}
ms_my: Gelagat paparan sijil mestilah salah satu daripada: {behavior_options}

source: The certificates display behavior must be {valid_option} if certificate available date is set.
ms_my: Tingkah laku paparan sijil mestilah {valid_option} jika tarikh sijil tersedia ditetapkan.

source: Key should only contain letters, numbers, _, or -
ms_my: Kunci hendaklah hanya mengandungi huruf, nombor, _, atau -

source: Please enter an integer between %(min)s and %(max)s.
ms_my: Sila masukkan integer antara %(min)s dan %(maks)s.

source: The assignment type must have a name.
ms_my: Jenis tugasan mesti mempunyai nama.

source: There's already another assignment type with this name.
ms_my: Sudah ada jenis tugasan lain dengan nama ini.

source: Please enter an integer between 0 and 100.
ms_my: Sila masukkan integer antara 0 dan 100.

source: Please enter an integer greater than 0.
ms_my: Sila masukkan integer lebih besar daripada 0.

source: Please enter non-negative integer.
ms_my: Sila masukkan integer bukan negatif.

source: You must have at least one undroppable <%- types %> assignment.
ms_my: Anda mesti mempunyai sekurang-kurangnya satu tugasan <%- types %> yang tidak boleh digugurkan.

source: Grace period must be specified in HH:MM format.
ms_my: Tempoh tangguh mesti dinyatakan dalam format HH:MM.

source: Not able to set passing grade to less than %(minimum_grade_cutoff)s%.
ms_my: Tidak dapat menetapkan gred lulus kepada kurang daripada %(minimum_grade_cutoff)s%.

source: Textbook name is required
ms_my: Nama buku teks diperlukan

source: Please add at least one chapter
ms_my: Sila tambah sekurang-kurangnya satu bab

source: All chapters must have a name and asset
ms_my: Semua bab mesti mempunyai nama dan aset

source: Only <%- fileTypes %> files can be uploaded. Please select a file ending in <%- (fileExtensions) %> to upload.
ms_my: Hanya &lt;%- fileTypes %&gt; fail boleh dimuat naik. Sila pilih fail yang berakhir dengan &lt;%- (fileExtensions) %&gt; untuk dimuat naik.

source: or
ms_my: atau

source: This unit has validation issues.
ms_my: Unit ini mempunyai isu pengesahan.

source: This component has validation issues.
ms_my: Komponen ini mempunyai isu pengesahan.

source: Copied
ms_my: disalin

source: Your file could not be uploaded
ms_my: Fail anda tidak dapat dimuat naik

source: Close
ms_my: tutup

source: Upload Videos
ms_my: Muat naik Video

source: Drag and drop or {spanStart}browse your computer{spanEnd}.
ms_my: Seret dan lepas atau {spanStart}semak imbas komputer anda{spanEnd}.

source: Maximum file size: {maxFileSize} GB
ms_my: Saiz fail maksimum: {maxFileSize} GB

source: Supported file types: {supportedVideoTypes}
ms_my: Jenis fail yang disokong: {supportedVideoTypes}

source: Your video uploads are not complete.
ms_my: Muat naik video anda tidak lengkap.

source: Upload completed for video {fileName}
ms_my: Muat naik selesai untuk video {fileName}

source: Upload failed for video {fileName}
ms_my: Muat naik gagal untuk video {fileName}

source: {filename} is not in a supported file format. Supported file formats are {supportedFileFormats}.
ms_my: {filename} tidak dalam format fail yang disokong. Format fail yang disokong ialah {supportedFileFormats}.

source: {filename} exceeds maximum size of {maxFileSizeInGB} GB.
ms_my: {filename} melebihi saiz maksimum {maxFileSizeInGB} GB.

source: : video upload complete.
ms_my: : muat naik video selesai.

source: Previous Uploads table has been updated.
ms_my: Jadual Muat Naik Sebelumnya telah dikemas kini.

source: Delete File Confirmation
ms_my: Padamkan Pengesahan Fail

source: Are you sure you wish to delete this item. It cannot be reversed! Also any content that links/refers to this item will no longer work (e.g. broken images and/or links)
ms_my: Adakah anda pasti mahu memadamkan item ini. Ia tidak boleh diterbalikkan! Juga sebarang kandungan yang memaut/merujuk kepada item ini tidak akan berfungsi lagi (cth. imej dan/atau pautan yang rosak)

source: Your file has been deleted.
ms_my: Fail anda telah dipadamkan.

source: Name
ms_my: Nama

source: Date Added
ms_my: Tarikh Ditambah

source: Type
ms_my: taip

source: File {filename} exceeds maximum size of {maxFileSizeInMBs} MB
ms_my: Fail {filename} melebihi saiz maksimum {maxFileSizeInMBs} MB

source: Please follow the instructions here to upload a file elsewhere and link to it: {maxFileSizeRedirectUrl}
ms_my: Sila ikut arahan di sini untuk memuat naik fail di tempat lain dan memautkannya: {maxFileSizeRedirectUrl}

source: Max file size exceeded
ms_my: Saiz fail maksimum melebihi

source: Choose File
ms_my: Pilih Fail

source: Upload New File
ms_my: Muat Naik Fail Baharu

source: Load Another File
ms_my: Muatkan Fail Lain

source: Add library content
ms_my: Tambah kandungan perpustakaan

source: Adding
ms_my: Menambah

source: Are you sure you want to delete this update?
ms_my: Adakah anda pasti mahu memadam kemas kini ini?

source: Copying
ms_my: Menyalin

source: Copy of '{componentDisplayName}'
ms_my: Salinan '{component DisplayName}'

source: Pasting
ms_my: Menampal

source: Some errors occurred
ms_my: Beberapa ralat berlaku

source: The following required files could not be added to the course:
ms_my: Fail yang diperlukan berikut tidak dapat ditambahkan pada kursus:

source: You may need to update a file(s) manually
ms_my: Anda mungkin perlu mengemas kini fail secara manual

source: The following files already exist in this course but don't match the version used by the component you pasted:
ms_my: Fail berikut sudah wujud dalam kursus ini tetapi tidak sepadan dengan versi yang digunakan oleh komponen yang anda tampal:

source: New file(s) added to Files & Uploads.
ms_my: Fail baharu ditambahkan pada Fail &amp; Muat Naik.

source: The following required files were imported to this course:
ms_my: Fail yang diperlukan berikut telah diimport ke kursus ini:

source: View files
ms_my: Lihat fail

source: Dismiss
ms_my: Tolak

source: Create Re-run
ms_my: Cipta Jalankan Semula

source: Processing Re-run Request
ms_my: Memproses Permintaan Jalankan Semula

source: An error has occurred. Wait a few minutes, and then try again.
ms_my: Ralat telah berlaku. Tunggu beberapa minit, dan kemudian cuba lagi.

source: None
ms_my: tiada

source: Select turnaround
ms_my: Pilih pemulihan

source: Select fidelity
ms_my: Pilih kesetiaan

source: Select language
ms_my: Pilih kesetiaan

source: Remove
ms_my: Alih keluar

source: Press Remove to remove language
ms_my: Tekan Alih Keluar untuk mengalih keluar bahasa

source: Settings updated
ms_my: Tetapan dikemas kini

source: Last updated
ms_my: Kemas kini terakhir

source: Required
ms_my: Diperlukan

source: Automatic transcripts are disabled.
ms_my: Transkrip automatik dilumpuhkan.

source: {selectedProvider} credentials saved
ms_my: Bukti kelayakan {selectedProvider} disimpan

source: Upload a new PDF to “<%- name %>”
ms_my: Muat naik PDF baharu ke <%- fileTypes %>

source: Please select a PDF file to upload.
ms_my: Sila pilih fail PDF untuk dimuat naik.

source: There has been an error while exporting.
ms_my: Terdapat ralat semasa mengeksport.

source: There has been a failure to export to XML at least one component. It is recommended that you go to the edit page and repair the error before attempting another export. Please check that all components on the page are valid and do not display any error messages.
ms_my: Terdapat kegagalan untuk mengeksport ke XML sekurang-kurangnya satu komponen. Anda disyorkan untuk pergi ke halaman edit dan membaiki ralat sebelum mencuba eksport lain. Sila semak bahawa semua komponen pada halaman adalah sah dan tidak memaparkan sebarang mesej ralat.

source: Correct failed component
ms_my: Membetulkan komponen yang gagal

source: Return to Export
ms_my: Kembali ke Eksport

source: Your library could not be exported to XML. There is not enough information to identify the failed component. Inspect your library to identify any problematic components and try again.
ms_my: Pustaka anda tidak dapat dieksport ke XML. Tidak ada maklumat yang mencukupi untuk mengenal pasti komponen yang gagal. Periksa pustaka anda untuk mengenal pasti sebarang komponen yang bermasalah dan cuba lagi.

source: Take me to the main library page
ms_my: Bawa saya ke halaman perpustakaan utama

source: Your course could not be exported to XML. There is not enough information to identify the failed component. Inspect your course to identify any problematic components and try again.
ms_my: Kursus anda tidak boleh dieksport ke XML. Tidak ada maklumat yang mencukupi untuk mengenal pasti komponen yang gagal. Periksa kursus anda untuk mengenal pasti sebarang komponen yang bermasalah dan cuba lagi.

source: Take me to the main course page
ms_my: Bawa saya ke halaman kursus utama

source: The raw error message is:
ms_my: Mesej ralat mentah ialah:

source: There has been an error with your export.
ms_my: Terdapat ralat dengan eksport anda.

source: Contains {count} group
ms_my: Mengandungi {count} kumpulan

source: Not in Use
ms_my: Tidak Digunakan

source: Used in {count} location
ms_my: Digunakan di {count} lokasi

source: group configuration
ms_my: konfigurasi kumpulan

source: Add your first group configuration
ms_my: Tambahkan konfigurasi kumpulan pertama anda

source: You have not created any group configurations yet.
ms_my: Anda belum membuat sebarang konfigurasi kumpulan lagi.

source: Upload instructor image.
ms_my: Muat naik imej pengajar.

source: Files must be in JPEG or PNG format.
ms_my: Fail mestilah dalam format JPEG atau PNG.

source: All Rights Reserved
ms_my: Hak Cipta Terpelihara

source: You reserve all rights for your work
ms_my: Anda menyimpan semua hak untuk kerja anda

source: You waive some rights for your work, such that others can use it too
ms_my: Anda mengetepikan beberapa hak untuk kerja anda, supaya orang lain boleh menggunakannya juga

source: Version
ms_my: Versi

source: Attribution
ms_my: Atribusi

source: Allow others to copy, distribute, display and perform your copyrighted work but only if they give credit the way you request. Currently, this option is required.
ms_my: Benarkan orang lain menyalin, mengedar, memaparkan dan melaksanakan kerja berhak cipta anda tetapi hanya jika mereka memberi kredit seperti yang anda minta. Pada masa ini, pilihan ini diperlukan.

source: Noncommercial
ms_my: Bukan komersial

source: Allow others to copy, distribute, display and perform your work - and derivative works based upon it - but for noncommercial purposes only.
ms_my: Benarkan orang lain menyalin, mengedar, memaparkan dan melaksanakan kerja anda - dan karya terbitan berdasarkannya - tetapi untuk tujuan bukan komersial sahaja.

source: No Derivatives
ms_my: Tiada Derivatif

source: Allow others to copy, distribute, display and perform only verbatim copies of your work, not derivative works based upon it. This option is incompatible with "Share Alike".
ms_my: Benarkan orang lain menyalin, mengedar, memaparkan dan melaksanakan hanya salinan verbatim kerja anda, bukan karya terbitan berdasarkannya. Pilihan ini tidak serasi dengan "Kongsi Sama".

source: Share Alike
ms_my: Kongsi Sama

source: Allow others to distribute derivative works only under a license identical to the license that governs your work. This option is incompatible with "No Derivatives".
ms_my: Benarkan orang lain mengedarkan karya terbitan hanya di bawah lesen yang sama dengan lesen yang mengawal kerja anda. Pilihan ini tidak serasi dengan "Tiada Derivatif".

source: Delete this %(item_display_name)s?
ms_my: Padamkan %(item_display_name)s ini?

source: Deleting this %(item_display_name)s is permanent and cannot be undone.
ms_my: Memadamkan %(item_display_name)s ini adalah kekal dan tidak boleh dibuat asal.

source: There was an error changing the user's role
ms_my: Terdapat ralat menukar peranan pengguna

source: Unknown
ms_my: Tidak diketahui

source: Error adding user
ms_my: Ralat menambah pengguna

source: Error removing user
ms_my: Ralat mengalih keluar pengguna

source: A valid email address is required
ms_my: Alamat e-mel yang sah diperlukan

source: You must enter a valid email address in order to add a new team member
ms_my: Anda mesti memasukkan alamat e-mel yang sah untuk menambah ahli pasukan baharu

source: Return and add email address
ms_my: Kembali dan tambah alamat e-mel

source: Already a member
ms_my: Sudah menjadi ahli

source: {email} is already on the {container} team. Recheck the email address if you want to add a new member.
ms_my: {email} sudah ada dalam pasukan {container}. Semak semula alamat e-mel jika anda ingin menambah ahli baharu.

source: Return to team listing
ms_my: Kembali ke penyenaraian pasukan

source: Are you sure?
ms_my: Adakah anda pasti?

source: Are you sure you want to restrict {email} access to “{container}”?
ms_my: Adakah anda pasti mahu mengehadkan akses {e-mel} kepada “{container}”?

source: Upload File
ms_my: Muat Naik Fail

source: Save
ms_my: Jimat

source: {display_name} Settings
ms_my: Tetapan {display_name}.

source: Publish {display_name}
ms_my: Terbitkan {display_name}

source: Publish all unpublished changes for this {item}?
ms_my: Terbitkan semua perubahan yang tidak diterbitkan untuk {item} ini?

source: Publish
ms_my: Terbitkan

source: Highlights for {display_name}
ms_my: Sorotan untuk {display_name}

source: Enable Course Highlight Emails
ms_my: Dayakan E-mel Sorotan Kursus

source: Enable
ms_my: Dayakan

source: Not yet
ms_my: belum lagi

source: Share {display_name} subsection
ms_my: Kongsi subseksyen {display_name}

source: All Learners and Staff
ms_my: Semua Pelajar dan Kakitangan

source: Advanced
ms_my: Maju

source: Basic
ms_my: asas

source: Visibility
ms_my: Keterlihatan

source: Full Page
ms_my: Halaman Penuh

source: Embed Link
ms_my: Benamkan Pautan

source: Editing: {title}
ms_my: Mengedit: {title}

source: Plugins
ms_my: Pemalam

source: Component
ms_my: Komponen

source: Studio's having trouble parsing the problem component's content
ms_my: Studio menghadapi masalah menghuraikan kandungan komponen masalah

source: Move
ms_my: Bergerak

source: Choose a location to move your component to
ms_my: Pilih lokasi untuk memindahkan komponen anda

source: Move: {displayName}
ms_my: Alih: {displayName}

source: Preview changes to: {title}
ms_my: Pratonton perubahan kepada: {title}

source: Accept changes
ms_my: Terima perubahan

source: Ignore changes
ms_my: Abaikan perubahan

source: Ignore these changes?
ms_my: Abaikan perubahan ini?

source: Would you like to permanently ignore this updated version? If so, you won't be able to update this until a newer version is published (in the library).
ms_my: Adakah anda ingin mengabaikan versi yang dikemas kini ini secara kekal? Jika ya, anda tidak akan dapat mengemas kini ini sehingga versi yang lebih baharu diterbitkan (dalam pustaka).

source: Ignore
ms_my: abaikan

source: Add selected components
ms_my: Tambah komponen yang dipilih

source: Validation Error While Saving
ms_my: Ralat Pengesahan Semasa Menyimpan

source: Undo Changes
ms_my: Buat asal Perubahan

source: Change Manually
ms_my: Tukar Secara Manual

source: Sections
ms_my: Bahagian

source: Subsections
ms_my: Subseksyen

source: Units
ms_my: Unit

source: Components
ms_my: Komponen

source: Groups
ms_my: Kumpulan

source: This {parentCategory} has no {childCategory}
ms_my: {parentCategory} ini tidak mempunyai {childCategory}

source: Course Outline
ms_my: Rangka Kursus

source: Date added
ms_my: Tarikh ditambah

source: Editing access for: {title}
ms_my: Mengedit akses untuk: {title}

source: Publishing
ms_my: Penerbitan

source: Discard Changes
ms_my: Buang Perubahan

source: Are you sure you want to revert to the last published version of the unit? You cannot undo this action.
ms_my: Adakah anda pasti mahu kembali kepada versi unit yang diterbitkan terakhir? Anda tidak boleh membuat asal tindakan ini.

source: Discarding Changes
ms_my: Membuang Perubahan

source: Hiding from Students
ms_my: Bersembunyi daripada Pelajar

source: Explicitly Hiding from Students
ms_my: Secara Eksplisit Bersembunyi daripada Pelajar

source: Inheriting Student Visibility
ms_my: Mewarisi Keterlihatan Pelajar

source: Make Visible to Students
ms_my: Jadikan Kelihatan kepada Pelajar

source: If the unit was previously published and released to students, any changes you made to the unit when it was hidden will now be visible to students. Do you want to proceed?
ms_my: Jika unit tersebut telah diterbitkan dan dikeluarkan kepada pelajar sebelum ini, sebarang perubahan yang anda buat pada unit apabila ia disembunyikan kini akan kelihatan kepada pelajar. Adakah anda mahu meneruskan?

source: Making Visible to Students
ms_my: Membuat Kelihatan kepada Pelajar

source: Course Index
ms_my: Indeks Kursus

source: There were errors reindexing course.
ms_my: Terdapat ralat kursus pengindeksan semula.

source: Hide Previews
ms_my: Sembunyikan Pratonton

source: Show Previews
ms_my: Tunjukkan Pratonton

source: Showing {currentItemRange} out of {totalItemsCount}, filtered by {assetType}, sorted by {sortName} ascending
ms_my: Menunjukkan {currentItemRange} daripada {totalItemsCount}, ditapis mengikut {assetType}, diisih mengikut {sortName} menaik

source: Showing {currentItemRange} out of {totalItemsCount}, filtered by {assetType}, sorted by {sortName} descending
ms_my: Menunjukkan {currentItemRange} daripada {totalItemsCount}, ditapis mengikut {assetType}, diisih mengikut {sortName} menurun
