Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Library cannot have more than {} Components
ms_my: Pustaka tidak boleh mempunyai lebih daripada {} Komponen

source: All Rights Reserved.
ms_my: Hak Cipta Terpelihara.

source: Creative Commons Attribution 4.0
ms_my: Atribusi Creative Commons 4.0

source: Creative Commons Attribution-NonCommercial 4.0
ms_my: Atribusi-Bukan Komersial Creative Commons 4.0

source: Creative Commons Attribution-NonCommercial-NoDerivatives 4.0
ms_my: Atribusi Creative Commons-Bukan Komersial-TiadaDerivatif 4.0

source: Creative Commons Attribution-NonCommercial-ShareAlike 4.0
ms_my: Atribusi-Bukan Komersial-PerkongsianSerupa Creative Commons 4.0

source: Creative Commons Attribution-NoDerivatives 4.0
ms_my: Atribusi Creative Commons-TiadaDerivatif 4.0

source: Creative Commons Attribution-ShareAlike 4.0
ms_my: Atribusi-KongsiSerupa Creative Commons 4.0

source: Administer users and author content
ms_my: Mentadbir kandungan pengguna dan pengarang

source: Author content
ms_my: Kandungan pengarang

source: Read-only
ms_my: Baca sahaja

source: Task was created, but not queued to run.
ms_my: Tugas telah dibuat, tetapi tidak beratur untuk dijalankan.

source: Task was created and queued to run.
ms_my: Tugas telah dibuat dan beratur untuk dijalankan.

source: Task is running.
ms_my: Tugas sedang berjalan.

source: Task finished, but some blocks failed to import.
ms_my: Tugasan selesai, tetapi beberapa blok gagal diimport.

source: Task finished successfully.
ms_my: Tugasan selesai dengan jayanya.

source: state
ms_my: negeri

source: The state of the block import task.
ms_my: Keadaan tugas import blok.

source: progress
ms_my: kemajuan

source: A float from 0.0 to 1.0 representing the task progress.
ms_my: Apungan dari 0.0 hingga 1.0 mewakili kemajuan tugas.

source: course ID
ms_my: ID kursus

source: ID of the imported course.
ms_my: ID kursus yang diimport.

source: open edx user
ms_my: buka pengguna edx

source: lti platform identifier
ms_my: pengecam platform lti

source: The LTI platform identifier to which this profile belongs to.
ms_my: Pengecam platform LTI yang dimiliki oleh profil ini.

source: client identifier
ms_my: pengecam pelanggan

source: The LTI client identifier generated by the LTI platform.
ms_my: Pengecam klien LTI yang dijana oleh platform LTI.

source: subject identifier
ms_my: pengecam subjek

source: Identifies the entity that initiated the launch request, commonly a user.
ms_my: Mengenal pasti entiti yang memulakan permintaan pelancaran, biasanya pengguna.

source: The authorized LTI profile that launched the resource (identifies the user).
ms_my: Profil LTI yang dibenarkan yang melancarkan sumber (mengenal pasti pengguna).

source: The usage key string of the resource serving the content of this launch.
ms_my: Rentetan kunci penggunaan sumber yang menyajikan kandungan pelancaran ini.

source: The LTI platform descriptive title for this resource.
ms_my: Tajuk deskriptif platform LTI untuk sumber ini.

source: If AGS was enabled during launch, this should hold the lineitem ID.
ms_my: Jika AGS didayakan semasa pelancaran, ini harus memegang ID item baris.

source: We could not find a user with that email address.
ms_my: Kami tidak dapat mencari pengguna dengan alamat e-mel itu.

source: This user already has access to this library.
ms_my: Pengguna ini sudah mempunyai akses kepada pustaka ini.

source: Loading
ms_my: Memuatkan

source: Expired
ms_my: Tamat tempoh

source: Staged Content
ms_my: Kandungan Berperingkat

source: Content tags applied to these blocks
ms_my: Teg kandungan digunakan pada blok ini

source: Original usage key/ID of the thing that is in the clipboard.
ms_my: Kunci/ID penggunaan asal benda yang ada dalam papan keratan.

source: owner
ms_my: pemilik

source: Organization that is related to this taxonomy.If None, then this taxonomy is related to all organizations.
ms_my: Organisasi yang berkaitan dengan taksonomi ini. Jika Tiada, maka taksonomi ini berkaitan dengan semua organisasi.

source: List of domains that are allowed to make cross-domain requests to this site. Please list each domain on its own line.
ms_my: Senarai domain yang dibenarkan membuat permintaan merentas domain ke tapak ini. Sila senaraikan setiap domain pada barisnya sendiri.

source: Default Group
ms_my: Kumpulan Lalai

source: You cannot create two cohorts with the same name
ms_my: Anda tidak boleh membuat dua kohort dengan nama yang sama

source: There must be one cohort to which students can automatically be assigned.
ms_my: Mesti ada satu kohort yang pelajar boleh ditugaskan secara automatik.

source: A cohort with the same name already exists.
ms_my: Kohort dengan nama yang sama sudah wujud.

source: If disabled, the LTI in the associated course will be disabled.
ms_my: Jika dilumpuhkan, LTI dalam kursus yang berkaitan akan dilumpuhkan.

source: The LTI configuration data for this course/provider.
ms_my: Data konfigurasi LTI untuk kursus/pembekal ini.

source: LTI provider
ms_my: Pembekal LTI

source: The LTI provider's id
ms_my: Id penyedia LTI

source: True, if LTI credential are provided by Org globally
ms_my: Benar, jika kelayakan LTI disediakan oleh Org secara global

source: Live
ms_my: Langsung

source: Enable in-platform video conferencing by configuring live
ms_my: Dayakan persidangan video dalam platform dengan mengkonfigurasi secara langsung

source: Credentials
ms_my: Tauliah

source: Internal Service URL
ms_my: URL Perkhidmatan Dalaman

source: Public Service URL
ms_my: URL Perkhidmatan Awam

source: Enable Learner Issuance
ms_my: Dayakan Terbitan Pelajar

source: Enable issuance of credentials via Credential Service.
ms_my: Dayakan pengeluaran bukti kelayakan melalui Perkhidmatan Kredensial.

source: Enable Authoring of Credential in Studio
ms_my: Dayakan Pengarangan Kredensial dalam Studio

source: Enable authoring of Credential Service credentials in Studio.
ms_my: Dayakan pengarangan bukti kelayakan Perkhidmatan Kredensial dalam Studio.

source: Course Credit Eligibility
ms_my: Kelayakan Kredit Kursus

source: You are eligible for credit from {providers_string}
ms_my: Anda layak mendapat kredit daripada {providers_string}

source: {first_provider} and {second_provider}
ms_my: {first_provider} dan {second_provider}

source: {first_providers}, and {last_provider}
ms_my: {first_providers} dan {last_provider}

source: [{username}] is not eligible for credit for [{course_key}].
ms_my: [{username}] tidak layak untuk kredit untuk [{course_key}].

source: [{course_key}] is not a valid course key.
ms_my: [{course_key}] bukan kunci kursus yang sah.

source: Unique identifier for this credit provider. Only alphanumeric characters and hyphens (-) are allowed. The identifier is case-sensitive.
ms_my: Pengecam unik untuk penyedia kredit ini. Hanya aksara abjad angka dan sempang (-) dibenarkan. Pengecam adalah sensitif huruf besar-besaran.

source: Whether the credit provider is currently enabled.
ms_my: Sama ada penyedia kredit didayakan pada masa ini.

source: Name of the credit provider displayed to users
ms_my: Nama pembekal kredit dipaparkan kepada pengguna

source: When true, automatically notify the credit provider when a user requests credit. In order for this to work, a shared secret key MUST be configured for the credit provider in secure auth settings.
ms_my: Apabila benar, maklumkan pembekal kredit secara automatik apabila pengguna meminta kredit. Agar ini berfungsi, kunci rahsia yang dikongsi MESTI dikonfigurasikan untuk pembekal kredit dalam tetapan pengesahan selamat.

source: URL of the credit provider. If automatic integration is enabled, this will the the end-point that we POST to to notify the provider of a credit request. Otherwise, the user will be shown a link to this URL, so the user can request credit from the provider directly.
ms_my: URL penyedia kredit. Jika penyepaduan automatik didayakan, ini akan menjadi titik akhir yang kami POSKAN untuk memberitahu penyedia permintaan kredit. Jika tidak, pengguna akan ditunjukkan pautan ke URL ini, jadi pengguna boleh meminta kredit daripada pembekal secara langsung.

source: URL from the credit provider where the user can check the status of his or her request for credit. This is displayed to students *after* they have requested credit.
ms_my: URL daripada penyedia kredit di mana pengguna boleh menyemak status permintaan kreditnya. Ini dipaparkan kepada pelajar *selepas* mereka meminta kredit.

source: Description for the credit provider displayed to users.
ms_my: Perihalan untuk pembekal kredit dipaparkan kepada pengguna.

source: Plain text or html content for displaying custom message inside credit eligibility email content which is sent when user has met all credit eligibility requirements.
ms_my: Teks biasa atau kandungan html untuk memaparkan mesej tersuai di dalam kandungan e-mel kelayakan kredit yang dihantar apabila pengguna telah memenuhi semua keperluan kelayakan kredit.

source: Thumbnail image url of the credit provider.
ms_my: URL imej kecil penyedia kredit.

source: Credit requirement statuses
ms_my: Status keperluan kredit

source: Deadline for purchasing and requesting credit.
ms_my: Tarikh akhir untuk membeli dan meminta kredit.

source: Preview Language Administration
ms_my: Pratonton Pentadbiran Bahasa

source: Language not provided
ms_my: Bahasa tidak disediakan

source: Language set to {preview_language}
ms_my: Bahasa ditetapkan kepada {preview_language}

source: Language reset to the default
ms_my: Tetapkan semula bahasa kepada lalai

source: This is a test message
ms_my: Ini adalah mesej ujian

source: This is a success message
ms_my: Ini adalah mesej kejayaan

source: This is a test warning
ms_my: Ini adalah amaran ujian

source: This is a test error
ms_my: Ini adalah ralat ujian

source: {provider} requires that LTI advanced sharing be enabled for your course, as this provider uses email address and username to personalize the experience. Please contact {support_contact} to enable this feature.
ms_my: {provider} memerlukan perkongsian lanjutan LTI didayakan untuk kursus anda, kerana penyedia ini menggunakan alamat e-mel dan nama pengguna untuk memperibadikan pengalaman. Sila hubungi {support_contact} untuk mendayakan ciri ini.

source: technical support
ms_my: sokongan teknikal

source: Allow List
ms_my: Benarkan Senarai

source: Deny List
ms_my: Nafikan Senarai

source: Learning Context Key
ms_my: Kunci Konteks Pembelajaran

source: If disabled, the discussions in the associated learning context/course will be disabled.
ms_my: Jika dilumpuhkan, perbincangan dalam konteks/kursus pembelajaran yang berkaitan akan dilumpuhkan.

source: The Posting availability in discussions whether it will be enabled, scheduled or indefinitely disabled.
ms_my: Ketersediaan Penyiaran dalam perbincangan sama ada ia akan didayakan, dijadualkan atau dilumpuhkan selama-lamanya.

source: The LTI configuration data for this context/provider.
ms_my: Data konfigurasi LTI untuk konteks/pembekal ini.

source: If enabled, discussion topics will be created for each non-graded unit in the course. A UI for discussions will show up with each unit.
ms_my: Jika didayakan, topik perbincangan akan dibuat untuk setiap unit bukan gred dalam kursus. UI untuk perbincangan akan dipaparkan dengan setiap unit.

source: If enabled, discussion topics will be created for graded units as well.
ms_my: Jika didayakan, topik perbincangan akan dibuat untuk unit yang digredkan juga.

source: If enabled, discussions will need to be manually enabled for each unit.
ms_my: Jika didayakan, perbincangan perlu didayakan secara manual untuk setiap unit.

source: The plugin configuration data for this context/provider.
ms_my: Data konfigurasi pemalam untuk konteks/penyedia ini.

source: Discussion provider
ms_my: Penyedia perbincangan

source: The discussion tool/provider's id
ms_my: Alat perbincangan/id pembekal

source: Context key for context in which this discussion topic exists.
ms_my: Kunci konteks untuk konteks di mana topik perbincangan ini wujud.

source: Usage key for in-context discussion topic. Set to null for course-level topics.
ms_my: Kunci penggunaan untuk topik perbincangan dalam konteks. Tetapkan kepada nol untuk topik peringkat kursus.

source: Title for discussion topic.
ms_my: Tajuk untuk topik perbincangan.

source: Group for divided discussions.
ms_my: Kumpulan untuk perbincangan dibahagikan.

source: Provider id for discussion provider.
ms_my: Id pembekal untuk pembekal perbincangan.

source: Discussion context ID in external forum provider. e.g. commentable_id for cs_comments_service.
ms_my: ID konteks perbincangan dalam pembekal forum luaran. cth. commentable_id untuk cs_comments_service.

source: Whether this topic should be shown in-context in the course.
ms_my: Sama ada topik ini perlu ditunjukkan dalam konteks dalam kursus.

source: Ordering of this topic in its learning context
ms_my: Susunan topik ini dalam konteks pembelajarannya

source: Additional context for this topic, such as its section, and subsection
ms_my: Konteks tambahan untuk topik ini, seperti bahagiannya dan subbahagian

source: Encourage participation and engagement in your course with discussions.
ms_my: Galakkan penyertaan dan penglibatan dalam kursus anda dengan perbincangan.

source: Administrator
ms_my: Pentadbir

source: Group Moderator
ms_my: Moderator Kumpulan

source: Community TA
ms_my: TA komuniti

source: Student
ms_my: Pelajar

source: COURSE NOT FOUND. Please check that the course ID is valid.
ms_my: KURSUS TIDAK DITEMUI. Sila semak bahawa ID kursus adalah sah.

source: The course key for the restricted course.
ms_my: Kunci kursus untuk kursus terhad.

source: The message to show when a user is blocked from enrollment.
ms_my: Mesej untuk ditunjukkan apabila pengguna disekat daripada pendaftaran.

source: The message to show when a user is blocked from accessing a course.
ms_my: Mesej untuk ditunjukkan apabila pengguna disekat daripada mengakses kursus.

source: Allow users who enrolled in an allowed country to access restricted courses from excluded countries.
ms_my: Benarkan pengguna yang mendaftar di negara yang dibenarkan mengakses kursus terhad dari negara yang dikecualikan.

source: Two character ISO country code.
ms_my: Kod negara ISO dua aksara.

source: Whether to include or exclude the given course. If whitelist countries are specified, then ONLY users from whitelisted countries will be able to access the course. If blacklist countries are specified, then users from blacklisted countries will NOT be able to access the course.
ms_my: Sama ada untuk memasukkan atau mengecualikan kursus yang diberikan. Jika negara senarai putih ditentukan, maka HANYA pengguna dari negara yang disenarai putih akan dapat mengakses kursus. Jika negara senarai hitam ditentukan, maka pengguna dari negara senarai hitam TIDAK akan dapat mengakses kursus.

source: The course to which this rule applies.
ms_my: Kursus yang peraturan ini terpakai.

source: The country to which this rule applies.
ms_my: Negara yang peraturan ini terpakai.

source: Whitelist {country} for {course}
ms_my: Senarai putih {country} untuk {course}

source: Blacklist {country} for {course}
ms_my: Senarai hitam {country} untuk {course}

source: Notification App
ms_my: Apl Pemberitahuan

source: Notification Type
ms_my: Jenis Pemberitahuan

source: <{p}><{strong}>{replier_name}</{strong}> commented on your response to the post <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}><{strong}>{replier_name}</{strong}> mengulas pada respons anda pada siaran <{strong}>{post_title}</{strong}></{p}>

source: <{p}><{strong}>{replier_name}</{strong}> commented on <{strong}>{author_name}</{strong}> response to your post <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}><{strong}>{replier_name}</{strong}> mengulas pada <{strong}>{author_name}</{strong}> respons kepada siaran anda <{strong}>{post_title}</{strong}></{p}>

source: <{p}><{strong}>{replier_name}</{strong}> responded to your post <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}><{strong}>{replier_name}</{strong}> membalas siaran anda <{strong}>{post_title}</{strong}></{p}>

source: <{p}><{strong}>{username}</{strong}> posted <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}><{strong}>{username}</{strong}> menyiarkan <{strong}>{post_title}</{strong}></{p}>

source: <{p}><{strong}>{replier_name}</{strong}> and others started new discussions</{p}>
ms_my: <{p}><{strong}>{replier_name}</{strong}> dan yang lain memulakan perbincangan baharu</{p}>

source: <{p}><{strong}>{username}</{strong}> asked <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}><{strong}>{username}</{strong}> bertanya <{strong}>{post_title}</{strong}></{p}>

source: <{p}><{strong}>{replier_name}</{strong}> responded to a post you’re following: <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}><{strong}>{replier_name}</{strong}> membalas siaran yang anda ikuti: <{strong}>{post_title}</{strong}></{p}>

source: <{p}><{strong}>{replier_name}</{strong}> commented on <{strong}>{author_name}</{strong}> response in a post you’re following <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}><{strong}>{replier_name}</{strong}> mengulas pada jawapan <{strong}>{author_name}</{strong}> dalam siaran yang anda ikuti <{strong}>{post_title}</{strong}></{p}>

source: <{p}><{strong}>{replier_name}'s</{strong}> response has been endorsed in your post <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}><{strong}>{replier_name}'s</{strong}> respons telah disahkan dalam siaran anda <{strong}>{post_title}</{strong}></{p}>

source: <{p}>Your response has been endorsed on the post <{strong}>{post_title}</{strong}></{p}>
ms_my: <{p}>Respons anda telah disahkan pada siaran <{strong}>{post_title}</{strong}></{p}>

source: <{p}>You have a new open response submission awaiting for review for <{strong}>{ora_name}</{strong}></{p}>
ms_my: <{p}>Anda mempunyai penyerahan respons terbuka baharu yang menunggu untuk semakan untuk <{strong}>{ora_name}</{strong}></{p}>

source: <{p}>You have received {points_earned} out of {points_possible} on your assessment: <{strong}>{ora_name}</{strong}></{p}>
ms_my: <{p}>Anda telah menerima {points_earned} daripada {points_possible} pada penilaian anda: <{strong}>{ora_name}</{strong}></{p}>

source: Notifications for responses and comments on your posts, and the ones you’re following, including endorsements to your responses and on your posts.
ms_my: Pemberitahuan untuk respons dan ulasan pada siaran anda, dan yang anda ikuti, termasuk sokongan pada respons anda dan pada siaran anda.

source: Notifications for new announcements and updates from the course team.
ms_my: Pemberitahuan untuk pengumuman baharu dan kemas kini daripada pasukan kursus.

source: Notifications for submission grading.
ms_my: Pemberitahuan untuk penggredan penyerahan.

source: Daily
ms_my: Setiap hari

source: Weekly
ms_my: Mingguan

source: Immediately
ms_my: serta merta

source: Never
ms_my: tidak pernah

source: Email Digest Preferences Updated
ms_my: Keutamaan Ringkasan E-mel Dikemas kini

source: You have successfully unsubscribed from email digest for learning activity
ms_my: Anda telah berjaya menyahlanggan ringkasan e-mel untuk aktiviti pembelajaran

source: The notification preference config version is not up to date.
ms_my: Versi konfigurasi keutamaan pemberitahuan tidak terkini.

source: Invalid app name.
ms_my: Nama apl tidak sah.

source: Notifications marked as seen.
ms_my: Pemberitahuan ditandai sebagai dilihat.

source: Notification marked read.
ms_my: Pemberitahuan ditanda dibaca.

source: Notifications marked read.
ms_my: Pemberitahuan ditanda dibaca.

source: Invalid app_name or notification_id.
ms_my: app_name atau notification_id tidak sah.

source: Comma-separated list of scopes that this application will be allowed to request.
ms_my: Senarai skop yang dipisahkan koma yang dibenarkan untuk diminta oleh aplikasi ini.

source: Comma-separated list of filters that this application will be allowed to request.
ms_my: Senarai penapis yang dipisahkan koma yang dibenarkan untuk diminta oleh aplikasi ini.

source: Content Provider
ms_my: Pembekal Kandungan

source: Password Policy
ms_my: Dasar Kata Laluan

source: {strong_tag_open}We recently changed our password requirements{strong_tag_close}{break_line_tag}Your current password does not meet the new security requirements. We just sent a password-reset message to the email address associated with this account. Thank you for helping us keep your data safe.
ms_my: {strong_tag_open}Kami telah menukar keperluan kata laluan kami baru-baru ini{strong_tag_close}{break_line_tag}Kata laluan semasa anda tidak memenuhi keperluan keselamatan baharu. Kami baru sahaja menghantar mesej tetapan semula kata laluan ke alamat e-mel yang dikaitkan dengan akaun ini. Terima kasih kerana membantu kami memastikan data anda selamat.

source: {strong_tag_open}Required Action: Please update your password{strong_tag_close}{break_line_tag}As of {deadline}, {platform_name} will require all learners to have complex passwords. Your current password does not meet these requirements. To reset your password, go to to {anchor_tag_open}Account Settings{anchor_tag_close}.
ms_my: {strong_tag_open}Tindakan yang Diperlukan: Sila kemas kini kata laluan anda{strong_tag_close}{break_line_tag}Sehingga {deadline}, {platform_name} akan memerlukan semua pelajar mempunyai kata laluan yang kompleks. Kata laluan semasa anda tidak memenuhi keperluan ini. Untuk menetapkan semula kata laluan anda, pergi ke {anchor_tag_open}Tetapan Akaun{anchor_tag_close}.

source: The file must be smaller than {image_max_size} in size.
ms_my: Fail mestilah lebih kecil daripada saiz {image_max_size}.

source: The file must be at least {image_min_size} in size.
ms_my: Saiz fail mestilah sekurang-kurangnya {image_min_size}.

source: The file must be one of the following types: {valid_file_types}.
ms_my: Fail mestilah salah satu daripada jenis berikut: {valid_file_types}.

source: The Content-Type header for this file does not match the file data. The file may be corrupted.
ms_my: Pengepala Jenis Kandungan untuk fail ini tidak sepadan dengan data fail. Fail mungkin rosak.

source: The file name extension for this file does not match the file data. The file may be corrupted.
ms_my: Sambungan nama fail untuk fail ini tidak sepadan dengan data fail. Fail mungkin rosak.

source: bytes
ms_my: bait

source: No file provided for profile image
ms_my: Tiada fail disediakan untuk imej profil

source: If disabled, the LTI in the associated program will be disabled.
ms_my: Jika dilumpuhkan, LTI dalam program yang berkaitan akan dilumpuhkan.

source: The LTI configuration data for this program/provider.
ms_my: Data konfigurasi LTI untuk program/pembekal ini.

source: Known Error Case
ms_my: Kes Ralat Diketahui

source: Schedule start < course start
ms_my: Jadual mula < mula kursus

source: Course Id
ms_my: Id Kursus

source: All
ms_my: Semua

source: Experience
ms_my: Pengalaman

source: Course ID
ms_my: ID Kursus

source: Schedules
ms_my: Jadual

source: Indicates if this schedule is actively used
ms_my: Menunjukkan jika jadual ini digunakan secara aktif

source: Date this schedule went into effect
ms_my: Tarikh jadual ini berkuat kuasa

source: Deadline by which the learner must upgrade to a verified seat
ms_my: Tarikh akhir yang mana pelajar mesti naik taraf kepada tempat duduk yang disahkan

source: Schedule
ms_my: Jadual

source: By %(filter_title)s
ms_my: Oleh %(filter_title)s

source: Welcome to week %(week_num)s of %(course_name)s!
ms_my: Selamat datang ke minggu %(week_num)s daripada %(course_name)s!
