Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: You have selected “Delete my account.” Deletion of your account and personal data is permanent and cannot be undone. {platformName} will not be able to recover your account or the data that is deleted.
ms_my: Anda telah memilih "Padam akaun saya." Pemadaman akaun dan data peribadi anda adalah kekal dan tidak boleh dibuat asal. {platformName} tidak akan dapat memulihkan akaun anda atau data yang dipadamkan.

source: If you proceed, you will be unable to use this account to take courses on the {platformName} app, {siteName}, or any other site hosted by {platformName}.
ms_my: Jika anda meneruskan, anda tidak akan dapat menggunakan akaun ini untuk mengikuti kursus pada apl {platformName}, {siteName} atau mana-mana tapak lain yang dihoskan oleh {platformName}.

source: If you still wish to continue and delete your account, please enter your account password:
ms_my: Jika anda masih ingin meneruskan dan memadam akaun anda, sila masukkan kata laluan akaun anda:

source: Yes, Delete
ms_my: Ya, Padam

source: We're sorry to see you go! Your account will be deleted shortly.
ms_my: Kami kesal melihat anda pergi! Akaun anda akan dipadamkan sebentar lagi.

source: Account deletion, including removal from email lists, may take a few weeks to fully process through our system. If you want to opt-out of emails before then, please unsubscribe from the footer of any email.
ms_my: Pemadaman akaun, termasuk pengalihan keluar daripada senarai e-mel, mungkin mengambil masa beberapa minggu untuk diproses sepenuhnya melalui sistem kami. Jika anda ingin menarik diri daripada e-mel sebelum itu, sila nyahlanggan daripada pengaki mana-mana e-mel.

source: Terms of Service and Honor Code
ms_my: Syarat Perkhidmatan dan Kod Kehormat

source: Saving your email preference
ms_my: Menyimpan pilihan e-mel anda

source: Enrolling you in the selected course
ms_my: Mendaftarkan anda dalam kursus yang dipilih

source: Adding the selected course to your cart
ms_my: Menambah kursus yang dipilih pada troli anda

source: Loading your courses
ms_my: Memuatkan kursus anda

source: An error occurred.
ms_my: Ralat berlaku.

source: (optional)
ms_my: (pilihan)

source: We couldn't sign you in.
ms_my: Kami tidak dapat melog masuk anda.

source: An error occurred when signing you in to %s.
ms_my: Ralat berlaku semasa melog masuk anda ke %s.

source: Check Your Email
ms_my: Semak E-mel Anda

source: An error has occurred. Try refreshing the page, or check your Internet connection.
ms_my: Ralat telah berlaku. Cuba muat semula halaman atau semak sambungan Internet anda.

source: In order to sign in, you need to activate your account.{line_break}{line_break}We just sent an activation link to {strong_start} {email} {strong_end}. If you do not receive an email, check your spam folders or {anchorStart}contact {platform_name} Support{anchorEnd}.
ms_my: Untuk melog masuk, anda perlu mengaktifkan akaun anda.{line_break}{line_break}Kami baru sahaja menghantar pautan pengaktifan ke {strong_start} {email} {strong_end}. Jika anda tidak menerima e-mel, semak folder spam anda atau {anchorStart}hubungi Sokongan {platform_name}{anchorEnd}.

source: An unexpected error has occurred.
ms_my: Ralat yang tidak dijangka telah berlaku.

source: You have successfully signed into %(currentProvider)s, but your %(currentProvider)s account does not have a linked %(platformName)s account. To link your accounts, sign in now using your %(platformName)s password.
ms_my: Anda telah berjaya melog masuk ke %(currentProvider)s, tetapi akaun %(currentProvider)s anda tidak mempunyai akaun %(platformName)s yang dipautkan. Untuk memautkan akaun anda, log masuk sekarang menggunakan kata laluan %(platformName)s anda.

source: We couldn't create your account.
ms_my: Kami tidak dapat membuat akaun anda.

source: Create Account
ms_my: Buat Akaun

source: (required)
ms_my: (diperlukan)

source: You've successfully signed into %(currentProvider)s.
ms_my: Anda telah berjaya melog masuk ke %(currentProvider)s.

source: We just need a little more information before you start learning with %(platformName)s.
ms_my: Kami hanya memerlukan sedikit lagi maklumat sebelum anda mula belajar dengan %(platformName)s.

source: Your profile settings are managed by {enterprise_name}. Contact your administrator or {link_start}edX Support{link_end} for help.
ms_my: Tetapan profil anda diurus oleh {enterprise_name}. Hubungi pentadbir anda atau {link_start}Sokongan edX{link_end} untuk mendapatkan bantuan.

source: Email Address (Sign In)
ms_my: Alamat E-mel (Log Masuk)

source: You receive messages from {platform_name} and course teams at this address.
ms_my: Anda menerima mesej daripada {platform_name} dan pasukan kursus di alamat ini.

source: Recovery Email Address
ms_my: Alamat E-mel Pemulihan

source: You may access your account with this address if single-sign on or access to your primary email is not available.
ms_my: Anda boleh mengakses akaun anda dengan alamat ini jika log masuk tunggal atau akses kepada e-mel utama anda tidak tersedia.

source: Full Name
ms_my: Nama Penuh

source: The name that is used for ID verification and that appears on your certificates.
ms_my: Nama yang digunakan untuk pengesahan ID dan yang muncul pada sijil anda.

source: Country or Region of Residence
ms_my: Negara atau Wilayah Tempat Tinggal

source: The country or region where you live.
ms_my: Negara atau wilayah tempat anda tinggal.

source: Basic Account Information
ms_my: Maklumat Akaun Asas

source: These settings include basic information about your account.
ms_my: Tetapan ini termasuk maklumat asas tentang akaun anda.

source: The name that identifies you on {platform_name}. You cannot change your username.
ms_my: Nama yang mengenal pasti anda pada {platform_name}. Anda tidak boleh menukar nama pengguna anda.

source: Password
ms_my: Kata laluan

source: Check your email account for instructions to reset your password.
ms_my: Semak akaun e-mel anda untuk mendapatkan arahan untuk menetapkan semula kata laluan anda.

source: The language used throughout this site. This site is currently available in a limited number of languages. Changing the value of this field will cause the page to refresh.
ms_my: Bahasa yang digunakan di seluruh laman web ini. Laman web ini tersedia dalam bilangan bahasa yang terhad. Menukar nilai medan ini akan menyebabkan halaman dimuat semula.

source: Time Zone
ms_my: Zon Masa

source: Select the time zone for displaying course dates. If you do not specify a time zone, course dates, including assignment deadlines, will be displayed in your browser's local time zone.
ms_my: Pilih zon waktu untuk memaparkan tarikh kursus. Jika anda tidak menentukan zon waktu, tarikh kursus, termasuk tarikh akhir tugasan, akan dipaparkan dalam zon waktu tempatan penyemak imbas anda.

source: All Time Zones
ms_my: Semua Zon Masa

source: Default (Local Time Zone)
ms_my: Lalai (Zon Waktu Setempat)

source: Additional Information
ms_my: Maklumat Tambahan

source: Education Completed
ms_my: Pendidikan Selesai

source: Gender
ms_my: Jantina

source: Year of Birth
ms_my: Tahun Lahir

source: Preferred Language
ms_my: Bahasa Pilihan

source: We've sent a confirmation message to {new_secondary_email_address}. Click the link in the message to update your secondary email address.
ms_my: Kami telah menghantar mesej pengesahan ke {new_secondary_email_address}. Klik pautan dalam mesej untuk mengemas kini alamat e-mel kedua anda.

source: Social Media Links
ms_my: Pautan Media Sosial

source: Optionally, link your personal accounts to the social media icons on your edX profile.
ms_my: Secara pilihan, pautkan akaun peribadi anda ke ikon media sosial pada profil edX anda.

source: {platform_display_name} Link
ms_my: Pautan {platform_display_name}.

source: Enter your {platform_display_name} username or the URL to your {platform_display_name} page. Delete the URL to remove the link.
ms_my: Masukkan nama pengguna {platform_display_name} anda atau URL ke halaman {platform_display_name} anda. Padamkan URL untuk mengalih keluar pautan.

source: Linked Accounts
ms_my: Akaun Terpaut

source: You can link your social media accounts to simplify signing in to {platform_name}.
ms_my: Anda boleh memautkan akaun media sosial anda untuk memudahkan log masuk ke {platform_name}.

source: ORDER NAME
ms_my: NAMA PESANAN

source: ORDER PLACED
ms_my: PESANAN DILETAKKAN

source: TOTAL
ms_my: JUMLAH

source: ORDER NUMBER
ms_my: NOMBOR PESANAN

source: My Orders
ms_my: Pesanan Saya

source: This page contains information about orders that you have placed with {platform_name}.
ms_my: Halaman ini mengandungi maklumat tentang pesanan yang telah anda buat dengan {platform_name}.

source: We've sent a confirmation message to {new_email_address}. Click the link in the message to update your email address.
ms_my: Kami telah menghantar mesej pengesahan kepada {new_email_address}. Klik pautan dalam mesej untuk mengemas kini alamat e-mel anda.

source: You must sign out and sign back in before your language changes take effect.
ms_my: Anda mesti log keluar dan log masuk semula sebelum perubahan bahasa anda berkuat kuasa.

source: We've sent a message to {email}. Click the link in the message to reset your password. Didn't receive the message? Contact {anchorStart}technical support{anchorEnd}.
ms_my: Kami telah menghantar mesej kepada {email}. Klik pautan dalam mesej untuk menetapkan semula kata laluan anda. Tidak menerima mesej? Hubungi {anchorStart}sokongan teknikal{anchorEnd}.

source: Link your {accountName} account
ms_my: Pautkan akaun {accountName} anda

source: Unlink This Account
ms_my: Nyahpaut Akaun Ini

source: You can use your {accountName} account to sign in to your {platformName} account.
ms_my: Anda boleh menggunakan akaun {accountName} anda untuk log masuk ke akaun {platformName} anda.

source: Unlink your {accountName} account
ms_my: Nyahpaut akaun {accountName} anda

source: Link Your Account
ms_my: Pautkan Akaun Anda

source: Link your {accountName} account to your {platformName} account and use {accountName} to sign in to {platformName}.
ms_my: Pautkan akaun {accountName} anda ke akaun {platformName} anda dan gunakan {accountName} untuk log masuk ke {platformName}.

source: Unlinking
ms_my: Menyahpaut

source: Linking
ms_my: Memautkan

source: Successfully unlinked.
ms_my: Berjaya dinyahpautkan.

source: Account Information
ms_my: Maklumat Akaun

source: Order History
ms_my: Sejarah Pesanan

source: You have set your language to {beta_language}, which is currently not fully translated. You can help us translate this language fully by joining the Transifex community and adding translations from English for learners that speak {beta_language}.
ms_my: Anda telah menetapkan bahasa anda kepada {beta_language}, yang pada masa ini tidak diterjemahkan sepenuhnya. Anda boleh membantu kami menterjemah bahasa ini sepenuhnya dengan menyertai komuniti Transifex dan menambahkan terjemahan daripada bahasa Inggeris untuk pelajar yang bertutur dalam {beta_language}.

source: Help Translate into {beta_language}
ms_my: Bantu Terjemah ke dalam {beta_language}

source: Image Upload Error
ms_my: Ralat Muat Naik Imej

source: Please verify that you have uploaded a valid image (PNG and JPEG).
ms_my: Sila sahkan bahawa anda telah memuat naik imej yang sah (PNG dan JPEG).

source: An error has occurred. Please try again later.
ms_my: Ralat telah berlaku. Sila cuba lagi kemudian.

source: Could not submit photos
ms_my: Tidak dapat menyerahkan foto

source: Professional Education Verified Certificate
ms_my: Sijil Disahkan Pendidikan Profesional

source: Professional Education
ms_my: Pendidikan Profesional

source: Verified Certificate upgrade
ms_my: Peningkatan Sijil Disahkan

source: Verified Certificate
ms_my: Sijil Disahkan

source: Checkout with PayPal
ms_my: Daftar keluar dengan PayPal

source: Checkout with {processor}
ms_my: Daftar keluar dengan {processor}

source: All payment options are currently unavailable.
ms_my: Semua pilihan pembayaran tidak tersedia pada masa ini.

source: Try the transaction again in a few minutes.
ms_my: Cuba transaksi sekali lagi dalam beberapa minit.

source: An error has occurred. Please try again.
ms_my: Ralat telah berlaku. Sila cuba lagi.

source: Could not submit order
ms_my: Tidak dapat menyerahkan pesanan

source: Take a photo of your ID
ms_my: Ambil gambar ID anda

source: Review your info
ms_my: Semak maklumat anda

source: An error has occurred. Please try reloading the page.
ms_my: Ralat telah berlaku. Sila cuba muat semula halaman.

source: Video Capture Error
ms_my: Ralat Tangkapan Video

source: Please verify that your webcam is connected and that you have allowed your browser to access it.
ms_my: Sila sahkan bahawa kamera web anda disambungkan dan anda telah membenarkan penyemak imbas anda mengaksesnya.

source: No Webcam Detected
ms_my: Tiada Webcam Dikesan

source: You don't seem to have a webcam connected.
ms_my: Anda nampaknya tidak mempunyai kamera web yang disambungkan.

source: Double-check that your webcam is connected and working to continue.
ms_my: Periksa semula sama ada kamera web anda disambungkan dan berfungsi untuk meneruskan.

source: Photo Captured successfully.
ms_my: Foto Berjaya Dirakam.

source: No Flash Detected
ms_my: Tiada Flash Dikesan

source: You don't seem to have Flash installed. Get Flash to continue your verification.
ms_my: Anda nampaknya belum memasang Flash. Dapatkan Flash untuk meneruskan pengesahan anda.

source: Editable
ms_my: Boleh diedit

source: Validation Error
ms_my: Ralat Pengesahan

source: In Progress
ms_my: Sedang Berlangsung

source: Placeholder
ms_my: Pemegang tempat

source: Your upload of '{file}' succeeded.
ms_my: Muat naik '{file}' anda berjaya.

source: Your upload of '{file}' failed.
ms_my: Muat naik '{file}' anda gagal.

source: Upload an image
ms_my: Muat naik imej

source: Change image
ms_my: Tukar imej

source: Image
ms_my: Imej

source: An error has occurred. Refresh the page, and then try again.
ms_my: Ralat telah berlaku. Muat semula halaman, dan kemudian cuba lagi.

source: The file must be at least {size} in size.
ms_my: Saiz fail mestilah sekurang-kurangnya {size}.

source: The file must be smaller than {size} in size.
ms_my: Fail mestilah lebih kecil daripada saiz {size}.

source: Upload is in progress. To avoid errors, stay on this page until the process is complete.
ms_my: Muat naik sedang dijalankan. Untuk mengelakkan ralat, kekal di halaman ini sehingga proses selesai.

source: Removal is in progress. To avoid errors, stay on this page until the process is complete.
ms_my: Pengalihan keluar sedang dijalankan. Untuk mengelakkan ralat, kekal di halaman ini sehingga proses selesai.

source: bytes
ms_my: bait

source: Course is not yet visible to students.
ms_my: Kursus masih belum dapat dilihat oleh pelajar.

source: You cannot view the course as a student or beta tester before the course release date.
ms_my: Anda tidak boleh melihat kursus sebagai pelajar atau penguji beta sebelum tarikh keluaran kursus.

source: Overall Score
ms_my: Skor Keseluruhan

source: Bookmark this page
ms_my: Tandai halaman ini

source: Bookmarked
ms_my: Ditanda buku

source: {total_results} result found for "{search_term}"
ms_my: {total_results} hasil carian ditemui untuk "{search_term}"

source: Profile Visibility:
ms_my: Keterlihatan Profil:

source: Limited Profile
ms_my: Profil terhad

source: Full Profile
ms_my: Profil Penuh

source: Joined
ms_my: Menyertai

source: Joined Date
ms_my: Tarikh Menyertai

source: Location
ms_my: Lokasi

source: Add Country
ms_my: Tambah Negara

source: Add language
ms_my: Tambah bahasa

source: About me
ms_my: Tentang saya

source: Tell other learners a little about yourself: where you live, what your interests are, why you're taking courses, or what you hope to learn.
ms_my: Beritahu pelajar lain sedikit tentang diri anda: di mana anda tinggal, minat anda, sebab anda mengambil kursus atau perkara yang ingin anda pelajari.

source: Account Settings page.
ms_my: Halaman Tetapan Akaun.

source: You must specify your birth year before you can share your full profile. To specify your birth year, go to the {account_settings_page_link}
ms_my: Anda mesti menyatakan tahun lahir anda sebelum anda boleh berkongsi profil penuh anda. Untuk menentukan tahun lahir anda, pergi ke {account_settings_page_link}

source: You must be over 13 to share a full profile. If you are over 13, make sure that you have specified a birth year on the {account_settings_page_link}
ms_my: Anda mesti berumur lebih dari 13 tahun untuk berkongsi profil penuh. Jika anda berumur lebih daripada 13 tahun, pastikan anda telah menetapkan tahun lahir pada {account_settings_page_link}

source: Profile Image
ms_my: Imej Profil

source: Profile image for {username}
ms_my: Imej profil untuk {username}

source: About Me
ms_my: Tentang Saya

source: Profile
ms_my: Profil

source: Updating with latest library content
ms_my: Mengemas kini dengan kandungan perpustakaan terkini

source: Creating missing groups
ms_my: Mencipta kumpulan yang hilang

source: {start_strong}{total}{end_strong} words submitted in total.
ms_my: {start_strong}{total}{end_strong} perkataan diserahkan secara keseluruhan.

source: Show Annotations
ms_my: Tunjukkan Anotasi

source: Hide Annotations
ms_my: Sembunyikan Anotasi

source: Expand Instructions
ms_my: Kembangkan Arahan

source: Collapse Instructions
ms_my: Runtuhkan Arahan

source: Commentary
ms_my: Ulasan

source: Reply to Annotation
ms_my: Balas kepada Anotasi

source: {num_points} point possible (graded, results hidden)
ms_my: {num_points} mata mungkin (digredkan, keputusan disembunyikan)

source: {num_points} point possible (ungraded, results hidden)
ms_my: {num_points} mata mungkin (digredkan, keputusan disembunyikan)

source: {num_points} point possible (graded)
ms_my: {num_points} mata mungkin (digredkan)

source: {num_points} point possible (ungraded)
ms_my: {num_points} mata mungkin (tidak dinilai)

source: {earned}/{possible} point (graded)
ms_my: {earned}/{possible} mata (gred)

source: {earned}/{possible} point (ungraded)
ms_my: {earned}/{possible} mata (tidak dinilai)

source: The grading process is still running. Refresh the page to see updates.
ms_my: Proses penggredan masih berjalan. Muat semula halaman untuk melihat kemas kini.

source: Could not grade your answer. The submission was aborted.
ms_my: Tidak dapat menilai jawapan anda. Penyerahan telah dibatalkan.

source: Submission aborted! Sorry, your browser does not support file uploads. If you can, please use Chrome or Safari which have been verified to support file uploads.
ms_my: Penyerahan dibatalkan! Maaf, penyemak imbas anda tidak menyokong muat naik fail. Jika boleh, sila gunakan Chrome atau Safari yang telah disahkan untuk menyokong muat naik fail.

source: You submitted {filename}; only {allowedFiles} are allowed.
ms_my: Anda menyerahkan {filename}; hanya {allowedFiles} dibenarkan.

source: Your file {filename} is too large (max size: {maxSize}MB).
ms_my: Fail anda {filename} terlalu besar (saiz maksimum: {maxSize}MB).

source: You did not submit the required files: {requiredFiles}.
ms_my: Anda tidak menyerahkan fail yang diperlukan: {requiredFiles}.

source: You did not select any files to submit.
ms_my: Anda tidak memilih sebarang fail untuk diserahkan.

source: This problem has been reset.
ms_my: Masalah ini telah ditetapkan semula.

source: unsubmitted
ms_my: belum diserahkan

source: Paragraph
ms_my: Perenggan

source: Preformatted
ms_my: Praformat

source: Heading 3
ms_my: Tajuk 3

source: Heading 4
ms_my: Tajuk 4

source: Heading 5
ms_my: Tajuk 5

source: Heading 6
ms_my: Tajuk 6

source: Add to Dictionary
ms_my: Tambahkan pada Kamus

source: Align center
ms_my: Jajarkan tengah

source: Align left
ms_my: Jajar ke kiri

source: Align right
ms_my: Sejajar ke kanan

source: Alignment
ms_my: Penjajaran

source: Alternative source
ms_my: Sumber alternatif

source: Anchor
ms_my: Sauh

source: Anchors
ms_my: sauh

source: Author
ms_my: Pengarang

source: Background color
ms_my: Warna latar belakang

source: Blocks
ms_my: Blok

source: Body
ms_my: Badan

source: Bold
ms_my: berani

source: Border color
ms_my: Warna sempadan

source: Border
ms_my: Sempadan

source: Bottom
ms_my: Bawah

source: Bullet list
ms_my: Senarai peluru

source: Caption
ms_my: Kapsyen

source: Cell padding
ms_my: Pelapik sel

source: Cell properties
ms_my: Sifat sel

source: Cell spacing
ms_my: Jarak sel

source: Cell type
ms_my: Jenis sel

source: Cell
ms_my: sel

source: Center
ms_my: Pusat

source: Circle
ms_my: Bulatan

source: Clear formatting
ms_my: Pemformatan yang jelas

source: Code block
ms_my: Blok kod

source: Code
ms_my: Kod

source: Color
ms_my: warna

source: Cols
ms_my: Kol

source: Column group
ms_my: Kumpulan lajur

source: Column
ms_my: Lajur

source: Constrain proportions
ms_my: Mengekang perkadaran

source: Copy row
ms_my: Salin baris

source: Copy
ms_my: salin

source: Could not find the specified string.
ms_my: Tidak dapat mencari rentetan yang ditentukan.

source: Custom color
ms_my: Warna tersuai

source: Custom...
ms_my: tersuai...

source: Cut row
ms_my: Potong baris

source: Cut
ms_my: potong

source: Decrease indent
ms_my: Kurangkan inden

source: Default
ms_my: Lalai

source: Delete column
ms_my: Padam lajur

source: Delete row
ms_my: Padamkan baris

source: Delete table
ms_my: Padam jadual

source: Description
ms_my: Penerangan

source: Dimensions
ms_my: Dimensi

source: Disc
ms_my: Cakera

source: Document properties
ms_my: Sifat dokumen

source: Edit
ms_my: Sunting

source: Embed
ms_my: Benamkan

source: Emoticons
ms_my: Emotikon

source: Encoding
ms_my: Pengekodan

source: File
ms_my: Fail

source: Find and replace
ms_my: Cari dan ganti

source: Find next
ms_my: Cari seterusnya

source: Find previous
ms_my: Cari sebelumnya

source: Find
ms_my: Cari

source: Finish
ms_my: Selesai

source: Font Family
ms_my: Keluarga Font

source: Font Sizes
ms_my: Saiz Font

source: Footer
ms_my: Pengaki

source: Formats
ms_my: Format

source: Fullscreen
ms_my: Skrin penuh

source: General
ms_my: Umum

source: H Align
ms_my: H Sejajar

source: Header 1
ms_my: Tajuk 1

source: Header 2
ms_my: Tajuk 2

source: Header 3
ms_my: Tajuk 3

source: Header 4
ms_my: Tajuk 4

source: Header 5
ms_my: Tajuk 5

source: Header 6
ms_my: Tajuk 6

source: Header cell
ms_my: Sel pengepala

source: Header
ms_my: Pengepala

source: Headers
ms_my: Pengepala

source: Heading 1
ms_my: Tajuk 1

source: Heading 2
ms_my: Tajuk 2

source: Headings
ms_my: Tajuk

source: Height
ms_my: Ketinggian

source: Horizontal line
ms_my: Garisan mendatar

source: Horizontal space
ms_my: Ruang mendatar

source: HTML source code
ms_my: Kod sumber HTML

source: Ignore all
ms_my: Abaikan semua

source: Image description
ms_my: Penerangan imej

source: Increase indent
ms_my: aTingkatkan inden

source: Inline
ms_my: Sebaris

source: Insert column after
ms_my: Sisipkan lajur selepas

source: Insert column before
ms_my: Sisipkan lajur sebelum

source: Insert date/time
ms_my: Masukkan tarikh/masa

source: Insert image
ms_my: Sisipkan imej

source: Insert link
ms_my: Sisipkan pautan

source: Insert row after
ms_my: Sisipkan baris selepas

source: Insert row before
ms_my: Sisipkan baris sebelum

source: Insert table
ms_my: Sisipkan jadual

source: Insert template
ms_my: Sisipkan templat

source: Insert video
ms_my: Sisipkan video

source: Insert
ms_my: Sisipkan

source: Insert/edit image
ms_my: Sisipkan/edit imej

source: Insert/edit link
ms_my: Sisipkan/edit pautan

source: Insert/edit video
ms_my: Sisipkan/edit video

source: Justify
ms_my: Mewajarkan

source: Keywords
ms_my: Kata kunci

source: Left to right
ms_my: Kiri ke kanan

source: Left
ms_my: kiri

source: Lower Alpha
ms_my: Alfa Bawah

source: Lower Greek
ms_my: Bahasa Greek yang lebih rendah
