Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: The {course_mode} course mode has a minimum price of {min_price}. You must set a price greater than or equal to {min_price}.
ms_my: Mod kursus {course_mode} mempunyai harga minimum {min_price}. Anda mesti menetapkan harga yang lebih besar daripada atau sama dengan {min_price}.

source: Free
ms_my: Percuma

source: The time period before a course ends in which a course mode will expire
ms_my: Tempoh masa sebelum kursus tamat di mana mod kursus akan tamat tempoh

source: Enrollment is closed
ms_my: Pendaftaran telah ditutup

source: Enrollment mode not supported
ms_my: Mod pendaftaran tidak disokong

source: Invalid amount selected.
ms_my: Jumlah tidak sah dipilih.

source: No selected price or selected price is too low.
ms_my: Tiada harga terpilih atau harga terpilih terlalu rendah.

source: User profile
ms_my: Profil pengguna

source: Account recovery
ms_my: Pemulihan akaun

source: Password
ms_my: Kata laluan

source: Raw passwords are not stored, so there is no way to see this user's password.
ms_my: Kata laluan mentah tidak disimpan, jadi tiada cara untuk melihat kata laluan pengguna ini.

source: %(count)d student account was unlocked.
ms_my: %(count)d akaun pelajar telah dibuka kuncinya.

source: Please add a key/value 'THIRD_PARTY_AUTH_ONLY_DOMAIN/{site_email_domain}' in SiteConfiguration model's site_values field.
ms_my: Sila tambahkan kunci/nilai 'THIRD_PARTY_AUTH_ONLY_DOMAIN/{site_email_domain}' dalam medan site_values ​​model SiteConfiguration.

source: Email doesn't have {allowed_site_email_domain} domain name.
ms_my: E-mel tidak mempunyai nama domain {allowed_site_email_domain}.

source: User with this email doesn't exist in system.
ms_my: Pengguna dengan e-mel ini tidak wujud dalam sistem.

source: An account with the Email '{email}' already exists.
ms_my: Akaun dengan E-mel '{email}' sudah wujud.

source: An account with the Public Username '{username}' already exists.
ms_my: Akaun dengan Nama Pengguna Awam '{username}' sudah wujud.

source: Your account has been disabled. If you believe this was done in error, please contact us at {support_email}
ms_my: Akaun anda telah dilumpuhkan. Jika anda percaya ini telah dilakukan secara tersilap, sila hubungi kami di {support_email}

source: Disabled Account
ms_my: Akaun Dilumpuhkan

source: Namespace of enrollment attribute
ms_my: Ruang nama atribut pendaftaran

source: Name of the enrollment attribute
ms_my: Nama atribut pendaftaran

source: Value of the enrollment attribute
ms_my: Nilai atribut pendaftaran

source: The window of time after enrolling during which users can be granted a refund, represented in microseconds. The default is 14 days.
ms_my: Tempoh masa selepas mendaftar di mana pengguna boleh diberikan bayaran balik, diwakili dalam mikrosaat. Lalai ialah 14 hari.

source: It expect that the data will be provided in a csv file format with first row being the header and columns will be as follows: user_id, username, email, course_id, is_verified, verification_date
ms_my: Ia menjangkakan bahawa data akan disediakan dalam format fail csv dengan baris pertama sebagai pengepala dan lajur adalah seperti berikut: user_id, username, email, course_id, is_verified, verification_date

source: It expect that the data will be provided in a csv file format with first row being the header and columns will be as follows: course_id, username, mode
ms_my: Ia menjangkakan bahawa data akan disediakan dalam format fail csv dengan baris pertama sebagai pengepala dan lajur adalah seperti berikut: course_id, nama pengguna, mod

source: Male
ms_my: jantan

source: Female
ms_my: perempuan

source: Other/Prefer Not to Say
ms_my: Lain/Lebih Suka Tidak Berkata

source: Doctorate
ms_my: Kedoktoran

source: Master's or professional degree
ms_my: Ijazah sarjana atau profesional

source: Bachelor's degree
ms_my: ijazah sarjana muda

source: Associate degree
ms_my: Ijazah bersekutu

source: Secondary/high school
ms_my: Sekolah menengah/menengah

source: Junior secondary/junior high/middle school
ms_my: Menengah rendah/menengah/menengah

source: Elementary/primary school
ms_my: Sekolah rendah/rendah

source: No formal education
ms_my: Tiada pendidikan formal

source: Other education
ms_my: Pendidikan lain

source: {platform_name} Honor Code Certificate for {course_name}
ms_my: {platform_name} Sijil Kod Kehormatan untuk {course_name}

source: {platform_name} Verified Certificate for {course_name}
ms_my: {platform_name} Sijil Disahkan untuk {course_name}

source: {platform_name} Professional Certificate for {course_name}
ms_my: {platform_name} Sijil Profesional untuk {course_name}

source: Your organization ID (if your organization has an existing page on LinkedIn) e.g 1337. If not provided, will default to sending Platform Name (e.g. edX) instead.
ms_my: ID organisasi anda (jika organisasi anda mempunyai halaman sedia ada di LinkedIn) cth 1337. Jika tidak diberikan, akan secara lalai menghantar Nama Platform (cth. edX).

source: {platform_name} Certificate for {course_name}
ms_my: {platform_name} Sijil untuk {course_name}

source: The ISO 639-1 language code for this language.
ms_my: Kod bahasa ISO 639-1 untuk bahasa ini.

source: Name of the UTM cookie
ms_my: Nama kuki UTM

source: Name of the affiliate cookie
ms_my: Nama kuki ahli gabungan

source: Name of this user attribute.
ms_my: Nama atribut pengguna ini.

source: Value of this user attribute.
ms_my: Nilai atribut pengguna ini.

source: Secondary email address
ms_my: Alamat e-mel kedua

source: Secondary email address to recover linked account.
ms_my: Alamat e-mel kedua untuk memulihkan akaun terpaut.

source: An employee (a user whose email has current site's domain name) whose email exists in this model, can be able to login from login screen through email and password. And if any employee's email doesn't exist in this model then that employee can login via third party authentication backend only.
ms_my: Seorang pekerja (pengguna yang e-melnya mempunyai nama domain tapak semasa) yang e-melnya wujud dalam model ini, boleh log masuk dari skrin log masuk melalui e-mel dan kata laluan. Dan jika mana-mana e-mel pekerja tidak wujud dalam model ini maka pekerja itu boleh log masuk melalui bahagian belakang pengesahan pihak ketiga sahaja.

source: It expect that the data will be provided in a csv file format with first row being the header and columns will be as follows: username, current_email, desired_email
ms_my: Ia menjangkakan bahawa data akan disediakan dalam format fail csv dengan baris pertama sebagai pengepala dan lajur adalah seperti berikut: nama pengguna, current_email, desired_email

source: Add a reason
ms_my: Tambah sebab

source: and
ms_my: dan

source: Photos are mismatched
ms_my: Foto tidak sepadan

source: Name missing from ID photo
ms_my: Nama tiada dalam foto ID

source: ID photo not provided
ms_my: Gambar ID tidak disediakan

source: ID is invalid
ms_my: ID tidak sah

source: Learner photo is blurry
ms_my: Foto pelajar adalah kabur

source: Name on ID does not match name on account
ms_my: Nama pada ID tidak sepadan dengan nama pada akaun

source: Learner photo not provided
ms_my: Foto pelajar tidak disediakan

source: ID photo is blurry
ms_my: Foto ID adalah kabur

source: Check your {email_start}{email}{email_end} inbox for an account activation link from {platform_name}. If you need help, contact {link_start}{platform_name} Support{link_end}.
ms_my: Semak peti masuk {email_start}{email}{email_end} anda untuk mendapatkan pautan pengaktifan akaun daripada {platform_name}. Jika anda memerlukan bantuan, hubungi Sokongan {link_start}{platform_name}{link_end}.

source: Add a recovery email to retain access when single-sign on is not available. Go to {link_start}your Account Settings{link_end}.
ms_my: Tambahkan e-mel pemulihan untuk mengekalkan akses apabila log masuk tunggal tidak tersedia. Pergi ke {link_start}Tetapan Akaun anda{link_end}.

source: Recovery email is not activated yet. Kindly visit your email and follow the instructions to activate it.
ms_my: E-mel pemulihan belum diaktifkan lagi. Sila lawati e-mel anda dan ikuti arahan untuk mengaktifkannya.

source: The course you are looking for does not start until {date}.
ms_my: Kursus yang anda cari tidak bermula sehingga {tarikh}.

source: The course you are looking for is closed for enrollment as of {date}.
ms_my: Kursus yang anda cari telah ditutup untuk pendaftaran pada {date}.

source: Course id not specified
ms_my: Id kursus tidak dinyatakan

source: Invalid course id
ms_my: Id kursus tidak sah

source: Course id is invalid
ms_my: Id kursus tidak sah

source: Could not enroll
ms_my: Tidak dapat mendaftar

source: Unenrollment is currently disabled
ms_my: Penyahdaftaran dilumpuhkan pada masa ini

source: You are not enrolled in this course
ms_my: Anda tidak mendaftar dalam kursus ini

source: Your certificate prevents you from unenrolling from this course
ms_my: Sijil anda menghalang anda daripada membatalkan pendaftaran kursus ini

source: Enrollment action is invalid
ms_my: Tindakan pendaftaran tidak sah

source: Please enter a username
ms_my: Sila masukkan nama pengguna

source: Please choose an option
ms_my: Sila pilih satu pilihan

source: User with username {} does not exist
ms_my: Pengguna dengan nama pengguna {} tidak wujud

source: Successfully disabled {}'s account
ms_my: Berjaya melumpuhkan akaun {}.

source: Successfully reenabled {}'s account
ms_my: Berjaya mendayakan semula akaun {}.

source: Unexpected account status
ms_my: Status akaun yang tidak dijangka

source: {html_start}This {account_or_email} has already been {activated_or_confirmed}.{html_end}
ms_my: {html_start}{account_or_email} ini telah pun {diaktifkan_atau_disahkan}.{html_end}

source: {html_start}Success{html_end} You have {activated_or_confirmed} your {account_or_email}.
ms_my: {html_start}Kejayaan{html_end} Anda telah {activated_or_confirmed} {account_or_email} anda.

source: {html_start}Success! You have {activated_or_confirmed} your {account_or_email}.{html_end}You will now receive email updates and alerts from us related to the courses you are enrolled in. Sign In to continue.
ms_my: {html_start}Berjaya! Anda telah {activated_or_confirmed} {account_or_email}.{html_end}Anda kini akan menerima kemas kini e-mel dan makluman daripada kami berkaitan dengan kursus yang anda daftarkan. Log Masuk untuk meneruskan.

source: Valid e-mail address required.
ms_my: Alamat e-mel yang sah diperlukan.

source: Old email is the same as the new email.
ms_my: E-mel lama adalah sama dengan e-mel baharu.

source: Cannot be same as your sign in email address.
ms_my: Tidak boleh sama dengan alamat e-mel log masuk anda.

source: Unable to send email activation link. Please try again later.
ms_my: Tidak dapat menghantar pautan pengaktifan e-mel. Sila cuba lagi kemudian.

source: Deleted the selected configuration(s).
ms_my: Memadamkan konfigurasi yang dipilih.

source: Delete the selected configuration
ms_my: Padamkan konfigurasi yang dipilih

source: Unable to connect with the external provider, please try again
ms_my: Tidak dapat berhubung dengan pembekal luaran, sila cuba lagi

source: Authentication with {} is currently unavailable.
ms_my: Pengesahan dengan {} tidak tersedia pada masa ini.

source: Secondary providers are displayed less prominently, in a separate list of "Institution" login providers.
ms_my: Pembekal sekunder dipaparkan dengan kurang ketara, dalam senarai berasingan penyedia log masuk "Institusi".

source: optional. If this provider is an Organization, this attribute can be used reference users in that Organization
ms_my: pilihan. Jika pembekal ini ialah Organisasi, atribut ini boleh digunakan pengguna rujukan dalam Organisasi tersebut

source: The Site that this provider configuration belongs to.
ms_my: Tapak yang dimiliki oleh konfigurasi pembekal ini.

source: If this option is enabled, users that visit a "TPA hinted" URL for this provider (e.g. a URL ending with `?tpa_hint=[provider_name]`) will be forwarded directly to the login URL of the provider instead of being first prompted with a login dialog.
ms_my: Jika pilihan ini didayakan, pengguna yang melawati URL "dibayangkan TPA" untuk pembekal ini (cth. URL yang berakhir dengan `?tpa_hint=[provider_name]`) akan dimajukan terus ke URL log masuk pembekal dan bukannya digesa terlebih dahulu dengan dialog log masuk.

source: If this option is enabled, users will not be asked to confirm their details (name, email, etc.) during the registration process. Only select this option for trusted providers that are known to provide accurate user information.
ms_my: Jika pilihan ini didayakan, pengguna tidak akan diminta untuk mengesahkan butiran mereka (nama, e-mel, dll.) semasa proses pendaftaran. Hanya pilih pilihan ini untuk pembekal yang dipercayai yang diketahui memberikan maklumat pengguna yang tepat.

source: If this option is selected, users will not be required to confirm their email, and their account will be activated immediately upon registration.
ms_my: Jika pilihan ini dipilih, pengguna tidak perlu mengesahkan e-mel mereka, dan akaun mereka akan diaktifkan serta-merta selepas pendaftaran.

source: If this option is selected, users will be sent a welcome email upon registration.
ms_my: Jika pilihan ini dipilih, pengguna akan dihantar e-mel alu-aluan semasa pendaftaran.

source: If this option is not selected, users will not be presented with the provider as an option to authenticate with on the login screen, but manual authentication using the correct link is still possible.
ms_my: Jika pilihan ini tidak dipilih, pengguna tidak akan dibentangkan dengan pembekal sebagai pilihan untuk mengesahkan dengan pada skrin log masuk, tetapi pengesahan manual menggunakan pautan yang betul masih boleh dilakukan.

source: If this option is set, then users logging in using this SSO provider will have their session length limited to no longer than this value. If set to 0 (zero), the session will expire upon the user closing their browser. If left blank, the Django platform session default length will be used.
ms_my: Jika pilihan ini ditetapkan, maka pengguna yang log masuk menggunakan penyedia SSO ini akan mempunyai tempoh sesi mereka terhad kepada tidak lebih daripada nilai ini. Jika ditetapkan kepada 0 (sifar), sesi akan tamat tempoh apabila pengguna menutup pelayar mereka. Jika dibiarkan kosong, panjang lalai sesi platform Django akan digunakan.

source: If this option is selected, users will be directed to the registration page immediately after authenticating with the third party instead of the login page.
ms_my: Jika pilihan ini dipilih, pengguna akan diarahkan ke halaman pendaftaran serta-merta selepas mengesahkan dengan pihak ketiga dan bukannya halaman log masuk.

source: Synchronize user profile data received from the identity provider with the edX user account on each SSO login. The user will be notified if the email address associated with their account is changed as a part of this synchronization.
ms_my: Segerakkan data profil pengguna yang diterima daripada pembekal identiti dengan akaun pengguna edX pada setiap log masuk SSO. Pengguna akan dimaklumkan jika alamat e-mel yang dikaitkan dengan akaun mereka ditukar sebagai sebahagian daripada penyegerakan ini.

source: IDPs with this set to True will be excluded from the dropdown IDP selection in the EnterpriseCustomer Django Admin form.
ms_my: IDP dengan set ini kepada True akan dikecualikan daripada pilihan IDP lungsur turun dalam borang EnterpriseCustomer Django Admin.

source: The Site that this SAML configuration belongs to.
ms_my: Tapak milik konfigurasi SAML ini.

source: {platform_name} Support
ms_my: Sokongan {platform_name}.

source: A configuration nickname.
ms_my: Nama panggilan konfigurasi.

source: Please wait
ms_my: Sila tunggu

# am/pm indicator
source: AM
ms_my: pagi

# weekday name
source: Monday
ms_my: Isnin

# weekday name
source: Tuesday
ms_my: Selasa

# weekday name
source: Wednesday
ms_my: Rabu

# weekday name
source: Thursday
ms_my: Khamis

# weekday name
source: Friday
ms_my: Jumaat

# weekday name
source: Saturday
ms_my: Sabtu

# weekday name
source: Sunday
ms_my: Ahad

# abbreviated weekday name
source: Mon
ms_my: isn

# abbreviated weekday name
source: Tue
ms_my: Sel

# abbreviated weekday name
source: Wed
ms_my: Rabu

# abbreviated weekday name
source: Thu
ms_my: Kha

# abbreviated weekday name
source: Fri
ms_my: Jum

# abbreviated weekday name
source: Sat
ms_my: Sab

# abbreviated month name
source: Mar
ms_my: Mac

# abbreviated month name
source: May
ms_my: Mei

# abbreviated month name
source: Jul
ms_my: Julai

# abbreviated month name
source: Aug
ms_my: Ogos

# abbreviated month name
source: Oct
ms_my: Okt

# abbreviated month name
source: Dec
ms_my: Dis

# month name
source: January
ms_my: Januari

# month name
source: February
ms_my: Februari

# month name
source: March
ms_my: Mac

# month name
source: May
ms_my: Mei

# month name
source: June
ms_my: Jun

# month name
source: July
ms_my: Julai

# month name
source: August
ms_my: Ogos

# month name
source: October
ms_my: Oktober

# month name
source: December
ms_my: Disember

source: The file must end with the extension '{file_types}'.
ms_my: Fail mesti berakhir dengan salah satu sambungan berikut: '{file_types}'.

source: Maximum upload file size is {file_size} bytes.
ms_my: Saiz fail muat naik maksimum ialah {file_size} bait.

source: Course {course_id} requires {prerequisite_course_id}
ms_my: Kursus {course_id} memerlukan {prerequisite_course_id}

source: System defined milestone
ms_my: Pencapaian yang ditentukan sistem

source: Your password must contain {length_instruction}, including {complexity_instructions}.
ms_my: Kata laluan anda mesti mengandungi {length_instruction}, termasuk {complexity_instructions}.

source: Your password must contain {length_instruction}.
ms_my: Kata laluan anda mesti mengandungi {length_instruction}.

source: Invalid password.
ms_my: Kata laluan tidak sah.

source: at least %(min_length)d character
ms_my: sekurang-kurangnya %(min_length)d aksara

source: This password is too long. It must contain no more than %(max_length)d character.
ms_my: Kata laluan ini terlalu panjang. Ia mesti mengandungi tidak lebih daripada %(max_length)d aksara.

source: Your password must contain no more than %(max_length)d character.
ms_my: Kata laluan anda mesti mengandungi tidak lebih daripada %(max_length)d aksara.

source: This password must contain at least %(min_alphabetic)d letter.
ms_my: Kata laluan ini mesti mengandungi sekurang-kurangnya %(min_alphabetic)d huruf.

source: Your password must contain at least %(min_alphabetic)d letter.
ms_my: Kata laluan anda mesti mengandungi sekurang-kurangnya %(min_alphabetic)d huruf.

source: %(num)d letter
ms_my: %(num)d huruf

source: This password must contain at least %(min_numeric)d number.
ms_my: Kata laluan ini mesti mengandungi sekurang-kurangnya %(min_numeric)d nombor.

source: Your password must contain at least %(min_numeric)d number.
ms_my: Kata laluan anda mesti mengandungi sekurang-kurangnya %(min_numeric)d nombor.

source: %(num)d number
ms_my: %(num)d nombor

source: This password must contain at least %(min_upper)d uppercase letter.
ms_my: Kata laluan ini mesti mengandungi sekurang-kurangnya %(min_upper)d huruf besar.

source: Your password must contain at least %(min_upper)d uppercase letter.
ms_my: Kata laluan anda mesti mengandungi sekurang-kurangnya %(min_upper)d huruf besar.

source: %(num)d uppercase letter
ms_my: %(num)d huruf besar

source: This password must contain at least %(min_lower)d lowercase letter.
ms_my: Kata laluan ini mesti mengandungi sekurang-kurangnya %(min_lower)d huruf kecil.

source: Your password must contain at least %(min_lower)d lowercase letter.
ms_my: Kata laluan anda mesti mengandungi sekurang-kurangnya %(min_lower)d huruf kecil.

source: %(num)d lowercase letter
ms_my: %(num)d huruf kecil

source: This password must contain at least %(min_punctuation)d punctuation mark.
ms_my: Kata laluan ini mesti mengandungi sekurang-kurangnya %(min_punctuation)d tanda baca.

source: Your password must contain at least %(min_punctuation)d punctuation mark.
ms_my: Kata laluan anda mesti mengandungi sekurang-kurangnya %(min_punctuation)d tanda baca.

source: %(num)d punctuation mark
ms_my: %(num)d tanda baca

source: This password must contain at least %(min_symbol)d symbol.
ms_my: Kata laluan ini mesti mengandungi sekurang-kurangnya %(min_symbol)d simbol.

source: Your password must contain at least %(min_symbol)d symbol.
ms_my: Kata laluan anda mesti mengandungi sekurang-kurangnya %(min_symbol)d simbol.

source: %(num)d symbol
ms_my: %(num)d simbol

source: To disable the XBlock and prevent rendering in the LMS, leave "Enabled" deselected; for clarity, update XBlockStudioConfiguration support state accordingly.
ms_my: Untuk melumpuhkan XBlock dan menghalang pemaparan dalam LMS, biarkan "Didayakan" dinyahpilih; untuk kejelasan, kemas kini keadaan sokongan XBlockStudioConfiguration dengan sewajarnya.

source: Only XBlocks listed in a course's Advanced Module List can be flagged as deprecated. Remember to update XBlockStudioConfiguration support state accordingly, as deprecated does not impact whether or not new XBlock instances can be created in Studio.
ms_my: Hanya XBlock yang disenaraikan dalam Senarai Modul Lanjutan kursus boleh dibenderakan sebagai tidak digunakan lagi. Ingat untuk mengemas kini keadaan sokongan XBlockStudioConfiguration dengan sewajarnya, kerana ditamatkan tidak memberi kesan sama ada tika XBlock baharu boleh dibuat dalam Studio atau tidak.

source: XBlock/template combinations that are disabled cannot be edited in Studio, regardless of support level. Remember to also check if all instances of the XBlock are disabled in XBlockConfiguration.
ms_my: Kombinasi XBlock/templat yang dilumpuhkan tidak boleh diedit dalam Studio, tanpa mengira tahap sokongan. Ingat juga untuk menyemak sama ada semua kejadian XBlock dilumpuhkan dalam XBlockConfiguration.

source: Enabled XBlock/template combinations with full or provisional support can always be created in Studio. Unsupported XBlock/template combinations require course author opt-in.
ms_my: Gabungan XBlock/templat yang didayakan dengan sokongan penuh atau sementara sentiasa boleh dibuat dalam Studio. Kombinasi XBlock/templat yang tidak disokong memerlukan ikut serta pengarang kursus.

source: show deprecation messaging in Studio
ms_my: tunjukkan pemesejan penamatan dalam Studio

source: Fully Supported
ms_my: Disokong Penuh

source: Provisionally Supported
ms_my: Disokong Sementara

source: Unsupported
ms_my: Tidak disokong

source: Unlock Account
ms_my: Buka Kunci Akaun

source: Close
ms_my: tutup

source: This is a routed Account Activation email for %(routed_user)s (%(routed_user_email)s): %(routed_profile_name)s
ms_my: Ini ialah e-mel Pengaktifan Akaun dihalakan untuk %(routed_user)s (%(routed_user_email)s): %(routed_profile_name)s

source: Account activation
ms_my: Pengaktifan akaun

source: You're almost there! Use the link below to activate your account to access engaging, high-quality %(platform_name)s courses. Note that you will not be able to log back into your account until you have activated it.
ms_my: Anda hampir sampai! Gunakan pautan di bawah untuk mengaktifkan akaun anda untuk mengakses kursus %(platform_name)s yang menarik dan berkualiti tinggi. Ambil perhatian bahawa anda tidak akan dapat log masuk semula ke akaun anda sehingga anda telah mengaktifkannya.

source: Activate your account
ms_my: Aktifkan akaun anda

source: Enjoy learning with %(platform_name)s.
ms_my: Nikmati pembelajaran dengan %(platform_name)s.

source: Create Password
ms_my: Cipta Kata Laluan
