Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Certificate for student {user} is already invalid, kindly verify that certificate was generated for this student and then proceed.
ms_my: Sijil untuk pelajar {user} sudah tidak sah, sila sahkan bahawa sijil telah dijana untuk pelajar ini dan kemudian teruskan.

source: Certificate Invalidation does not exist, Please refresh the page and try again.
ms_my: Pembatalan Sijil tidak wujud, Sila muat semula halaman dan cuba lagi.

source: The student {student} does not have certificate for the course {course}. Kindly verify student username/email and the selected course are correct and try again.
ms_my: Pelajar {pelajar} tidak mempunyai sijil untuk kursus {course}. Sila sahkan nama pengguna/e-mel pelajar dan kursus yang dipilih adalah betul dan cuba lagi.

source: Instructor
ms_my: Pengajar

source: To gain insights into student enrollment and participation {link_start}visit {analytics_dashboard_name}, our new course analytics product{link_end}.
ms_my: Untuk mendapatkan cerapan tentang pendaftaran dan penyertaan pelajar {link_start}lawati {analytics_dashboard_name}, produk analitis kursus baharu kami{link_end}.

source: Special Exams
ms_my: Peperiksaan Khas

source: Certificates
ms_my: Sijil

source: Please Enter the numeric value for the course price
ms_my: Sila Masukkan nilai angka untuk harga kursus

source: CourseMode with the mode slug({mode_slug}) DoesNotExist
ms_my: CourseMode dengan mod slug({mode_slug}) DoesNotExist

source: CourseMode price updated successfully
ms_my: Harga CourseMode berjaya dikemas kini

source: Course Info
ms_my: Info Kursus

source: Enrollment data is now available in {dashboard_link}.
ms_my: Data pendaftaran kini tersedia dalam {dashboard_link}.

source: Membership
ms_my: Keahlian

source: Cohorts
ms_my: Kohort

source: Discussions
ms_my: Perbincangan

source: Student Admin
ms_my: Pentadbir Pelajar

source: Extensions
ms_my: Sambungan

source: Data Download
ms_my: Muat Turun Data

source: Analytics
ms_my: Analitis

source: Open Responses
ms_my: Buka Respons

source: 0 sent
ms_my: 0 dihantar

source: {num_emails} sent
ms_my: {num_email} dihantar

source: {num_emails} failed
ms_my: {num_emails} gagal

source: Complete
ms_my: lengkap

source: Incomplete
ms_my: tak lengkap

source: Role name
ms_my: Nama peranan

source: Invalid role name.
ms_my: Nama peranan tidak sah.

source: Could not find student matching identifier: {student_identifier}
ms_my: Tidak dapat mencari pengecam padanan pelajar: {student_identifier}

source: Unable to parse date:
ms_my: Tidak dapat menghuraikan tarikh:

source: Couldn't find module for url: {0}
ms_my: Tidak dapat mencari modul untuk url: {0}

source: Could not find student enrollment in the course.
ms_my: Tidak dapat mencari pendaftaran pelajar dalam kursus.

source: Unit {0} has no due date to extend.
ms_my: Unit {0} tidak mempunyai tarikh akhir untuk dilanjutkan.

source: An extended due date must be later than the original due date.
ms_my: Tarikh tamat tempoh lanjutan mestilah lewat daripada tarikh tamat tempoh asal.

source: Full Name
ms_my: Nama Penuh

source: Extended Due Date
ms_my: Tarikh Akhir Dilanjutkan

source: Users with due date extensions for {0}
ms_my: Pengguna dengan sambungan tarikh akhir untuk {0}

source: Due date extensions for {0} {1} ({2})
ms_my: Sambungan tarikh akhir untuk {0} {1} ({2})

source: Requested task is already running
ms_my: Tugasan yang diminta sudah berjalan

source: Error occured. Please try again later.
ms_my: Ralat berlaku. Sila cuba lagi kemudian.

source: detailed enrollment
ms_my: pendaftaran terperinci

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
ms_my: Laporan {report_type} sedang dibuat. Untuk melihat status laporan, lihat Tugas Tertunda di bawah. Anda akan dapat memuat turun laporan apabila ia selesai.

source: This component cannot be rescored.
ms_my: Komponen ini tidak boleh dibuat semula.

source: This component does not support score override.
ms_my: Komponen ini tidak menyokong penggantian skor.

source: Scores must be between 0 and the value of the problem.
ms_my: Markah mestilah antara 0 dan nilai masalah.

source: Not all problems in entrance exam support re-scoring.
ms_my: Tidak semua masalah dalam peperiksaan kemasukan menyokong pemarkahan semula.

source: An error has occurred. Task was not created.
ms_my: Ralat telah berlaku. Tugasan tidak dibuat.

source: rescored
ms_my: dicetak semula

source: overridden
ms_my: ditindih

source: reset
ms_my: set semula

source: deleted
ms_my: dipadamkan

source: emailed
ms_my: diemel

source: graded
ms_my: digredkan

source: problem distribution graded
ms_my: pengedaran masalah digredkan

source: certificates generated
ms_my: sijil yang dihasilkan

source: cohorted
ms_my: berkelompok

source: compressed
ms_my: dimampatkan

source: No status information available
ms_my: Tiada maklumat status tersedia

source: No task_output information found for instructor_task {0}
ms_my: Tiada maklumat task_output ditemui untuk instructor_task {0}

source: No parsable task_output information found for instructor_task {0}: {1}
ms_my: Tiada maklumat tugas_keluaran yang boleh dihuraikan ditemui untuk tugas_pengajar {0}: {1}

source: No parsable status information available
ms_my: Tiada maklumat status parsable tersedia

source: No message provided
ms_my: Tiada mesej diberikan

source: Invalid task_output information found for instructor_task {0}: {1}
ms_my: Maklumat task_output tidak sah ditemui untuk instructor_task {0}: {1}

source: No progress status information available
ms_my: Tiada maklumat status kemajuan tersedia

source: No parsable task_input information found for instructor_task {0}: {1}
ms_my: Tiada maklumat input_tugas boleh dihuraikan ditemui untuk tugas_pengajar {0}: {1}

source: Progress: {action} {succeeded} of {attempted} so far
ms_my: Kemajuan: {tindakan} {berjaya} daripada {percubaan} setakat ini

source: Unable to find submission to be {action} for student '{student}'
ms_my: Tidak dapat mencari penyerahan untuk menjadi {action} untuk pelajar '{student}'

source: Problem failed to be {action} for student '{student}'
ms_my: Masalah gagal menjadi {action} untuk pelajar '{student}'

source: Problem successfully {action} for student '{student}'
ms_my: Masalah berjaya {action} untuk pelajar '{student}'

source: Unable to find entrance exam submission to be {action} for student '{student}'
ms_my: Tidak dapat mencari penyerahan peperiksaan kemasukan sebagai {action} untuk pelajar '{student}'

source: Entrance exam successfully {action} for student '{student}'
ms_my: Peperiksaan kemasukan berjaya {action} untuk pelajar '{student}'

source: Unable to find any students with submissions to be {action}
ms_my: Tidak dapat mencari mana-mana pelajar dengan penyerahan untuk menjadi {action}

source: Problem failed to be {action} for any of {attempted} students
ms_my: Masalah gagal menjadi {action} untuk mana-mana pelajar {attempted}.

source: Problem successfully {action} for {attempted} students
ms_my: Masalah berjaya {action} untuk {attempted} pelajar

source: Problem {action} for {succeeded} of {attempted} students
ms_my: Masalah {action} untuk {berjaya} pelajar {percubaan}.

source: Unable to find any recipients to be {action}
ms_my: Tidak dapat mencari mana-mana penerima untuk menjadi {action}

source: Message failed to be {action} for any of {attempted} recipients
ms_my: Mesej gagal menjadi {action} untuk mana-mana penerima {attempted}.

source: Message successfully {action} for {attempted} recipients
ms_my: Mesej berjaya {action} untuk {cuba} penerima

source: Message {action} for {succeeded} of {attempted} recipients
ms_my: Mesej {action} untuk {berjaya} daripada {percubaan} penerima

source: (skipping {skipped})
ms_my: (langkau {langkau})

source: Programs
ms_my: Program

source: Program Details
ms_my: Butiran Program

source: This component's access settings refer to deleted or invalid group configurations.
ms_my: Tetapan akses komponen ini merujuk kepada konfigurasi kumpulan yang dipadam atau tidak sah.

source: This unit's access settings refer to deleted or invalid group configurations.
ms_my: Tetapan akses unit ini merujuk kepada konfigurasi kumpulan yang dipadamkan atau tidak sah.

source: This component's access settings refer to deleted or invalid groups.
ms_my: Tetapan akses komponen ini merujuk kepada kumpulan yang dipadam atau tidak sah.

source: This unit's access settings refer to deleted or invalid groups.
ms_my: Tetapan akses unit ini merujuk kepada kumpulan yang dipadamkan atau tidak sah.

source: This component's access settings contradict its parent's access settings.
ms_my: Tetapan akses komponen ini bercanggah dengan tetapan akses induknya.

source: Whether to display this block in the table of contents
ms_my: Sama ada mahu memaparkan blok ini dalam jadual kandungan

source: What format this block is in (used for deciding which grader to apply, and what to show in the TOC)
ms_my: Dalam format apa blok ini (digunakan untuk menentukan penggred yang hendak digunakan dan perkara yang perlu ditunjukkan dalam TOC)

source: Course Chrome
ms_my: Kursus Chrome

source: Default Tab
ms_my: Tab Lalai

source: Enter the tab that is selected in the XBlock. If not set, the Course tab is selected.
ms_my: Masukkan tab yang dipilih dalam XBlock. Jika tidak ditetapkan, tab Kursus dipilih.

source: LaTeX Source File Name
ms_my: Nama Fail Sumber LaTeX

source: Enter the source file name for LaTeX.
ms_my: Masukkan nama fail sumber untuk LaTeX.

source: If true, can be seen only by course staff, regardless of start date.
ms_my: Jika benar, hanya boleh dilihat oleh kakitangan kursus, tanpa mengira tarikh mula.

source: A dictionary that maps which groups can be shown this block. The keys are group configuration ids and the values are a list of group IDs. If there is no key for a group configuration or if the set of group IDs is empty then the block is considered visible to all. Note that this field is ignored if the block is visible_to_staff_only.
ms_my: Kamus yang memetakan kumpulan yang boleh ditunjukkan blok ini. Kuncinya ialah id konfigurasi kumpulan dan nilainya ialah senarai ID kumpulan. Jika tiada kunci untuk konfigurasi kumpulan atau jika set ID kumpulan kosong maka blok itu dianggap boleh dilihat oleh semua. Ambil perhatian bahawa medan ini diabaikan jika blok itu boleh dilihat_kepada_staf_sahaja.

source: The list of group configurations for partitioning students in content experiments.
ms_my: Senarai konfigurasi kumpulan untuk membahagikan pelajar dalam eksperimen kandungan.

source: When checked, the LTI content will load only for learners who have an account in this instance. This is required only for linking learner accounts with the LTI consumer. See the Open edX LTI Provider documentation for more details.
ms_my: Apabila disemak, kandungan LTI akan dimuatkan hanya untuk pelajar yang mempunyai akaun dalam keadaan ini. Ini diperlukan hanya untuk memautkan akaun pelajar dengan pengguna LTI. Lihat dokumentasi Open edX LTI Provider untuk butiran lanjut.

source: One of user or external_user_key must not be null.
ms_my: Salah satu pengguna atau external_user_key mestilah tidak batal.

source: View and regenerate certificates.
ms_my: Lihat dan jana semula sijil.

source: Enrollment
ms_my: Pendaftaran

source: View and update learner enrollments.
ms_my: Lihat dan kemas kini pendaftaran pelajar.

source: Manage User
ms_my: Urus Pengguna

source: Disable User Account
ms_my: Lumpuhkan Akaun Pengguna

source: Entitlements
ms_my: Kelayakan

source: View, create, and reissue learner entitlements
ms_my: Lihat, buat dan keluarkan semula kelayakan pelajar

source: Feature Based Enrollments
ms_my: Pendaftaran Berdasarkan Ciri

source: View feature based enrollment settings
ms_my: Lihat tetapan pendaftaran berasaskan ciri

source: Link Program Enrollments
ms_my: Pautkan Pendaftaran Program

source: Link LMS users to program enrollments
ms_my: Pautkan pengguna LMS ke pendaftaran program

source: Program Enrollments Inspector Tool
ms_my: Alat Pemeriksa Pendaftaran Program

source: Find information related to a learner's program enrollments
ms_my: Cari maklumat yang berkaitan dengan pendaftaran program pelajar

source: username
ms_my: nama pengguna

source: user_support_url
ms_my: url_support_pengguna

source: user_detail_url
ms_my: url_perincian_pengguna

source: Usable
ms_my: Boleh guna

source: Unusable
ms_my: Tidak boleh digunakan

source: User Enabled Successfully
ms_my: Pengguna Berjaya Didayakan

source: User Disabled Successfully
ms_my: Pengguna Berjaya Dilumpuhkan

source: You must complete a survey
ms_my: Anda mesti melengkapkan tinjauan

source: Optional language the team uses as ISO 639-1 code.
ms_my: Bahasa pilihan yang digunakan oleh pasukan sebagai kod ISO 639-1.

source: Teams
ms_my: Pasukan

source: Leverage teams to allow learners to connect by topic of interest.
ms_my: Manfaatkan pasukan untuk membolehkan pelajar berhubung mengikut topik yang diminati.

source: course_id must be provided
ms_my: course_id mesti disediakan

source: The supplied course id {course_id} is not valid.
ms_my: Id kursus yang dibekalkan {course_id} tidak sah.

source: text_search and order_by cannot be provided together
ms_my: text_search dan order_by tidak boleh disediakan bersama-sama

source: The supplied topic id {topic_id} is not valid
ms_my: Id topik yang dibekalkan {topic_id} tidak sah

source: Error connecting to elasticsearch
ms_my: Ralat menyambung ke elasticsearch

source: The ordering {ordering} is not supported
ms_my: Pesanan {ordering} tidak disokong

source: The supplied course_id {course_id} is not valid.
ms_my: Course_id {course_id} yang dibekalkan tidak sah.

source: topic_id is required
ms_my: topic_id diperlukan

source: You can't create a team in an instructor managed topic.
ms_my: Anda tidak boleh membuat pasukan dalam topik yang diuruskan oleh pengajar.

source: You are already in a team in this teamset.
ms_my: Anda sudah pun berada dalam satu pasukan dalam set pasukan ini.

source: teamset_id and team_id are mutually exclusive options.
ms_my: teamset_id dan team_id adalah pilihan yang saling eksklusif.

source: teamset_id requires course_id to also be provided.
ms_my: teamset_id memerlukan course_id turut disediakan.

source: No teamset found in given course with given id
ms_my: Tiada set pasukan ditemui dalam kursus tertentu dengan id yang diberikan

source: username or (team_id or teamset_id) must be specified.
ms_my: nama pengguna atau (id_pasukan atau id_pasukan) mesti dinyatakan.

source: Username is required.
ms_my: Nama pengguna diperlukan.

source: Team id is required.
ms_my: ID pasukan diperlukan.

source: This team is already full.
ms_my: Pasukan ini sudah penuh.

source: You can't join an instructor managed team.
ms_my: Anda tidak boleh menyertai pasukan terurus pengajar.

source: The user {username} is already a member of a team in this teamset.
ms_my: Pengguna {username} sudah pun menjadi ahli pasukan dalam set pasukan ini.

source: The user {username} is not enrolled in the course associated with this team.
ms_my: Pengguna {username} tidak didaftarkan dalam kursus yang dikaitkan dengan pasukan ini.

source: You can't leave an instructor managed team.
ms_my: Anda tidak boleh meninggalkan pasukan terurus pengajar.

source: Show existing user tour
ms_my: Tunjukkan lawatan pengguna sedia ada

source: Show new user tour
ms_my: Tunjukkan lawatan pengguna baharu

source: Do not show user tour
ms_my: Jangan tunjukkan lawatan pengguna

source: Your {platform_name} ID verification was approved!
ms_my: Pengesahan ID {platform_name} anda telah diluluskan!

source: The course for which this deadline applies
ms_my: Kursus yang tarikh akhir ini digunakan

source: The datetime after which users are no longer allowed to submit photos for verification.
ms_my: Tarikh masa selepas itu pengguna tidak lagi dibenarkan menyerahkan foto untuk pengesahan.

source: Your {platform_name} verification has expired.
ms_my: Pengesahan {platform_name} anda telah tamat tempoh.

source: Intro
ms_my: Pengenalan

source: Make payment
ms_my: Buat pembayaran

source: Take photo
ms_my: Ambil gambar

source: Take a photo of your ID
ms_my: Ambil gambar ID anda

source: Review your info
ms_my: Semak maklumat anda

source: Enrollment confirmation
ms_my: Pengesahan pendaftaran

source: Selected price is not valid number.
ms_my: Harga yang dipilih bukan nombor yang sah.

source: This course doesn't support paid certificates
ms_my: Kursus ini tidak menyokong sijil berbayar

source: No selected price or selected price is below minimum.
ms_my: Tiada harga terpilih atau harga terpilih di bawah minimum.

source: Photo ID image is required if the user does not have an initial verification attempt.
ms_my: Imej ID foto diperlukan jika pengguna tidak mempunyai percubaan pengesahan awal.

source: Missing required parameter face_image
ms_my: Tiada parameter yang diperlukan face_image

source: Image data is in an unsupported format.
ms_my: Data imej dalam format yang tidak disokong.

source: Image data is not valid.
ms_my: Data imej tidak sah.

source: Your {platform_name} Verification Has Been Denied
ms_my: Pengesahan {platform_name} anda Telah Ditolak

source: Please correct the errors below.
ms_my: Sila betulkan kesilapan di bawah.

source: Are you sure you want to cancel retirement for user "%(username)s"?
ms_my: Adakah anda pasti mahu membatalkan persaraan untuk pengguna "%(username)s"?

source: Submit
ms_my: Hantar

source: here
ms_my: di sini

source: unsubscribe
ms_my: berhenti melanggan

source: This email was automatically sent from %(platform_name)s.
ms_my: E-mel ini dihantar secara automatik daripada %(platform_name)s.

source: You are receiving this email at address %(email)s because you are enrolled in %(course_title)s.
ms_my: Anda menerima e-mel ini di alamat %(email)s kerana anda telah mendaftar dalam %(course_title)s.

source: To stop receiving email like this, update your course email settings here %(email_settings_url)s
ms_my: Untuk berhenti menerima e-mel seperti ini, kemas kini tetapan e-mel kursus anda di sini %(email_settings_url)s

source: To unsubscribe click here %(unsubscribe_link)s
ms_my: Untuk berhenti melanggan klik di sini %(unsubscribe_link)s

source: Welcome to %(course_name)s
ms_my: Selamat datang ke %(course_name)s

source: To get started, please visit https://%(site_name)s.
ms_my: Untuk bermula, sila lawati https://%(site_name)s

source: The login information for your account follows:
ms_my: Maklumat log masuk untuk akaun anda berikut:

source: email: %(email_address)s
ms_my: e-mel: %(email_address)s

source: password: %(password)s
ms_my: kata laluan: %(password)s

source: It is recommended that you change your password.
ms_my: Anda disyorkan untuk menukar kata laluan anda.

source: You may access your course.
ms_my: Anda boleh mengakses kursus anda.

source: Sincerely yours, The %(course_name)s Team
ms_my: Yang ikhlas, Pasukan %(course_name)s

source: To get started, please visit https://%(site_name)s. The login information for your account follows.
ms_my: Untuk bermula, sila lawati https://%(site_name)s. Maklumat log masuk untuk akaun anda berikut.

source: You may access your course at: %(course_url)s.
ms_my: Anda boleh mengakses kursus anda di: %(course_url)s.

source: You have been enrolled in %(course_name)s
ms_my: Anda telah didaftarkan dalam %(course_name)s

source: The invitation has been sent by a member of the course staff.
ms_my: Jemputan telah dihantar oleh seorang kakitangan kursus.

source: To start accessing course materials, please visit:
ms_my: Untuk mula mengakses bahan kursus, sila layari:

source: To enroll in this course and begin the beta test:
ms_my: Untuk mendaftar dalam kursus ini dan memulakan ujian beta:

source: Visit %(course_name)s
ms_my: Lawati %(course_name)s

source: This email was automatically sent from %(site_name)s to %(email_address)s
ms_my: E-mel ini dihantar secara automatik daripada%(site_name)ske%(email_address)s

source: Dear %(full_name)s
ms_my: %(full_name)s yang dihormati

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
ms_my: Anda telah dijemput untuk menjadi penguji beta untuk %(course_name)s di %(site_name)s oleh ahli kakitangan kursus.

source: To start accessing course materials, please visit %(course_url)s
ms_my: Untuk mula mengakses bahan kursus, sila lawati %(course_url)s

source: Visit %(course_about_url)s to enroll in this course and begin the beta test.
ms_my: Lawati %(course_about_url)s untuk mendaftar dalam kursus ini dan mulakan ujian beta.

source: Visit %(site_name)s to enroll in this course and begin the beta test.
ms_my: Lawati %(site_name)s untuk mendaftar dalam kursus ini dan mulakan ujian beta.

source: You have been invited to a beta test for %(course_name)s
ms_my: Anda telah dijemput ke ujian beta untuk %(course_name)s

source: Dear %(full_name)s,
ms_my: %(full_name)s yang dihormati,

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s.
ms_my: Anda telah dijemput untuk menjadi penguji beta untuk %(course_name)s di %(site_name)s.

source: You have been invited to a beta test for %(course_name)s at %(site_name)s.
ms_my: Anda telah dijemput ke ujian beta untuk %(course_name)s di %(site_name)s.

source: You have been invited to %(course_name)s
ms_my: Anda telah dijemput ke %(course_name)s

source: You have been invited to join %(course_name)s at %(site_name)s by a member of the course staff.
ms_my: Anda telah dijemput untuk menyertai %(course_name)s di %(site_name)s oleh ahli kakitangan kursus.

source: To access this course click on the button below and login:
ms_my: Untuk mengakses kursus ini klik pada butang di bawah dan log masuk:

source: To access this course visit it and register:
ms_my: Untuk mengakses kursus ini lawati dan daftar:

source: Please finish your registration and fill out the registration form making sure to use %(email_address)s in the Email field:
ms_my: Sila selesaikan pendaftaran anda dan isi borang pendaftaran dengan memastikan anda menggunakan %(email_address)s dalam medan E-mel:

source: Finish Your Registration
ms_my: Selesaikan Pendaftaran Anda

source: Once you have registered and activated your account, you will see %(course_name)s listed on your dashboard.
ms_my: Sebaik sahaja anda telah mendaftar dan mengaktifkan akaun anda, anda akan melihat %(course_name)s disenaraikan pada papan pemuka anda.

source: Once you have registered and activated your account, you will be able to access this course:
ms_my: Sebaik sahaja anda telah mendaftar dan mengaktifkan akaun anda, anda akan dapat mengakses kursus ini:

source: You can then enroll in %(course_name)s.
ms_my: Anda kemudiannya boleh mendaftar dalam %(course_name)s.

source: Dear student,
ms_my: pelajar yang dihormati,

source: To access this course visit %(course_url)s and login.
ms_my: Untuk mengakses kursus ini lawati %(course_url)s dan log masuk.

source: To access this course visit %(course_about_url)s and register for this course.
ms_my: Untuk mengakses kursus ini lawati %(course_about_url)s dan daftar untuk kursus ini.

source: To finish your registration, please visit %(registration_url)s and fill out the registration form making sure to use %(email_address)s in the Email field.
ms_my: Untuk menyelesaikan pendaftaran anda, sila lawati %(registration_url)s dan isi borang pendaftaran dengan memastikan anda menggunakan %(email_address)s dalam medan E-mel.

source: Once you have registered and activated your account, visit %(course_about_url)s to join this course.
ms_my: Setelah anda mendaftar dan mengaktifkan akaun anda, lawati %(course_about_url)s untuk menyertai kursus ini.
