Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ms_my

source: Learners are added to this cohort automatically.
ms_my: Pelajar ditambahkan pada kohort ini secara automatik.

source: Select a cohort
ms_my: Pilih kohort

source: Enable Cohorts
ms_my: Dayakan Kohort

source: Select a cohort to manage
ms_my: Pilih kohort untuk diurus

source: View Cohort
ms_my: Lihat Kohort

source: Assign learners to cohorts by uploading a CSV file
ms_my: Tetapkan pelajar kepada kohort dengan memuat naik fail CSV

source: To review learner cohort assignments or see the results of uploading a CSV file, download course profile information or cohort results on the {link_start}Data Download{link_end} page.
ms_my: Untuk menyemak tugasan kohort pelajar atau melihat hasil muat naik fail CSV, muat turun maklumat profil kursus atau hasil kohort pada halaman {link_start}Muat Turun Data{link_end}.

source: Specify whether discussion topics are divided
ms_my: Nyatakan sama ada topik perbincangan dibahagikan

source: Course-Wide Discussion Topics
ms_my: Topik Perbincangan Seluruh Kursus

source: Select the course-wide discussion topics that you want to divide.
ms_my: Pilih topik perbincangan seluruh kursus yang ingin anda bahagikan.

source: Content-Specific Discussion Topics
ms_my: Topik Perbincangan Khusus Kandungan

source: Specify whether content-specific discussion topics are divided.
ms_my: Tentukan sama ada topik perbincangan khusus kandungan dibahagikan.

source: Always divide content-specific discussion topics
ms_my: Sentiasa bahagikan topik perbincangan khusus kandungan

source: Divide the selected content-specific discussion topics
ms_my: Bahagikan topik perbincangan khusus kandungan yang dipilih

source: No content-specific discussion topics exist.
ms_my: Tiada topik perbincangan khusus kandungan wujud.

source: Used
ms_my: terpakai

source: Valid
ms_my: sah

source: Certificate Status:
ms_my: Status Sijil:

source: Certificate Purchased
ms_my: Sijil Dibeli

source: Change or Leave Session
ms_my: Sesi Tukar atau Cuti

source: You must select a session by {expiration_date} to access the course.
ms_my: Anda mesti memilih sesi sebelum {expired_date} untuk mengakses kursus.

source: You can no longer change sessions.
ms_my: Anda tidak boleh menukar sesi lagi.

source: You can change sessions until {expiration_date}.
ms_my: Anda boleh menukar sesi sehingga {expired_date}.

source: View Archived Course
ms_my: Lihat Kursus Arkib

source: View Course
ms_my: Lihat Kursus

source: Select a session:
ms_my: Pilih sesi:

source: Enroll Now
ms_my: Daftar Sekarang

source: Coming Soon
ms_my: Akan Datang

source: Enrollment Opens on
ms_my: Pendaftaran Dibuka pada

source: Not Currently Available
ms_my: Tidak Tersedia Pada Masa Ini

source: More sessions coming soon.
ms_my: Lebih banyak sesi akan datang tidak lama lagi.

source: Change to a different session or leave the current session.
ms_my: Tukar kepada sesi lain atau tinggalkan sesi semasa.

source: To access the course, select a session.
ms_my: Untuk mengakses kursus, pilih sesi.

source: Session Selection Dropdown for {courseName}
ms_my: Jatuh Turun Pilihan Sesi untuk {courseName}

source: {sessionDates} - Currently Selected
ms_my: {sessionDates} - Dipilih Pada Masa ini

source: {sessionDates} (Open until {enrollmentEnd})
ms_my: {sessionDates} (Buka sehingga {enrollmentEnd})

source: More sessions coming soon
ms_my: Lebih banyak sesi akan datang tidak lama lagi

source: Leave the current session and decide later
ms_my: Tinggalkan sesi semasa dan buat keputusan kemudian

source: You are not enrolled in any programs yet.
ms_my: Anda belum mendaftar dalam mana-mana program lagi.

source: Explore Programs
ms_my: Terokai Program

source: Browse recently launched courses and see what\'s new in your favorite subjects
ms_my: Semak imbas kursus yang dilancarkan baru-baru ini dan lihat perkara baharu dalam mata pelajaran kegemaran anda

source: Explore new programs
ms_my: Terokai program baharu

source: Course
ms_my: Kursus

source: Completed
ms_my: Selesai

source: Remaining
ms_my: Yang tinggal

source: %(programName)s Home Page.
ms_my: %(programName)s Halaman Utama.

source: Your {program} Certificate
ms_my: Sijil {program} anda

source: Open the certificate you earned for the %(title)s program.
ms_my: Buka sijil yang anda perolehi untuk program %(title)s.

source: Program Record
ms_my: Rekod Program

source: Once you complete one of the program requirements you have a program record. This record is marked complete once you meet all program requirements. A program record can be used to continue your learning journey and demonstrate your learning to others.
ms_my: Sebaik sahaja anda melengkapkan salah satu keperluan program, anda mempunyai rekod program. Rekod ini ditanda lengkap setelah anda memenuhi semua keperluan program. Rekod program boleh digunakan untuk meneruskan perjalanan pembelajaran anda dan menunjukkan pembelajaran anda kepada orang lain.

source: View Program Record
ms_my: Lihat Rekod Program

source: Additional Credit Opportunities
ms_my: Peluang Kredit Tambahan

source: Learn More
ms_my: Ketahui Lebih Lanjut

source: Additional Professional Opportunities
ms_my: Peluang Profesional Tambahan

source: Congratulations!
ms_my: tahniah!

source: You have successfully completed all the requirements for the %(title)s %(type)s.
ms_my: Anda telah berjaya melengkapkan semua keperluan untuk %(title)s %(type)s.

source: Your Program Journey
ms_my: Perjalanan Program Anda

source: Track and plan your progress through the %(count)s course(s) in this program. To complete the program, you must earn a verified certificate for each course.
ms_my: Jejaki dan rancang kemajuan anda melalui %(count)s kursus dalam program ini. Untuk melengkapkan program, anda mesti memperoleh sijil yang disahkan untuk setiap kursus.

source: Upgrade All Remaining Courses (
ms_my: Naik taraf Semua Kursus Selebihnya (

source: COURSES IN PROGRESS
ms_my: KURSUS SEDANG BERLANGSUNG

source: REMAINING COURSES
ms_my: TINGGAL KURSUS

source: COMPLETED COURSES
ms_my: TAMAT KURSUS

source: As you complete courses, you will see them listed here.
ms_my: Semasa anda melengkapkan kursus, anda akan melihatnya disenaraikan di sini.

source: Complete courses on your schedule to ensure you stand out in your field!
ms_my: Lengkapkan kursus mengikut jadual anda untuk memastikan anda menonjol dalam bidang anda!

source: Transform your %(org)s %(type)s into a full master’s degree
ms_my: Ubah %(org)s %(type)s anda kepada ijazah sarjana penuh

source: Successful completion of %(org)s %(program)s credential can be applied towards flexible, rigorous, and affordable masters degrees from the world’s leading universities.
ms_my: Penyiapan kelayakan %(org)s %(program)s dengan jayanya boleh digunakan ke arah ijazah sarjana yang fleksibel, ketat dan mampu milik daripada universiti terkemuka dunia.

source: Track and plan your progress through the %(count)s courses in this program. To complete the program, you must earn a verified certificate for each course.
ms_my: Jejaki dan rancang kemajuan anda melalui %(count)s kursus dalam program ini. Untuk melengkapkan program, anda mesti memperoleh sijil yang disahkan untuk setiap kursus.

source: {organization}\'s logo
ms_my: Logo {organization} \'s.

source: Needs verified certificate
ms_my: Memerlukan sijil yang disahkan

source: Upgrade to Verified
ms_my: Naik taraf kepada Disahkan

source: New Address
ms_my: Alamat Baru

source: Change My Email Address
ms_my: Tukar Alamat E-mel Saya

source: Reset Password
ms_my: Tetapkan Semula Kata Laluan

source: Switch Language Back
ms_my: Tukar Bahasa Kembali

source: An error occurred. Please reload the page.
ms_my: Ralat berlaku. Sila muat semula halaman.

source: Need help signing in?
ms_my: Perlukan bantuan untuk log masuk?

source: Forgot my password
ms_my: Terlupa kata laluan saya

source: Other sign-in issues
ms_my: Isu log masuk lain

source: Sign in with your company or school
ms_my: Log masuk dengan syarikat atau sekolah anda

source: Need other help signing in?
ms_my: Perlukan bantuan lain untuk log masuk?

source: Create an account
ms_my: Buat akaun

source: Sign in
ms_my: Log masuk

source: Would you like to sign in using your %(providerName)s credentials?
ms_my: Adakah anda ingin melog masuk menggunakan bukti kelayakan %(providerName)s anda?

source: Sign in using %(providerName)s
ms_my: Log masuk menggunakan %(providerName)s

source: Show me other ways to sign in or register
ms_my: Tunjukkan saya cara lain untuk log masuk atau mendaftar

source: Sign in with Institution/Campus Credentials
ms_my: Log masuk dengan Tauliah Institusi/Kampus

source: Choose your institution from the list below:
ms_my: Pilih institusi anda daripada senarai di bawah:

source: Back to sign in
ms_my: Kembali untuk log masuk

source: Register with Institution/Campus Credentials
ms_my: Daftar dengan Tauliah Institusi/Kampus

source: Create an Account
ms_my: Buat Akaun

source: First time here?
ms_my: Pertama kali ke sini?

source: Create an Account.
ms_my: Buat Akaun.

source: Sign in to continue learning as {email}
ms_my: Log masuk untuk meneruskan pembelajaran sebagai {email}

source: Sign in to continue learning
ms_my: Log masuk untuk meneruskan pembelajaran

source: You already have an edX account with your {enterprise_name} email address.
ms_my: Anda sudah mempunyai akaun edX dengan alamat e-mel {enterprise_name} anda.

source: Going forward, your account information will be updated and maintained by {enterprise_name}.
ms_my: Pada masa hadapan, maklumat akaun anda akan dikemas kini dan diselenggara oleh {enterprise_name}.

source: You can view your information or unlink from {enterprise_name} anytime in your Account Settings.
ms_my: Anda boleh melihat maklumat anda atau menyahpaut daripada {enterprise_name} pada bila-bila masa dalam Tetapan Akaun anda.

source: To continue learning with this account, sign in below.
ms_my: Untuk meneruskan pembelajaran dengan akaun ini, log masuk di bawah.

source: Sign In
ms_my: Log Masuk

source: Sign in here using your email address and password, or use one of the providers listed below.
ms_my: Log masuk di sini menggunakan alamat e-mel dan kata laluan anda, atau gunakan salah satu daripada pembekal yang disenaraikan di bawah.

source: Sign in here using your email address and password.
ms_my: Log masuk di sini menggunakan alamat e-mel dan kata laluan anda.

source: If you do not yet have an account, use the button below to register.
ms_my: Jika anda belum mempunyai akaun, gunakan butang di bawah untuk mendaftar.

source: Use my university info
ms_my: Gunakan maklumat universiti saya

source: or sign in with
ms_my: atau log masuk dengan

source: Sign in with %(providerName)s
ms_my: Log masuk dengan %(providerName)s

source: Password assistance
ms_my: Bantuan kata laluan

source: Please enter your log-in or recovery email address below and we will send you an email with instructions.
ms_my: Sila masukkan alamat e-mel log masuk atau pemulihan anda di bawah dan kami akan menghantar e-mel kepada anda dengan arahan.

source: Recover my password
ms_my: Pulihkan kata laluan saya

source: Already have an {platformName} account?
ms_my: Sudah mempunyai akaun {platformName}?

source: Sign in.
ms_my: Log masuk.

source: Create an account using
ms_my: Buat akaun menggunakan

source: Create account using %(providerName)s.
ms_my: Buat akaun menggunakan %(providerName)s.

source: Use my institution/campus credentials
ms_my: Gunakan kelayakan institusi/kampus saya

source: or create a new one here
ms_my: atau buat yang baharu di sini

source: Congratulations! You are now verified on %(platformName)s!
ms_my: tahniah! Anda kini disahkan pada %(platformName)s!

source: You are now enrolled as a verified student for:
ms_my: Anda kini mendaftar sebagai pelajar yang disahkan untuk:

source: A list of courses you have just enrolled in as a verified student
ms_my: Senarai kursus yang baru anda daftarkan sebagai pelajar yang disahkan

source: Explore your course!
ms_my: Terokai kursus anda!

source: Go to your Dashboard
ms_my: Pergi ke Papan Pemuka anda

source: Verified Status
ms_my: Status Disahkan

source: Thank you for submitting your photos. We will review them shortly. You can now sign up for any %(platformName)s course that offers verified certificates. Verification is good for one year. After one year, you must submit photos for verification again.
ms_my: Terima kasih kerana menyerahkan foto anda. Kami akan menyemaknya sebentar lagi. Anda kini boleh mendaftar untuk mana-mana kursus %(platformName)s yang menawarkan sijil yang disahkan. Pengesahan adalah baik untuk satu tahun. Selepas satu tahun, anda mesti menyerahkan foto untuk pengesahan sekali lagi.

source: Error:
ms_my: Ralat:

source: What You Need for Verification
ms_my: Perkara yang Anda Perlukan untuk Pengesahan

source: Device with Camera
ms_my: Peranti dengan Kamera

source: You need a device that has a webcam. If you receive a browser prompt for access to your camera, please make sure to click 'Allow'.
ms_my: Anda memerlukan peranti yang mempunyai kamera web. Jika anda menerima gesaan penyemak imbas untuk mengakses kamera anda, sila pastikan anda mengklik 'Benarkan'.

source: Photo Identification
ms_my: Pengenalan Foto

source: You need a valid ID that contains your full name and photo.
ms_my: Anda memerlukan ID yang sah yang mengandungi nama penuh dan foto anda.

source: Take Your Photo
ms_my: Ambil Foto Anda

source: When your face is in position, use the Take Photo button {icon} below to take your photo.
ms_my: Apabila wajah anda berada dalam kedudukan, gunakan butang Ambil Foto {icon} di bawah untuk mengambil foto anda.

source: To take a successful photo, make sure that:
ms_my: Untuk mengambil gambar yang berjaya, pastikan bahawa:

source: Your face is well-lit.
ms_my: Muka awak terang benderang.

source: Your entire face fits inside the frame.
ms_my: Keseluruhan muka anda muat di dalam bingkai.

source: To take the photo of your face, click on the camera button {icon}. If you need to try again, click 'Retake Photo'.
ms_my: Untuk mengambil foto wajah anda, klik pada butang kamera {icon}. Jika anda perlu mencuba lagi, klik 'Ambil Semula Foto'.

source: Frequently Asked Questions
ms_my: Soalan Lazim

source: Why does %(platformName)s need my photo?
ms_my: Mengapakah %(platformName)s memerlukan foto saya?

source: We use your verification photos to confirm your identity and ensure the validity of your certificate.
ms_my: Kami menggunakan foto pengesahan anda untuk mengesahkan identiti anda dan memastikan kesahihan sijil anda.

source: What does %(platformName)s do with this photo?
ms_my: Apakah yang %(platformName)s lakukan dengan foto ini?

source: We securely encrypt your photo and send it to our authorization service for review. Your photo and information are not saved or visible anywhere on %(platformName)s after the verification process is complete.
ms_my: Kami menyulitkan foto anda dengan selamat dan menghantarnya ke perkhidmatan kebenaran kami untuk semakan. Foto dan maklumat anda tidak disimpan atau kelihatan di mana-mana pada %(platformName)s selepas proses pengesahan selesai.

source: What if I can't see the camera image, or if I can't see my photo do determine which side is visible?
ms_my: Bagaimana jika saya tidak dapat melihat imej kamera, atau jika saya tidak dapat melihat foto saya, tentukan bahagian mana yang boleh dilihat?

source: You may be able to complete the image capture procedure without assistance, but it may take a couple of submission attempts to get the camera positioning right. Optimal camera positioning varies with each computer, but generally the best position for a headshot is approximately 12-18 inches (30-45 centimeters) from the camera, with your head centered relative to the computer screen.
ms_my: Anda mungkin boleh melengkapkan prosedur penangkapan imej tanpa bantuan, tetapi mungkin memerlukan beberapa percubaan penyerahan untuk mendapatkan kedudukan kamera yang betul. Kedudukan kamera optimum berbeza-beza mengikut setiap komputer, tetapi secara amnya kedudukan terbaik untuk tangkapan kepala ialah kira-kira 12-18 inci (30-45 sentimeter) dari kamera, dengan kepala anda dipusatkan berbanding skrin komputer.

source: If the photos you submit are rejected, try moving the computer or camera orientation to change the lighting angle. The most common reason for rejection is inability to read the text on the ID card.
ms_my: Jika foto yang anda serahkan ditolak, cuba gerakkan komputer atau orientasi kamera untuk menukar sudut pencahayaan. Sebab yang paling biasa untuk penolakan ialah ketidakupayaan untuk membaca teks pada kad pengenalan.

source: What if I have difficulty holding my head in position relative to the camera?
ms_my: Bagaimana jika saya mengalami kesukaran memegang kepala dalam kedudukan berbanding kamera?

source: If you require assistance with taking either photo for submission, contact %(platformName)s support for additional suggestions.
ms_my: Jika anda memerlukan bantuan untuk mengambil salah satu foto untuk diserahkan, hubungi sokongan %(platformName)s untuk cadangan tambahan.

source: Next: %(nextStepTitle)s
ms_my: Seterusnya: %(nextStepTitle)s

source: Take a Photo of Your ID
ms_my: Ambil Foto ID Anda

source: Use your webcam to take a photo of your ID.
ms_my: Gunakan kamera web anda untuk mengambil foto ID anda.

source: You need an ID with your name and photo. A driver's license, passport, or ID are all acceptable.
ms_my: Anda memerlukan ID dengan nama dan foto anda. Lesen memandu, pasport atau ID semuanya boleh diterima.

source: Tips on taking a successful photo
ms_my: Petua untuk mengambil gambar yang berjaya

source: Ensure that you can see your photo and read your name
ms_my: Pastikan anda boleh melihat foto anda dan membaca nama anda

source: Make sure your ID is well-lit
ms_my: Pastikan ID anda terang

source: Once in position, use the Take Photo button {icon} to capture your ID
ms_my: Setelah berada dalam kedudukan, gunakan butang Ambil Foto {icon} untuk menangkap ID anda

source: As part of the verification process, you take a photo of both your face and a photo ID. Our authorization service confirms your identity by comparing the photo you take with the photo on your ID.
ms_my: Sebagai sebahagian daripada proses pengesahan, anda mengambil foto muka dan ID foto anda. Perkhidmatan kebenaran kami mengesahkan identiti anda dengan membandingkan foto yang anda ambil dengan foto pada ID anda.

source: You may be able to complete the image capture procedure without assistance, but it may take a couple of submission attempts to get the camera positioning right. Optimal camera positioning varies with each computer, but generally, the best position for a photo of an ID card is 8-12 inches (20-30 centimeters) from the camera, with the ID card centered relative to the camera.
ms_my: Anda mungkin boleh melengkapkan prosedur penangkapan imej tanpa bantuan, tetapi mungkin memerlukan beberapa percubaan penyerahan untuk mendapatkan kedudukan kamera yang betul. Kedudukan kamera optimum berbeza-beza mengikut setiap komputer, tetapi secara amnya, kedudukan terbaik untuk foto kad ID ialah 8-12 inci (20-30 sentimeter) dari kamera, dengan kad ID dipusatkan berbanding kamera.

source: What if I have difficulty holding my ID in position relative to the camera?
ms_my: Bagaimana jika saya mengalami kesukaran memegang ID saya dalam kedudukan berbanding kamera?

source: Preview of uploaded image
ms_my: Pratonton imej yang dimuat naik

source: Upload an image or capture one with your web or phone camera.
ms_my: Muat naik imej atau tangkap imej dengan kamera web atau telefon anda.

source: Use your webcam to take a photo of your face. We will match this photo with the photo on your ID.
ms_my: Gunakan kamera web anda untuk mengambil foto wajah anda. Kami akan memadankan foto ini dengan foto pada ID anda.

source: Make sure your face is well-lit
ms_my: Pastikan muka anda terang benderang

source: Be sure your entire face is inside the frame
ms_my: Pastikan seluruh muka anda berada di dalam bingkai

source: Once in position, use the Take Photo button {icon} to capture your photo
ms_my: Setelah berada dalam kedudukan, gunakan butang Ambil Foto {icon} untuk menangkap foto anda

source: Can we match the photo you took with the one on your ID?
ms_my: Bolehkah kami memadankan foto yang anda ambil dengan foto pada ID anda?

source: As part of the verification process, you take a photo of both your face and a government-issued photo ID. Our authorization service confirms your identity by comparing the photo you take with the photo on your ID.
ms_my: Sebagai sebahagian daripada proses pengesahan, anda mengambil foto kedua-dua wajah anda dan ID foto keluaran kerajaan. Perkhidmatan kebenaran kami mengesahkan identiti anda dengan membandingkan foto yang anda ambil dengan foto pada ID anda.

source: We use the highest levels of security available to encrypt your photo and send it to our authorization service for review. Your photo and information are not saved or visible anywhere on %(platformName)s after the verification process is complete.
ms_my: Kami menggunakan tahap keselamatan tertinggi yang tersedia untuk menyulitkan foto anda dan menghantarnya ke perkhidmatan kebenaran kami untuk semakan. Foto dan maklumat anda tidak disimpan atau kelihatan di mana-mana pada %(platformName)s selepas proses pengesahan selesai.

source: Thanks for returning to verify your ID in: {courseName}
ms_my: Terima kasih kerana kembali untuk mengesahkan ID anda dalam: {courseName}

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email. After you complete activation you can return and refresh this page.
ms_my: Anda perlu mengaktifkan akaun anda sebelum anda boleh mendaftar dalam kursus. Semak peti masuk anda untuk e-mel pengaktifan. Selepas anda melengkapkan pengaktifan anda boleh kembali dan muat semula halaman ini.

source: Activate Your Account
ms_my: Aktifkan akaun anda

source: Photo ID
ms_my: ID foto

source: A driver's license, passport, or other government-issued ID with your name and photo
ms_my: Lesen memandu, pasport atau ID lain yang dikeluarkan kerajaan dengan nama dan foto anda

source: Webcam
ms_my: Kamera web

source: You are enrolling in: {courseName}
ms_my: Anda sedang mendaftar dalam: {courseName}

source: You are upgrading your enrollment for: {courseName}
ms_my: Anda sedang meningkatkan pendaftaran anda untuk: {courseName}

source: You can now enter your payment information and complete your enrollment.
ms_my: Anda kini boleh memasukkan maklumat pembayaran anda dan melengkapkan pendaftaran anda.

source: You can pay now even if you don't have the following items available, but you will need to have these by {date} to qualify to earn a Verified Certificate.
ms_my: Anda boleh membayar sekarang walaupun anda tidak mempunyai item berikut, tetapi anda perlu memilikinya sebelum {date} untuk melayakkan diri memperoleh Sijil Disahkan.

source: An email has been sent to {userEmail} with a link for you to activate your account.
ms_my: E-mel telah dihantar ke {userEmail} dengan pautan untuk anda mengaktifkan akaun anda.

source: Why activate?
ms_my: Kenapa aktifkan?

source: We ask you to activate your account to ensure it is really you creating the account and to prevent fraud.
ms_my: Kami meminta anda untuk mengaktifkan akaun anda untuk memastikan anda benar-benar mencipta akaun dan untuk mengelakkan penipuan.

source: You can pay now even if you don't have the following items available, but you will need to have these to qualify to earn a Verified Certificate.
ms_my: Anda boleh membayar sekarang walaupun anda tidak mempunyai item berikut, tetapi anda perlu memilikinya untuk melayakkan anda memperoleh Sijil Disahkan.
