Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Course team user does not exist
ms_my: Pengguna pasukan kursus tidak wujud

source: Number of course outline regenerations successfully requested: {regenerates}
ms_my: Bilangan penjanaan semula garis kursus yang berjaya diminta: {regenerates}

source: Regenerate selected course outlines
ms_my: Menjana semula garis besar kursus yang dipilih

source: All course outline regenerations successfully requested.
ms_my: Semua penjanaan semula garis kursus berjaya diminta.

source: Regenerate *all* course outlines
ms_my: Menjana semula *semua* garis besar kursus

source: Upload completed
ms_my: Muat naik selesai

source: File {filename} exceeds maximum size of {maximum_size_in_megabytes} MB.
ms_my: Fail {filename} melebihi saiz maksimum {maximum_size_in_megabait} MB.

source: The groups in this configuration can be mapped to cohorts in the Instructor Dashboard.
ms_my: Kumpulan dalam konfigurasi ini boleh dipetakan ke kohort dalam Papan Pemuka Pengajar.

source: Content Groups
ms_my: Kumpulan Kandungan

source: invalid JSON
ms_my: JSON tidak sah

source: must have name of the configuration
ms_my: mesti mempunyai nama konfigurasi

source: must have at least one group
ms_my: mesti mempunyai sekurang-kurangnya satu kumpulan

source: unable to load this type of group configuration
ms_my: tidak dapat memuatkan konfigurasi kumpulan jenis ini

source: Invalid course update id.
ms_my: Id kemas kini kursus tidak sah.

source: Course update not found.
ms_my: Kemas kini kursus tidak ditemui.

source: Could not index item: {}
ms_my: Tidak dapat mengindeks item: {}

source: General indexing error occurred
ms_my: Ralat pengindeksan umum berlaku

source: (Unnamed)
ms_my: (Tidak bernama)

source: Aborting import because a course with this id: {} already exists.
ms_my: Menggugurkan import kerana kursus dengan id ini: {} sudah wujud.

source: Permission denied. You do not have write access to this course.
ms_my: Kebenaran ditolak. Anda tidak mempunyai akses menulis kepada kursus ini.

source: Could not find the {0} file in the package.
ms_my: Tidak dapat mencari fail {0} dalam pakej.

source: Uploaded Tar file not found. Try again.
ms_my: Fail Tar yang dimuat naik tidak ditemui. Cuba lagi.

source: We only support uploading a .tar.gz file.
ms_my: Kami hanya menyokong memuat naik fail .tar.gz.

source: Aborting import since a library with this id already exists.
ms_my: Menggugurkan import kerana perpustakaan dengan id ini sudah wujud.

source: Course olx validation failed. Please check your email.
ms_my: Pengesahan olx kursus gagal. Sila semak e-mel anda.

source: Permission denied
ms_my: Kebenaran ditolak

source: Unknown error while importing course.
ms_my: Ralat tidak diketahui semasa mengimport kursus.

source: An Unknown error occurred during the unpacking step.
ms_my: Ralat Tidak diketahui berlaku semasa langkah membongkar.

source: Unknown User ID: {0}
ms_my: ID Pengguna tidak diketahui: {0}

source: Unsafe archive file. Aborting import.
ms_my: Fail arkib yang tidak selamat. Menggugurkan import.

source: User permission denied.
ms_my: Kebenaran pengguna ditolak.

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
ms_my: GIT_REPO_EXPORT_DIR tidak ditetapkan atau laluan {0} tidak wujud, sila ciptakannya atau konfigurasikan laluan lain dengan GIT_REPO_EXPORT_DIR

source: Non writable git url provided. Expecting something like: git@github.com:openedx/openedx-demo-course.git
ms_my: Url git tidak boleh ditulis disediakan. Mengharapkan sesuatu seperti: git@github.com:openedx/openedx-demo-course.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
ms_my: Jika menggunakan url http, anda mesti memberikan nama pengguna dan kata laluan dalam url tersebut. Sama seperti https://user:pass@github.com/user/course.

source: Unable to determine branch, repo in detached HEAD mode
ms_my: Tidak dapat menentukan cawangan, repo dalam mod HEAD terpisah

source: Unable to update or clone git repository.
ms_my: Tidak dapat mengemas kini atau mengklon repositori git.

source: Unable to export course to xml.
ms_my: Tidak dapat mengeksport kursus ke xml.

source: Unable to configure git username and password
ms_my: Tidak dapat mengkonfigurasi nama pengguna dan kata laluan git

source: Unable to commit changes. This is usually because there are no changes to be committed
ms_my: Tidak dapat melakukan perubahan. Ini biasanya kerana tiada perubahan yang perlu dilakukan

source: Unable to push changes. This is usually because the remote repository cannot be contacted
ms_my: Tidak dapat menolak perubahan. Ini biasanya kerana repositori jauh tidak dapat dihubungi

source: Bad course location provided
ms_my: Lokasi kursus yang buruk disediakan

source: Missing branch on fresh clone
ms_my: Hilang cawangan pada klon segar

source: Vertical
ms_my: Menegak

source: Section
ms_my: Bahagian

source: Subsection
ms_my: Subseksyen

source: Problem
ms_my: Masalah

source: Library Content
ms_my: Kandungan Perpustakaan

source: Problem Bank
ms_my: Bank Masalah

source: Marks a field as deprecated.
ms_my: Menandai medan sebagai tidak digunakan.

source: User-friendly display name for the field
ms_my: Nama paparan mesra pengguna untuk medan

source: Help text that describes the setting.
ms_my: Teks bantuan yang menerangkan tetapan.

source: Tab type
ms_my: Jenis tab

source: Default name for the tab displayed to users
ms_my: Nama lalai untuk tab yang dipaparkan kepada pengguna

source: True if it's possible to hide the tab for a course
ms_my: Benar jika boleh menyembunyikan tab untuk kursus

source: True the tab is hidden for the course
ms_my: Benar tab disembunyikan untuk kursus

source: True if it's possible to reorder the tab in the list of tabs
ms_my: Benar jika boleh menyusun semula tab dalam senarai tab

source: True if this tab should be displayed only for instructors
ms_my: Benar jika tab ini harus dipaparkan hanya untuk pengajar

source: Name of the tab displayed to users. Overrides title.
ms_my: Nama tab yang dipaparkan kepada pengguna. Mengatasi tajuk.

source: Additional settings specific to the tab
ms_my: Tetapan tambahan khusus untuk tab

source: ID of tab to update
ms_my: ID tab untuk dikemas kini

source: Location (Usage Key) of tab to update
ms_my: Lokasi (Kunci Penggunaan) tab untuk dikemas kini

source: Need to supply either a valid tab_id or a tab_location.
ms_my: Perlu membekalkan sama ada tab_id yang sah atau tab_location.

source: True to hide the tab, and False to show it.
ms_my: Benar untuk menyembunyikan tab, dan Salah untuk menunjukkannya.

source: Change the visibility of tabs in a course.
ms_my: Tukar keterlihatan tab dalam kursus.

source: The information you entered is incorrect.
ms_my: Maklumat yang anda masukkan tidak betul.

source: The following parameters are required: {missing}.
ms_my: Parameter berikut diperlukan: {missing}.

source: There is a problem with this transcript file. Try to upload a different file.
ms_my: Terdapat masalah dengan fail transkrip ini. Cuba muat naik fail lain.

source: A transcript with the "{language_code}" language code already exists.
ms_my: Transkrip dengan kod bahasa "{language_code}" sudah wujud.

source: A transcript file is required.
ms_my: Fail transkrip diperlukan.

source: Deleted Group
ms_my: Kumpulan Dipadamkan

source: {previous_groups}, {current_group}
ms_my: {kumpulan_sebelumnya}, {kumpulan_semasa}

source: Text
ms_my: Teks

source: Duplicate of {0}
ms_my: Pendua {0}

source: Duplicate of '{0}'
ms_my: Pendua '{0}'

source: Invalid prerequisite course key
ms_my: Kunci kursus prasyarat tidak sah

source: Set Date
ms_my: Tetapkan Tarikh

source: Uploading
ms_my: Memuat naik

source: In Progress
ms_my: Sedang Berlangsung

source: Ready
ms_my: sedia

source: Uploaded
ms_my: Dimuat naik

source: Failed
ms_my: gagal

source: Cancelled
ms_my: Dibatalkan

source: Failed Duplicate
ms_my: Gagal Pendua

source: YouTube Duplicate
ms_my: YouTube Duplikat

source: Invalid Token
ms_my: Token Tidak Sah

source: Imported
ms_my: Diimport

source: Unknown
ms_my: Tidak diketahui

source: Transcription in Progress
ms_my: Transkripsi dalam Proses

source: Transcript Ready
ms_my: Transkrip Sedia

source: Partial Failure
ms_my: Kegagalan Separa

source: Transcript Failed
ms_my: Transkrip Gagal

source: An image file is required.
ms_my: Fail imej diperlukan.

source: {profile_name} URL
ms_my: URL {profile_name}.

source: Name
ms_my: Nama

source: Duration
ms_my: Tempoh

source: Date Added
ms_my: Tarikh Ditambah

source: Video ID
ms_my: ID Video

source: Pending
ms_my: Belum selesai

source: A non zero positive integer is expected
ms_my: Integer positif bukan sifar dijangka

source: The image must have name, content type, and size information.
ms_my: Imej mesti mempunyai maklumat nama, jenis kandungan dan saiz.

source: This image file type is not supported. Supported file types are {supported_file_formats}.
ms_my: Jenis fail imej ini tidak disokong. Jenis fail yang disokong ialah {supported_file_formats}.

source: This image file must be smaller than {image_max_size}.
ms_my: Fail imej ini mestilah lebih kecil daripada {image_max_size}.

source: This image file must be larger than {image_min_size}.
ms_my: Fail imej ini mestilah lebih besar daripada {image_min_size}.

source: There is a problem with this image file. Try to upload a different file.
ms_my: Terdapat masalah dengan fail imej ini. Cuba muat naik fail lain.

source: Recommended image resolution is {image_file_max_width}x{image_file_max_height}. The minimum resolution is {image_file_min_width}x{image_file_min_height}.
ms_my: Peleraian imej yang disyorkan ialah {image_file_max_width}x{image_file_max_height}. Peleraian minimum ialah {image_file_min_width}x{image_file_min_height}.

source: This image file must have an aspect ratio of {video_image_aspect_ratio_text}.
ms_my: Fail imej ini mesti mempunyai nisbah bidang {video_image_aspect_ratio_text}.

source: The image file name can only contain letters, numbers, hyphens (-), and underscores (_).
ms_my: Nama fail imej hanya boleh mengandungi huruf, nombor, sempang (-), dan garis bawah (_).

source: must have name of the certificate
ms_my: mesti mempunyai nama sijil

source: Certificate dict {0} missing value key '{1}'
ms_my: Sijil dict {0} tiada kunci nilai '{1}'

source: PermissionDenied: Failed in authenticating {user}
ms_my: Kebenaran Ditolak: Gagal dalam mengesahkan {user}

source: {platform_name} Support Levels:
ms_my: Tahap Sokongan {platform_name}:

source: Discussion
ms_my: Perbincangan

source: Open Response
ms_my: Buka Respons

source: Legacy Library
ms_my: Perpustakaan Warisan

source: Drag and Drop
ms_my: Seret dan Lepas

source: Blank
ms_my: kosong

source: Peer Assessment Only
ms_my: Penilaian Rakan Sebaya Sahaja

source: Blank Problem
ms_my: Masalah Kosong

source: Advanced
ms_my: Maju

source: Course has been successfully reindexed.
ms_my: Kursus telah berjaya diindeks semula.

source: Special characters not allowed in organization, course number, and course run.
ms_my: Watak khas tidak dibenarkan dalam organisasi, nombor kursus dan larian kursus.

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
ms_my: Sudah ada kursus yang ditakrifkan dengan organisasi dan nombor kursus yang sama. Sila tukar sama ada organisasi atau nombor kursus menjadi unik.

source: Please change either the organization or course number so that it is unique.
ms_my: Sila tukar sama ada organisasi atau nombor kursus supaya ia unik.

source: User does not have the permission to create courses in this organization or course creation is disabled
ms_my: Pengguna tidak mempunyai kebenaran untuk membuat kursus dalam organisasi ini atau penciptaan kursus dilumpuhkan

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
ms_my: Anda mesti memautkan kursus ini kepada organisasi untuk meneruskan. Organisasi yang anda pilih tidak wujud dalam sistem, anda perlu menambahkannya pada sistem

source: An error occurred while trying to save your tabs
ms_my: Ralat berlaku semasa cuba menyimpan tab anda

source: Tabs Exception
ms_my: Pengecualian Tab

source: This group configuration is in use and cannot be deleted.
ms_my: Konfigurasi kumpulan ini sedang digunakan dan tidak boleh dipadamkan.

source: This content group is in use and cannot be deleted.
ms_my: Kumpulan kandungan ini sedang digunakan dan tidak boleh dipadamkan.

source: Entrance Exam
ms_my: Peperiksaan Kemasukan

source: Entrance Exam - Subsection
ms_my: Peperiksaan Kemasukan - Subseksyen

source: Completed Course Entrance Exam
ms_my: Selesai Peperiksaan Kemasukan Kursus

source: Course successfully exported to git repository
ms_my: Kursus berjaya dieksport ke repositori git

source: We support uploading files in one of the following formats: {IMPORTABLE_FILE_TYPES}
ms_my: Kami menyokong muat naik fail dalam salah satu daripada format berikut: {IMPORTABLE_FILE_TYPES}

source: Some chunks missed during file upload. Please try again
ms_my: Beberapa bahagian terlepas semasa memuat naik fail. Sila cuba lagi

source: File upload failed. Please try again
ms_my: Muat naik fail gagal. Sila cuba lagi

source: User does not have the permission to create library in this organization or course creation is disabled
ms_my: Pengguna tidak mempunyai kebenaran untuk membuat pustaka dalam organisasi ini atau penciptaan kursus dilumpuhkan

source: Unable to create library - missing required field '{field}'
ms_my: Tidak dapat mencipta pustaka - tiada medan yang diperlukan '{field}'

source: There is already a library defined with the same organization and library code. Please change your library code so that it is unique within your organization.
ms_my: Sudah ada perpustakaan yang ditakrifkan dengan organisasi dan kod perpustakaan yang sama. Sila tukar kod perpustakaan anda supaya ia unik dalam organisasi anda.

source: '{organization_key}' is not a valid organization identifier.
ms_my: '{organization_key}' bukan pengecam organisasi yang sah.

source: Access restricted to: {list_of_groups}
ms_my: Akses terhad kepada: {list_of_groups}

source: Transcripts are supported only for "video" blocks.
ms_my: Transkrip hanya disokong untuk blok "video".

source: Cannot find item by locator.
ms_my: Tidak dapat mencari item mengikut pengesan.

source: Video locator is required.
ms_my: Pencari video diperlukan.

source: This transcript file type is not supported.
ms_my: Jenis fail transkrip ini tidak disokong.

source: Video ID is required.
ms_my: ID Video diperlukan.

source: Incoming video data is empty.
ms_my: Data video masuk kosong.

source: Can't find item by locator.
ms_my: Tidak dapat mencari item mengikut pengesan.

source: No such transcript.
ms_my: Tiada transkrip seperti itu.

source: There is a problem with the chosen transcript file.
ms_my: Terdapat masalah dengan fail transkrip yang dipilih.

source: There is a problem with the existing transcript file. Please upload a different file.
ms_my: Terdapat masalah dengan fail transkrip sedia ada. Sila muat naik fail lain.

source: YouTube ID is required.
ms_my: ID YouTube diperlukan.

source: There is a problem with the YouTube transcript file.
ms_my: Terdapat masalah dengan fail transkrip YouTube.

source: Transcripts are not yet supported in content libraries.
ms_my: Transkrip belum lagi disokong dalam perpustakaan kandungan.

source: Insufficient permissions
ms_my: Keizinan tidak mencukupi

source: Could not find user by email address '{email}'.
ms_my: Tidak dapat mencari pengguna melalui alamat e-mel '{email}'.

source: No `role` specified.
ms_my: Tiada `peranan` dinyatakan.

source: User {email} has registered but has not yet activated their account.
ms_my: Pengguna {email} telah mendaftar tetapi masih belum mengaktifkan akaun mereka.

source: Invalid `role` specified.
ms_my: `peranan` tidak sah dinyatakan.

source: You may not remove the last Admin. Add another Admin first.
ms_my: Anda tidak boleh mengalih keluar Pentadbir terakhir. Tambah lagi Admin dulu.

source: Empty
ms_my: kosong

source: Libraries cannot have more than {limit} components
ms_my: Perpustakaan tidak boleh mempunyai lebih daripada {limit} komponen

source: Invalid data
ms_my: Data tidak sah

source: Invalid data ({details})
ms_my: Data tidak sah ({details})

source: There was a problem pasting your component.
ms_my: Terdapat masalah menampal komponen anda.

source: Your clipboard is empty or invalid.
ms_my: Papan keratan anda kosong atau tidak sah.

source: You can not move {source_type} into {target_parent_type}.
ms_my: Anda tidak boleh memindahkan {source_type} ke {target_parent_type}.

source: Item is already present in target location.
ms_my: Item sudah ada di lokasi sasaran.

source: You can not move an item into itself.
ms_my: Anda tidak boleh memindahkan item ke dalam dirinya sendiri.

source: You can not move an item into it's child.
ms_my: Anda tidak boleh mengalihkan item ke dalam anak itu.

source: You can not move an item directly into content experiment.
ms_my: Anda tidak boleh mengalihkan item terus ke dalam percubaan kandungan.

source: {source_usage_key} not found in {parent_usage_key}.
ms_my: {source_usage_key} tidak ditemui dalam {parent_usage_key}.

source: You can not move {source_usage_key} at an invalid index ({target_index}).
ms_my: Anda tidak boleh mengalihkan {source_usage_key} pada indeks yang tidak sah ({target_index}).

source: You must provide target_index ({target_index}) as an integer.
ms_my: Anda mesti menyediakan indeks_target ({target_index}) sebagai integer.

source: Students must score {score}{pct_sign} or higher to access course materials.
ms_my: Pelajar mesti menjaringkan {skor}{pct_sign} atau lebih tinggi untuk mengakses bahan kursus.

source: unrequested
ms_my: tidak diminta

source: pending
ms_my: belum selesai

source: granted
ms_my: diberikan

source: denied
ms_my: dinafikan

source: Studio user
ms_my: Pengguna studio

source: The date when state was last updated
ms_my: Tarikh kali terakhir negeri dikemas kini

source: Current course creator state
ms_my: Keadaan pencipta kursus semasa

source: Optional notes about this user (for example, why course creation access was denied)
ms_my: Nota pilihan tentang pengguna ini (contohnya, sebab akses penciptaan kursus dinafikan)

source: Organizations under which the user is allowed to create courses.
ms_my: Organisasi di mana pengguna dibenarkan membuat kursus.

source: Grant the user the permission to create courses in ALL organizations
ms_my: Berikan pengguna kebenaran untuk membuat kursus dalam SEMUA organisasi

source: Incorrect format for field '{name}'. {detailed_message}
ms_my: Format yang salah untuk medan '{name}'. {detailed_message}

source: Dictionary with the available tags
ms_my: Kamus dengan tag yang tersedia

source: Content is not linked to a Content Library.
ms_my: Kandungan tidak dipautkan ke Pustaka Kandungan.

source: Cannot update content because it does not belong to a course.
ms_my: Tidak boleh mengemas kini kandungan kerana ia bukan milik kursus.

source: Updating content with children is not yet supported.
ms_my: Mengemas kini kandungan dengan kanak-kanak masih belum disokong.

source: Reference to linked library item is malformed
ms_my: Rujukan kepada item perpustakaan yang dipautkan adalah salah bentuk

source: Content type mismatch: {downstream_type} cannot be linked to {upstream_type}.
ms_my: Jenis kandungan tidak padan: {downstream_type} tidak boleh dipautkan ke {upstream_type}.

source: Linked library item was not found in the system
ms_my: Item perpustakaan yang dipautkan tidak ditemui dalam sistem

source: Linked library item could not be loaded: {}
ms_my: Item pustaka yang dipautkan tidak dapat dimuatkan: {}

source: Django site admin
ms_my: Pentadbir tapak Django

source: Django administration
ms_my: pentadbiran Django

source: View site
ms_my: Lihat tapak

source: Documentation
ms_my: Dokumentasi

source: Log out
ms_my: Log keluar

source: Studio Administration
ms_my: Pentadbiran Studio

source: Mode
ms_my: Mod

source: Verification Deadline
ms_my: Tarikh Akhir Pengesahan

source: OPTIONAL: After this date/time, users will no longer be able to submit photos for verification. This appies ONLY to modes that require verification.
ms_my: PILIHAN: Selepas tarikh/masa ini, pengguna tidak lagi boleh menyerahkan foto untuk pengesahan. Ini terpakai SAHAJA pada mod yang memerlukan pengesahan.

source: You're enrolled as a verified student
ms_my: Anda telah mendaftar sebagai pelajar yang disahkan

source: Verified
ms_my: Disahkan

source: ID Verified Ribbon/Badge
ms_my: Reben/Lencana Disahkan ID

source: You're enrolled as an honor code student
ms_my: Anda telah mendaftar sebagai pelajar kod kepujian

source: Honor Code
ms_my: Kod Kehormatan

source: You're enrolled as a professional education student
ms_my: Anda telah mendaftar sebagai pelajar pendidikan profesional

source: Professional Ed
ms_my: Ed profesional

source: Display Name
ms_my: Nama Paparan

source: Price
ms_my: harga

source: Upgrade Deadline
ms_my: Tarikh Akhir Naik Taraf

source: OPTIONAL: After this date/time, users will no longer be able to enroll in this mode. Leave this blank if users can enroll in this mode until enrollment closes for the course.
ms_my: PILIHAN: Selepas tarikh/masa ini, pengguna tidak lagi boleh mendaftar dalam mod ini. Biarkan ini kosong jika pengguna boleh mendaftar dalam mod ini sehingga pendaftaran ditutup untuk kursus.

source: Lock upgrade deadline date
ms_my: Kunci tarikh akhir naik taraf

source: OPTIONAL: Set to True to lock in the explicitly defined upgrade deadline date. Set to False if there is no upgrade deadline or to use the default upgrade deadline.
ms_my: PILIHAN: Tetapkan kepada Benar untuk mengunci tarikh akhir naik taraf yang ditakrifkan dengan jelas. Tetapkan kepada False jika tiada tarikh akhir naik taraf atau gunakan tarikh akhir naik taraf lalai.

source: OPTIONAL: This is the SKU (stock keeping unit) of this mode in the external ecommerce service. Leave this blank if the course has not yet been migrated to the ecommerce service.
ms_my: PILIHAN: Ini ialah SKU (unit penyimpanan stok) mod ini dalam perkhidmatan e-dagang luaran. Biarkan ini kosong jika kursus masih belum dipindahkan ke perkhidmatan e-dagang.

source: OPTIONAL: This is the Android SKU registered on play store for this mode of the course. Leave this blank if the course has not yet been migrated to the ecommerce service.
ms_my: PILIHAN: Ini ialah SKU Android yang didaftarkan di gedung mainan untuk mod kursus ini. Biarkan ini kosong jika kursus masih belum dipindahkan ke perkhidmatan e-dagang.

source: OPTIONAL: This is the iOS SKU registered on app store for this mode of the course. Leave this blank if the course has not yet been migrated to the ecommerce service.
ms_my: PILIHAN: Ini ialah SKU iOS yang didaftarkan di gedung aplikasi untuk mod kursus ini. Biarkan ini kosong jika kursus masih belum dipindahkan ke perkhidmatan e-dagang.

source: This is the bulk SKU (stock keeping unit) of this mode in the external ecommerce service.
ms_my: Ini ialah SKU pukal (unit penyimpanan stok) mod ini dalam perkhidmatan e-dagang luaran.

source: Professional education modes are not allowed to have expiration_datetime set.
ms_my: Mod pendidikan profesional tidak dibenarkan mempunyai tarikh tamat tempoh ditetapkan.
