Repository: kelvin5290/openedx-translations
Catalog: translations/edx-platform/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
ms_my: Anda boleh menggunakan peluncur di bawah Julat Gred Keseluruhan untuk menentukan sama ada kursus anda lulus/gagal atau digredkan melalui surat, dan untuk menetapkan ambang bagi setiap gred.

source: You can specify whether your course offers students a grace period for late assignments.
ms_my: Anda boleh menentukan sama ada kursus anda menawarkan tempoh tangguh kepada pelajar untuk tugasan lewat.

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
ms_my: Anda juga boleh membuat jenis tugasan, seperti kerja rumah, makmal, kuiz dan peperiksaan serta menentukan nilai gred pelajar setiap jenis tugasan.

source: Importing components
ms_my: Mengimport komponen

source: Expand or Collapse
ms_my: Kembangkan atau Runtuhkan

source: Select this problem
ms_my: Pilih masalah ini

source: Sourced from a library - but the upstream link is broken/invalid.
ms_my: Bersumberkan pustaka - tetapi pautan huluan rosak/tidak sah.

source: Sourced from a library.
ms_my: Bersumber dari perpustakaan.

source: Update available - click to sync
ms_my: Kemas kini tersedia - klik untuk menyegerak

source: Update available
ms_my: Kemas kini tersedia

source: Manage Access
ms_my: Urus Akses

source: Manage Tags
ms_my: Urus Teg

source: Copy to Clipboard
ms_my: Salin ke Papan Klip

source: Details
ms_my: Butiran

source: This block contains multiple components.
ms_my: Blok ini mengandungi berbilang komponen.

source: New Textbook
ms_my: Buku Teks Baharu

source: Why should I break my textbook into chapters?
ms_my: Mengapa saya perlu memecahkan buku teks saya kepada beberapa bab?

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
ms_my: Memecahkan buku teks anda kepada beberapa bab mengurangkan masa pemuatan untuk pelajar, terutamanya mereka yang mempunyai sambungan Internet yang perlahan. Membahagikan buku teks kepada beberapa bab juga boleh membantu pelajar mencari maklumat berasaskan topik dengan lebih mudah.

source: What if my book isn't divided into chapters?
ms_my: Bagaimana jika buku saya tidak dibahagikan kepada bab?

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
ms_my: Jika buku teks anda tidak mempunyai bab individu, anda boleh memuat naik keseluruhan teks sebagai satu bab dan masukkan nama pilihan anda dalam medan Nama Bab.

source: Learn more about textbooks
ms_my: Ketahui lebih lanjut tentang buku teks

source: Video Uploads
ms_my: Muat Naik Video

source: Course Video Settings
ms_my: Tetapan Video Kursus

source: Changing..
ms_my: Berubah..

source: Videos per page:
ms_my: Video setiap halaman:

source: Access is not restricted
ms_my: Akses tidak terhad

source: Access to this unit is not restricted, but visibility might be affected by inherited settings.
ms_my: Akses kepada unit ini tidak terhad, tetapi keterlihatan mungkin dipengaruhi oleh tetapan yang diwarisi.

source: Access to this component is not restricted, but visibility might be affected by inherited settings.
ms_my: Akses kepada komponen ini tidak terhad, tetapi keterlihatan mungkin dipengaruhi oleh tetapan yang diwarisi.

source: You can restrict access to this unit to learners in specific enrollment tracks or content groups.
ms_my: Anda boleh mengehadkan akses kepada unit ini kepada pelajar dalam runut pendaftaran atau kumpulan kandungan tertentu.

source: You can restrict access to this component to learners in specific enrollment tracks or content groups.
ms_my: Anda boleh mengehadkan akses kepada komponen ini kepada pelajar dalam runut pendaftaran atau kumpulan kandungan tertentu.

source: You can restrict access to this unit to learners in specific content groups.
ms_my: Anda boleh mengehadkan akses kepada unit ini kepada pelajar dalam kumpulan kandungan tertentu.

source: You can restrict access to this component to learners in specific content groups.
ms_my: Anda boleh mengehadkan akses kepada komponen ini kepada pelajar dalam kumpulan kandungan tertentu.

source: Manage content groups
ms_my: Urus kumpulan kandungan

source: {screen_reader_start}Warning:{screen_reader_end} The unit that contains this component is hidden from learners. The unit setting overrides the component access settings defined here.
ms_my: {screen_reader_start}Amaran:{screen_reader_end} Unit yang mengandungi komponen ini disembunyikan daripada pelajar. Tetapan unit mengatasi tetapan akses komponen yang ditakrifkan di sini.

source: Access is restricted to:
ms_my: Akses terhad kepada:

source: Restrict access to:
ms_my: Hadkan akses kepada:

source: Select a group type
ms_my: Pilih jenis kumpulan

source: All Learners and Staff
ms_my: Semua Pelajar dan Kakitangan

source: Select one or more groups:
ms_my: Pilih satu atau lebih kumpulan:

source: This group no longer exists. Choose another group or remove the access restriction.
ms_my: Kumpulan ini tidak lagi wujud. Pilih kumpulan lain atau alih keluar sekatan akses.

source: {email} has requested {studio_name} course creator privileges on edge
ms_my: {email} telah meminta keistimewaan pencipta kursus {studio_name} di tepi

source: To grant or deny this request, use the course creator admin table.
ms_my: Untuk memberikan atau menolak permintaan ini, gunakan jadual pentadbir pencipta kursus.

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
ms_my: Permintaan anda untuk hak penciptaan kursus kepada {studio_name} telah ditolak. Jika anda percaya ini adalah satu kesilapan, sila hubungi {email}

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
ms_my: Hak penciptaan kursus anda untuk {studio_name} telah dibatalkan. Jika anda percaya ini adalah satu kesilapan, sila hubungi {email}

source: Your course creator status for {studio_name}
ms_my: Status pencipta kursus anda untuk {studio_name}

source: Here are some validations we found with your course content.
ms_my: Berikut ialah beberapa pengesahan yang kami temui dengan kandungan kursus anda.

source: Errors:
ms_my: Ralat:

source: Warnings:
ms_my: Amaran:

source: {platform_name} {studio_name}: Task Status Update
ms_my: {platform_name} {studio_name}: Kemas Kini Status Tugasan

source: Thanks for activating your account.
ms_my: Terima kasih kerana mengaktifkan akaun anda.

source: This account has already been activated.
ms_my: Akaun ini telah pun diaktifkan.

source: Visit your {link_start}dashboard{link_end} to see your courses.
ms_my: Lawati {link_start}papan pemuka{link_end} anda untuk melihat kursus anda.

source: You can now {link_start}sign in{link_end}.
ms_my: Anda kini boleh {link_start}log masuk{link_end}.

source: Activation Invalid
ms_my: Pengaktifan Tidak Sah

source: Something went wrong. Email programs sometimes split URLs into two lines, so make sure the URL you're using is formatted correctly. If you still have issues, send us an email message at {email_start}{email}{email_end}.
ms_my: Sesuatu telah berlaku. Program e-mel kadangkala membahagikan URL kepada dua baris, jadi pastikan URL yang anda gunakan diformatkan dengan betul. Jika anda masih menghadapi masalah, hantarkan mesej e-mel kepada kami di {email_start}{email}{email_end}.

source: Return to the {link_start}home page{link_end}.
ms_my: Kembali ke {link_start}halaman utama{link_end}.

source: Support will be removed in an upcoming release.
ms_my: Sokongan akan dialih keluar dalam keluaran akan datang.

source: Support will be removed on {expiration_date}.
ms_my: Sokongan akan dialih keluar pada {expired_date}.

source: This course uses a legacy storage format.
ms_my: Kursus ini menggunakan format storan warisan.

source: Please reach out to your support team contact, if you have any additional questions or concerns.
ms_my: Sila hubungi kenalan pasukan sokongan anda, jika anda mempunyai sebarang soalan atau kebimbangan tambahan.

source: Policies
ms_my: dasar

source: Accessibility Accommodation Request
ms_my: Permintaan Penginapan Kebolehcapaian

source: Legal
ms_my: sah

source: edX, Open edX, and the edX and Open edX logos are registered trademarks of {link_start}edX Inc.{link_end}
ms_my: edX, Open edX dan logo edX dan Open edX ialah tanda dagangan berdaftar {link_start}edX Inc.{link_end}

source: Current Course:
ms_my: Kursus Semasa:

source: Course Navigation
ms_my: Navigasi Kursus

source: Outline
ms_my: Garis besar

source: Videos
ms_my: Video

source: Publisher
ms_my: Penerbit

source: Export
ms_my: Eksport

source: Current Library:
ms_my: Perpustakaan Semasa:

source: Language preference
ms_my: Keutamaan bahasa

source: Choose Language
ms_my: Pilih Bahasa

source: Account
ms_my: Akaun

source: Account Navigation
ms_my: Navigasi Akaun

source: Contextual Online Help
ms_my: Bantuan Dalam Talian Kontekstual

source: Sign Up
ms_my: Daftar

source: Launch Latex Source Compiler
ms_my: Lancarkan Pengkompil Sumber Lateks

source: Heading
ms_my: Tajuk

source: Insert a heading
ms_my: Sisipkan tajuk

source: Add a multiple choice question
ms_my: Tambah soalan aneka pilihan

source: Add a question with checkboxes
ms_my: Tambahkan soalan dengan kotak pilihan

source: Insert a text response
ms_my: Sisipkan respons teks

source: Insert a numerical response
ms_my: Sisipkan respons berangka

source: Insert a dropdown response
ms_my: Sisipkan respons lungsur turun

source: Explanation
ms_my: Penjelasan

source: Add an explanation for this question
ms_my: Tambah penjelasan untuk soalan ini

source: Advanced Editor
ms_my: Editor Lanjutan

source: Markdown Help
ms_my: Bantuan Markdown

source: Looking for help with {studio_name}?
ms_my: Mencari bantuan dengan {studio_name}?

source: Hide {studio_name} Help
ms_my: Sembunyikan Bantuan {studio_name}.

source: {studio_name} Documentation
ms_my: {studio_name} Dokumentasi

source: Access documentation on http://docs.edx.org
ms_my: Akses dokumentasi di http://docs.edx.org

source: edX Documentation
ms_my: Dokumentasi edX

source: Access the Open edX Portal
ms_my: Akses Portal edX Buka

source: Open edX Portal
ms_my: Buka Portal edX

source: Enroll in edX101: Overview of Creating an edX Course
ms_my: Daftar dalam edX101: Gambaran Keseluruhan Mencipta Kursus edX

source: Enroll in edX101
ms_my: Daftar dalam edX101

source: Enroll in StudioX: Creating a Course with edX Studio
ms_my: Daftar dalam StudioX: Mencipta Kursus dengan edX Studio

source: Enroll in StudioX
ms_my: Daftar dalam StudioX

source: Send an email to {email}
ms_my: Hantar e-mel ke {email}

source: name
ms_my: Nama

source: Currently signed in as:
ms_my: Pada masa ini dilog masuk sebagai:

source: Sign Out
ms_my: Log Keluar

source: Feedback Form
ms_my: Borang Maklum Balas

source: Email: {email}
ms_my: E-mel: {email}

source: Full Name: {realname}
ms_my: Nama Penuh: {nama sebenar}

source: Inquiry Type: {inquiry_type}
ms_my: Jenis Pertanyaan: {inquiry_type}

source: Message: {message}
ms_my: Mesej: {message}

source: Tags: {tags}
ms_my: Teg: {tags}

source: Additional Info:
ms_my: Maklumat Tambahan:

source: Feedback from user
ms_my: Maklum balas daripada pengguna

source: The email associated with your {platform_name} account has changed from {old_email} to {new_email}.
ms_my: E-mel yang dikaitkan dengan akaun {platform_name} anda telah ditukar daripada {old_email} kepada {new_email}.

source: No action is needed on your part.
ms_my: Tiada tindakan diperlukan di pihak anda.

source: If this change is not correct, contact {link_start}{platform_name} Support{link_end} or your administrator.
ms_my: Jika perubahan ini tidak betul, hubungi Sokongan {link_start}{platform_name}{link_end} atau pentadbir anda.

source: Your {platform_name} account email has been updated
ms_my: E-mel akaun {platform_name} anda telah dikemas kini

source: Add a Post
ms_my: Tambah Siaran

source: New topic form
ms_my: Borang topik baharu

source: Discussion thread list
ms_my: Senarai utas perbincangan

source: Private Discussion
ms_my: Perbincangan Persendirian

source: This is a private discussion. You do not have permissions to view this discussion
ms_my: Ini perbincangan peribadi. Anda tidak mempunyai kebenaran untuk melihat perbincangan ini

source: Discussion unavailable
ms_my: Perbincangan tidak tersedia

source: The discussions are currently undergoing maintenance. We'll have them back up shortly!
ms_my: Perbincangan sedang dalam proses penyelenggaraan. Kami akan membuat mereka kembali tidak lama lagi!

source: Content Locked
ms_my: Kandungan Dikunci

source: Go to Prerequisite Section
ms_my: Pergi ke Bahagian Prasyarat

source: Collapse Instructions
ms_my: Runtuhkan Arahan

source: Guided Discussion
ms_my: Perbincangan Berpandu

source: Hide Annotations
ms_my: Sembunyikan Anotasi

source: Bookmarked
ms_my: Ditanda buku

source: Bookmark this page
ms_my: Tandai halaman ini

source: You do not have access to this dependency block.
ms_my: Anda tidak mempunyai akses kepada blok pergantungan ini.

source: LEARN MORE
ms_my: KETAHUI LEBIH LANJUT

source: Starts
ms_my: Bermula

source: Starts: {date}
ms_my: Bermula: {tarikh}

source: View all Courses
ms_my: Lihat semua Kursus

source: Dashboard
ms_my: Papan pemuka

source: results successfully populated,
ms_my: keputusan berjaya diisi,

source: Click to load all enrolled courses
ms_my: Klik untuk memuatkan semua kursus yang didaftarkan

source: You are not enrolled in any courses yet.
ms_my: Anda belum mendaftar dalam mana-mana kursus lagi.

source: Explore courses
ms_my: Terokai kursus

source: Activate your account!
ms_my: Aktifkan akaun anda!

source: Course-loading errors
ms_my: Ralat memuatkan kursus

source: Search Your Courses
ms_my: Cari Kursus Anda

source: Clear search
ms_my: Kosongkan carian

source: Skip to list of announcements
ms_my: Langkau ke senarai pengumuman

source: Activate your account so you can log back in
ms_my: Aktifkan akaun anda supaya anda boleh log masuk semula

source: We sent an email to {strong_start}{email}{strong_end} with a link to activate your account. Can’t find it? Check your spam folder or {link_start}resend the email{link_end}.
ms_my: Kami menghantar e-mel kepada {strong_start}{email}{strong_end} dengan pautan untuk mengaktifkan akaun anda. Tidak dapat mencarinya? Semak folder spam anda atau {link_start}hantar semula e-mel{link_end}.

source: Continue to {platform_name}
ms_my: Teruskan ke {platform_name}

source: Email Settings for {course_number}
ms_my: Tetapan E-mel untuk {course_number}

source: Receive course emails
ms_my: Terima e-mel kursus

source: Save Settings
ms_my: Simpan Tetapan

source: Unenroll
ms_my: Nyahdaftar

source: E-mail change failed
ms_my: Perubahan e-mel gagal

source: We were unable to send a confirmation email to {email}
ms_my: Kami tidak dapat menghantar e-mel pengesahan ke {email}

source: Go back to the {link_start}home page{link_end}.
ms_my: Kembali ke {link_start}halaman utama{link_end}.

source: E-mail change successful!
ms_my: Penukaran e-mel berjaya!

source: You should see your new email in your {link_start}dashboard{link_end}.
ms_my: Anda sepatutnya melihat e-mel baharu anda dalam {link_start}papan pemuka{link_end} anda.

source: An account with the new e-mail address already exists.
ms_my: Akaun dengan alamat e-mel baharu sudah wujud.

source: You should Register before trying to access the Unit
ms_my: Anda harus Daftar sebelum cuba mengakses Unit

# self
source: Enroll
ms_my: Daftar

source: Don't enroll
ms_my: Jangan daftar

source: Student Enrollment Form
ms_my: Borang Pendaftaran Pelajar

source: Course:
ms_my: Kursus:

source: Add new students
ms_my: Tambah pelajar baharu

source: Existing students:
ms_my: Pelajar sedia ada:

source: New students added:
ms_my: Pelajar baharu menambah:

source: Students rejected:
ms_my: Pelajar ditolak:

source: Debug:
ms_my: Nyahpepijat:

source: External Authentication failed
ms_my: Pengesahan Luaran gagal

source: organization logo
ms_my: logo organisasi

source: Password Reset
ms_my: Tetapan Semula Kata Laluan

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
ms_my: Sila masukkan alamat e-mel anda di bawah, dan kami akan menghantar arahan e-mel untuk menetapkan kata laluan baharu.

source: Required Information
ms_my: Maklumat yang Diperlukan

source: Your E-mail Address
ms_my: Alamat E-mel anda

source: This is the e-mail address you used to register with {platform}
ms_my: Ini ialah alamat e-mel yang anda gunakan untuk mendaftar dengan {platform}

source: Reset My Password
ms_my: Tetapkan Semula Kata Laluan Saya

source: Email is incorrect.
ms_my: E-mel tidak betul.

source: The course has ended.
ms_my: Kursus telah tamat.

source: The due date for this assignment has passed.
ms_my: Tarikh akhir tugasan ini telah berlalu.

source: Because the course has ended, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
ms_my: Oleh kerana kursus telah tamat, tugasan ini tidak lagi tersedia.{line_break}Jika anda telah menyelesaikan tugasan ini, gred anda tersedia di {link_start}halaman kemajuan{link_end}.

source: Because the due date has passed, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
ms_my: Oleh kerana tarikh akhir telah berlalu, tugasan ini tidak lagi tersedia.{line_break}Jika anda telah menyelesaikan tugasan ini, gred anda tersedia di {link_start}halaman kemajuan{link_end}.

source: Search for a course
ms_my: Cari kursus

source: Welcome to {platform_name}
ms_my: Selamat datang ke {platform_name}

source: It works! Powered by the Open edX{registered_trademark} Platform
ms_my: Ia berkesan! Dikuasakan oleh Platform Open edX{registered_trademark}.

source: Invalid email change key
ms_my: Kunci pertukaran e-mel tidak sah

source: This e-mail key is not valid. Please check:
ms_my: Kunci e-mel ini tidak sah. Sila semak:

source: Was this key already used? Check whether the e-mail change has already happened.
ms_my: Adakah kunci ini sudah digunakan? Semak sama ada perubahan e-mel telah berlaku.

source: Did your e-mail client break the URL into two lines?
ms_my: Adakah klien e-mel anda memecahkan URL kepada dua baris?

source: The keys are valid for a limited amount of time. Has the key expired?
ms_my: Kunci sah untuk tempoh masa yang terhad. Adakah kuncinya telah tamat tempoh?

source: External resource
ms_my: Sumber luaran

source: {total_points} points possible
ms_my: {total_points} mata mungkin

source: View resource in a new window
ms_my: Lihat sumber dalam tetingkap baharu

source: Feedback on your work from the grader:
ms_my: Maklum balas tentang kerja anda daripada penggred:

source: Press to Launch
ms_my: Tekan untuk Melancarkan

source: Manage student accounts
ms_my: Urus akaun pelajar

source: Username:
ms_my: Nama pengguna:

source: Profile:
ms_my: Profil:

source: Image:
ms_my: Imej:

source: Name:
ms_my: nama:

source: Choose an action:
ms_my: Pilih tindakan:

source: View Profile
ms_my: Lihat Profil

source: Disable Account
ms_my: Lumpuhkan Akaun

source: Reenable Account
ms_my: Dayakan Akaun

source: Remove Profile Image
ms_my: Alih Keluar Imej Profil

source: Students whose accounts have been disabled
ms_my: Pelajar yang akaunnya telah dilumpuhkan

source: (reload your page to refresh)
ms_my: (muat semula halaman anda untuk memuat semula)

source: working
ms_my: bekerja

source: There has been an error on the {platform_name} servers
ms_my: Terdapat ralat pada pelayan {platform_name}.

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible.
ms_my: Harap maaf, modul ini tidak tersedia buat sementara waktu. Kakitangan kami sedang berusaha untuk memperbaikinya secepat mungkin.

source: Raw data:
ms_my: Data mentah:

source: Course View
ms_my: Pandangan Kursus

source: View this course as:
ms_my: Lihat kursus ini sebagai:

source: Staff
ms_my: Kakitangan

source: Learner
ms_my: pelajar

source: Specific learner
ms_my: Pelajar khusus

source: Learner in {content_group}
ms_my: Pelajar dalam {content_group}

source: Username or email:
ms_my: Nama pengguna atau e-mel:

source: Set preview mode
ms_my: Tetapkan mod pratonton

source: You are now viewing the course as {i_start}{user_name}{i_end}.
ms_my: Anda kini melihat kursus sebagai {i_start}{user_name}{i_end}.

source: View in Studio
ms_my: Lihat dalam Studio

source: View in Insights
ms_my: Lihat dalam Insights

source: Hint
ms_my: Petunjuk

source: Save
ms_my: Jimat

source: Save your answer
ms_my: Simpan jawapan anda

source: Reset
ms_my: Tetapkan semula

source: Reset your answer
ms_my: Tetapkan semula jawapan anda

source: Show answer
ms_my: Tunjukkan jawapan

source: You have used {num_used} of {num_total} attempt
ms_my: Anda telah menggunakan {num_used} daripada {num_total} percubaan

source: Grading method: {grading_method}
ms_my: Kaedah penggredan: {grading_method}

source: Some problems have options such as save, reset, hints, or show answer. These options follow the Submit button.
ms_my: Sesetengah masalah mempunyai pilihan seperti simpan, tetapkan semula, pembayang atau tunjukkan jawapan. Pilihan ini mengikut butang Hantar.

source: Answers are displayed within the problem
ms_my: Jawapan dipaparkan dalam masalah

source: Next Hint
ms_my: Petua Seterusnya

source: Review
ms_my: Semakan

source: Log In
ms_my: Log Masuk

source: Your username, email, and full name will be sent to {destination}, where the collection and use of this information will be governed by their terms of service and privacy policy.
ms_my: Nama pengguna, e-mel dan nama penuh anda akan dihantar ke {destination}, di mana pengumpulan dan penggunaan maklumat ini akan dikawal oleh syarat perkhidmatan dan dasar privasi mereka.

source: E-mail
ms_my: E-mel

source: Learn more about this course
ms_my: Ketahui lebih lanjut tentang kursus ini

source: Go to course
ms_my: Pergi ke kursus

source: Enroll in this course
ms_my: Daftar dalam kursus ini

source: {course_number} Courseware
ms_my: {course_number} Perisian kursus

source: Re-subscribe Successful!
ms_my: Langganan semula Berjaya!

source: You have re-enabled forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}.
ms_my: Anda telah mendayakan semula e-mel pemberitahuan forum daripada {platform_name}. Anda boleh {dashboard_link_start}kembali ke papan pemuka anda{link_end}.

source: Secondary e-mail change failed
ms_my: Perubahan e-mel kedua gagal

source: We were unable to activate your secondary email {secondary_email}
ms_my: Kami tidak dapat mengaktifkan e-mel kedua anda {secondary_email}

source: Secondary e-mail change successful!
ms_my: Penukaran e-mel kedua berjaya!

source: Your secondary email has been activated. Please visit {link_start}dashboard{link_end} for courses.
ms_my: E-mel kedua anda telah diaktifkan. Sila lawati {link_start}papan pemuka{link_end} untuk kursus.

source: Important!
ms_my: Penting!

# unit
source: Previous
ms_my: Sebelumnya

# unit
source: Next
ms_my: Seterusnya

source: Sequence
ms_my: Urutan

source: Completed
ms_my: Selesai

source: New Unit
ms_my: Unit Baru

source: Paste as new unit
ms_my: Tampal sebagai unit baharu
