Repository: kelvin5290/openedx-translations
Catalog: translations/xblock-lti-consumer/lti_consumer/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Missing LTI 1.3 authentication token.
ms_my: Token pengesahan LTI 1.3 tiada.

source: Invalid token header. No credentials provided.
ms_my: Pengepala token tidak sah. Tiada kelayakan diberikan.

source: Invalid token header. Token string should not contain spaces.
ms_my: Pengepala token tidak sah. Rentetan token tidak boleh mengandungi ruang.

source: LTI configuration not found.
ms_my: Konfigurasi LTI tidak ditemui.

source: Invalid token signature.
ms_my: Tandatangan token tidak sah.

source: No valid user id found in endpoint URL
ms_my: Tiada id pengguna yang sah ditemui dalam URL titik akhir

source: Configuration on block
ms_my: Konfigurasi pada blok

source: Database Configuration
ms_my: Konfigurasi Pangkalan Data

source: Reusable Configuration
ms_my: Konfigurasi Boleh Digunakan Semula

source: Display Name
ms_my: Nama Paparan

source: Enter the name that students see for this component. Analytics reports may also use the display name to identify this component.
ms_my: Masukkan nama yang pelajar lihat untuk komponen ini. Laporan analitis juga boleh menggunakan nama paparan untuk mengenal pasti komponen ini.

source: LTI Consumer
ms_my: Pengguna LTI

source: LTI Application Information
ms_my: Maklumat Permohonan LTI

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
ms_my: Masukkan perihalan aplikasi pihak ketiga. Jika meminta nama pengguna dan/atau e-mel, gunakan kotak teks ini untuk memaklumkan pengguna mengapa nama pengguna dan/atau e-mel mereka akan dimajukan ke aplikasi pihak ketiga.

source: Configuration Type
ms_my: Jenis Konfigurasi

source: LTI Version
ms_my: Versi LTI

source: LTI Reusable Configuration ID
ms_my: ID Konfigurasi Boleh Guna Semula LTI

source: Enter the reusable LTI external configuration ID provided by the support staff.
ms_my: Masukkan ID konfigurasi luaran LTI boleh guna semula yang disediakan oleh kakitangan sokongan.

source: Tool Launch URL
ms_my: URL Pelancaran Alat

source: Tool Initiate Login URL
ms_my: Alat Mulakan URL Log Masuk

source: Registered Redirect URIs
ms_my: URI Ubah Hala Berdaftar

source: Valid urls the Tool may request us to redirect the id token to. The redirect uris are often the same as the launch url/deep linking url so if this field is empty, it will use them as the default. If you need to use different redirect uri's, enter them here. If you use this field you must enter all valid redirect uri's the tool may request.
ms_my: Url sah Alat mungkin meminta kami untuk mengubah hala token id. Uri ubah hala selalunya sama dengan url pelancaran/url pemautan dalam jadi jika medan ini kosong, ia akan menggunakannya sebagai lalai. Jika anda perlu menggunakan uri ubah hala yang berbeza, masukkannya di sini. Jika anda menggunakan medan ini, anda mesti memasukkan semua uri ubah hala yang sah yang mungkin diminta oleh alat.

source: Tool Public Key Mode
ms_my: Mod Kunci Awam Alat

source: Select how the tool's public key information will be specified.
ms_my: Pilih cara maklumat kunci awam alat akan ditentukan.

source: Tool Keyset URL
ms_my: URL Set Kekunci Alat

source: Tool Public Key
ms_my: Kunci Awam Alat

source: Enable LTI NRPS
ms_my: Dayakan LTI NRPS

source: Enable LTI Names and Role Provisioning Services.
ms_my: Dayakan Nama LTI dan Perkhidmatan Peruntukan Peranan.

source: LTI 1.3 Block Client ID - DEPRECATED
ms_my: LTI 1.3 Sekat ID Pelanggan - DITAMATKAN

source: LTI 1.3 Block Key - DEPRECATED
ms_my: Kunci Blok LTI 1.3 - DITAMATKAN

source: Select True if you want to enable LTI Advantage Deep Linking.
ms_my: Pilih Benar jika anda ingin mendayakan LTI Advantage Deep Linking.

source: Deep Linking Launch URL
ms_my: URL Pelancaran Pautan Dalam

source: LTI Assignment and Grades Service
ms_my: Tugasan LTI dan Perkhidmatan Gred

source: Disabled
ms_my: Dilumpuhkan

source: Allow tools to submit grades only (declarative)
ms_my: Benarkan alatan menyerahkan gred sahaja (deklaratif)

source: Allow tools to manage and submit grade (programmatic)
ms_my: Benarkan alatan mengurus dan menyerahkan gred (programmatik)

source: LTI ID
ms_my: ID LTI

source: LTI URL
ms_my: URL LTI

source: Custom Parameters
ms_my: Parameter Tersuai

source: LTI Launch Target
ms_my: Sasaran Pelancaran LTI

source: Select Inline if you want the LTI content to open in an IFrame in the current page. Select Modal if you want the LTI content to open in a modal window in the current page. Select New Window if you want the LTI content to open in a new browser window. This setting is only used when Hide External Tool is set to False.
ms_my: Pilih Sebaris jika anda mahu kandungan LTI dibuka dalam IFrame dalam halaman semasa. Pilih Modal jika anda mahu kandungan LTI dibuka dalam tetingkap modal dalam halaman semasa. Pilih Tetingkap Baharu jika anda mahu kandungan LTI dibuka dalam tetingkap penyemak imbas baharu. Tetapan ini hanya digunakan apabila Hide External Tool ditetapkan kepada False.

source: Button Text
ms_my: Teks Butang

source: Enter the text on the button used to launch the third party application. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal or New Window.
ms_my: Masukkan teks pada butang yang digunakan untuk melancarkan aplikasi pihak ketiga. Tetapan ini hanya digunakan apabila Hide External Tool ditetapkan kepada False dan LTI Launch Target ditetapkan kepada Modal atau New Window.

source: Inline Height
ms_my: Tinggi Sebaris

source: Enter the desired pixel height of the iframe which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Inline.
ms_my: Masukkan ketinggian piksel yang dikehendaki bagi iframe yang akan mengandungi alat LTI. Tetapan ini hanya digunakan apabila Sembunyikan Alat Luaran ditetapkan kepada Palsu dan Sasaran Pelancaran LTI ditetapkan kepada Sebaris.

source: Modal Height
ms_my: Ketinggian Modal

source: Enter the desired viewport percentage height of the modal overlay which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal.
ms_my: Masukkan ketinggian peratusan paparan yang dikehendaki bagi tindanan modal yang akan mengandungi alat LTI. Tetapan ini hanya digunakan apabila Sembunyikan Alat Luaran ditetapkan kepada Palsu dan Sasaran Pelancaran LTI ditetapkan kepada Modal.

source: Modal Width
ms_my: Lebar Modal

source: Enter the desired viewport percentage width of the modal overlay which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal.
ms_my: Masukkan lebar peratusan port pandangan yang dikehendaki bagi tindanan modal yang akan mengandungi alat LTI. Tetapan ini hanya digunakan apabila Sembunyikan Alat Luaran ditetapkan kepada Palsu dan Sasaran Pelancaran LTI ditetapkan kepada Modal.

source: Scored
ms_my: Menjaringkan gol

source: Select True if this component will receive a numerical score from the external LTI system.
ms_my: Pilih Benar jika komponen ini akan menerima skor berangka daripada sistem LTI luaran.

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
ms_my: Masukkan bilangan mata yang mungkin untuk komponen ini. Nilai lalai ialah 1.0. Tetapan ini hanya digunakan apabila Skor ditetapkan kepada Benar.

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
ms_my: Skor disimpan dalam xblock KVS -- pendua skor yang diterbitkan dalam django DB

source: Comment as returned from grader, LTI2.0 spec
ms_my: Komen seperti yang dikembalikan daripada penggred, spesifikasi LTI2.0

source: Hide External Tool
ms_my: Sembunyikan Alat Luaran

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
ms_my: Pilih Benar jika anda ingin menggunakan komponen ini sebagai pemegang tempat untuk menyegerak dengan sistem penggredan luaran dan bukannya melancarkan alat luaran. Tetapan ini menyembunyikan butang Pelancaran dan sebarang IFrames untuk komponen ini.

source: Accept grades past deadline
ms_my: Terima gred melepasi tarikh akhir

source: Select True to allow third party systems to post grades past the deadline.
ms_my: Pilih Benar untuk membenarkan sistem pihak ketiga menyiarkan gred melepasi tarikh akhir.

source: Request user's username
ms_my: Minta nama pengguna pengguna

source: Select True to request the user's username.
ms_my: Pilih Benar untuk meminta nama pengguna pengguna.

source: Request user's full name
ms_my: Minta nama penuh pengguna

source: Select True to request the user's full name.
ms_my: Pilih Benar untuk meminta nama penuh pengguna.

source: Request user's email
ms_my: Minta e-mel pengguna

source: Select True to request the user's email address.
ms_my: Pilih Benar untuk meminta alamat e-mel pengguna.

source: Send extra parameters
ms_my: Hantar parameter tambahan

source: Select True to send the extra parameters, which might contain Personally Identifiable Information. The processors are site-wide, please consult the site administrator if you have any questions.
ms_my: Pilih Benar untuk menghantar parameter tambahan, yang mungkin mengandungi Maklumat Pengenalan Peribadi. Pemproses adalah di seluruh tapak, sila rujuk pentadbir tapak jika anda mempunyai sebarang soalan.

source: Custom Parameters must be a list
ms_my: Parameter Tersuai mestilah senarai

source: The specified LTI ID is not configured in this course's Advanced Settings.
ms_my: ID LTI yang ditentukan tidak dikonfigurasikan dalam Tetapan Lanjutan kursus ini.

source: Could not get user data for current request
ms_my: Tidak dapat mendapatkan data pengguna untuk permintaan semasa

source: Could not get user id for current request
ms_my: Tidak dapat mendapatkan id pengguna untuk permintaan semasa

source: Configuration Stored on XBlock fields
ms_my: Konfigurasi Disimpan pada medan XBlock

source: Configuration Stored on this model
ms_my: Konfigurasi Disimpan pada model ini

source: Configuration Stored on external service
ms_my: Konfigurasi Disimpan pada perkhidmatan luaran

source: LTI configuration data.
ms_my: Data konfigurasi LTI.

source: The URL of the external tool that initiates the launch.
ms_my: URL alat luaran yang memulakan pelancaran.

source: Client key provided by the LTI tool provider.
ms_my: Kunci pelanggan disediakan oleh pembekal alat LTI.

source: Client secret provided by the LTI tool provider.
ms_my: Rahsia pelanggan disediakan oleh pembekal alat LTI.

source: Platform's generated Private key. Keep this value secret.
ms_my: Kunci Peribadi yang dijana oleh platform. Rahsiakan nilai ini.

source: Platform's generated Private key ID
ms_my: ID kunci Peribadi yang dijana oleh platform

source: Platform's generated JWK keyset.
ms_my: Set kekunci JWK yang dihasilkan oleh platform.

source: Client ID used by LTI tool
ms_my: ID Pelanggan yang digunakan oleh alat LTI

source: LTI Configuration stores on XBlock needs a block location set.
ms_my: Simpanan Konfigurasi LTI di XBlock memerlukan set lokasi blok.

source: CONFIG_ON_XBLOCK and CONFIG_EXTERNAL are not supported for LTI 1.3 Proctoring Services.
ms_my: CONFIG_ON_XBLOCK dan CONFIG_EXTERNAL tidak disokong untuk Perkhidmatan Pengawasan LTI 1.3.

source: Invalid LTI configuration.
ms_my: Konfigurasi LTI tidak sah.

source: The selected content type is not supported by Open edX.
ms_my: Jenis kandungan yang dipilih tidak disokong oleh Open edX.

source: You don't have access to save LTI Content Items.
ms_my: Anda tidak mempunyai akses untuk menyimpan Item Kandungan LTI.

source: Please check that you have course staff permissions and double check this block's LTI settings.
ms_my: Sila pastikan anda mempunyai kebenaran kakitangan kursus dan semak semula tetapan LTI blok ini.

source: LTI Deep Linking failed.
ms_my: LTI Deep Linking gagal.

source: The LTI Deep Linking content was successfully saved in the LMS.
ms_my: Kandungan LTI Deep Linking telah berjaya disimpan dalam LMS.

source: You can safely close this page now.
ms_my: Anda boleh menutup halaman ini dengan selamat sekarang.

source: Unauthorized.
ms_my: Tanpa kebenaran.

source: Students don't have permissions to perform LTI Deep Linking configuration launches.
ms_my: Pelajar tidak mempunyai kebenaran untuk melaksanakan pelancaran konfigurasi Pautan Dalam LTI.

source: LTI 1.3 Launches can only be performed from the LMS.
ms_my: LTI 1.3 Pelancaran hanya boleh dilakukan dari LMS.

source: To set up the LTI integration, you need to register the LMS in the tool with the information provided below.
ms_my: Untuk menyediakan penyepaduan LTI, anda perlu mendaftarkan LMS dalam alat dengan maklumat yang diberikan di bawah.

source: Client ID:
ms_my: ID Pelanggan:

source: Deployment ID:
ms_my: ID penempatan:

source: Keyset URL:
ms_my: URL set kekunci:

source: Access Token URL:
ms_my: URL Token Akses:

source: Login URL:
ms_my: URL log masuk:

source: Deep Linking is configured on this tool.
ms_my: Pautan Dalam dikonfigurasikan pada alat ini.

source: The Deep Linking configuration stored is presented below:
ms_my: Konfigurasi Pautan Dalam yang disimpan dibentangkan di bawah:

source: If you run deep linking again, the content above will be replaced.
ms_my: Jika anda menjalankan pautan dalam sekali lagi, kandungan di atas akan diganti.

source: You can configure this tool's content using LTI Deep Linking.
ms_my: Anda boleh mengkonfigurasi kandungan alat ini menggunakan LTI Deep Linking.

source: To do that, make sure the block is published and click the link below:
ms_my: Untuk melakukan itu, pastikan blok itu diterbitkan dan klik pautan di bawah:

source: Deep Linking Launch - Configure tool
ms_my: Pelancaran Pautan Dalam - Konfigurasikan alat

source: Press to Launch
ms_my: Tekan untuk Melancarkan

source: There was an error while launching the LTI tool:
ms_my: Terdapat ralat semasa melancarkan alat LTI:

source: If you're seeing this on a live course, please contact the course staff.
ms_my: Jika anda melihat ini dalam kursus langsung, sila hubungi kakitangan kursus.

source: There was an error while starting your LTI proctored assessment.
ms_my: Terdapat ralat semasa memulakan penilaian terkawal LTI anda.

source: Sending you back to your exam.
ms_my: Menghantar anda kembali ke peperiksaan anda.

source: Return to exam.
ms_my: Kembali ke peperiksaan.

source: Cancel
ms_my: Batal

source: Click OK to have your username, full name, and e-mail address sent to a 3rd party application.
ms_my: Klik OK untuk meminta nama pengguna, nama penuh dan alamat e-mel anda dihantar ke aplikasi pihak ketiga.

source: Click OK to have your username and e-mail address sent to a 3rd party application.
ms_my: Klik OK untuk nama pengguna dan alamat e-mel anda dihantar ke aplikasi pihak ketiga.

source: Click OK to have your username and full name sent to a 3rd party application.
ms_my: Klik OK untuk nama pengguna dan nama penuh anda dihantar ke aplikasi pihak ketiga.

source: Click OK to have your full name and e-mail address sent to a 3rd party application.
ms_my: Klik OK untuk nama penuh dan alamat e-mel anda dihantar ke aplikasi pihak ketiga.

source: Click OK to have your username sent to a 3rd party application.
ms_my: Klik OK untuk meminta nama pengguna anda dihantar ke aplikasi pihak ketiga.

source: Click OK to have your full name sent to a 3rd party application.
ms_my: Klik OK untuk nama penuh anda dihantar ke aplikasi pihak ke-3.

source: Click OK to have your e-mail address sent to a 3rd party application.
ms_my: Klik OK untuk menghantar alamat e-mel anda ke aplikasi pihak ketiga.

source: Click Cancel to return to this page without sending your information.
ms_my: Klik Batal untuk kembali ke halaman ini tanpa menghantar maklumat anda.
