Repository: kelvin5290/openedx-translations
Catalog: translations/platform-plugin-aspects/platform_plugin_aspects/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: Reports
ms_my: Laporan

source: Course Dashboard
ms_my: Papan Pemuka Kursus

source: Individual Learner Dashboard
ms_my: Papan Pemuka Individu Pelajar

source: At-Risk Learners Dashboard
ms_my: Papan Pemuka Pelajar Berisiko

source: Superset is not configured properly. Please contact your system administrator.
ms_my: Superset tidak dikonfigurasikan dengan betul. Sila hubungi pentadbir sistem anda.

source: Superset is only visible to course staff and instructors. Please contact your system administrator.
ms_my: Superset hanya boleh dilihat oleh kakitangan kursus dan pengajar. Sila hubungi pentadbir sistem anda.

source: Unable to fetch Superset guest token, Superset server error {server_response}
ms_my: Tidak dapat mengambil token tetamu Superset, ralat pelayan Superset {server_response}

source: Unable to fetch Superset guest token, mostly likely due to invalid settings.SUPERSET_CONFIG
ms_my: Tidak dapat mengambil token tetamu Superset, kemungkinan besar disebabkan oleh tetapan yang tidak settings.SUPERSET_CONFIG

source: Invalid course id: '{course_id}'
ms_my: Id kursus tidak sah: '{course_id}'

source: Course not found: '{course_id}'
ms_my: Kursus tidak ditemui: '{course_id}'

source: Display name
ms_my: Nama paparan

source: Superset Dashboard
ms_my: Papan Pemuka Superset

source: Dashboard UUID
ms_my: UUID papan pemuka

source: The ID of the dashboard to embed. Available in the Superset embed dashboard UI.
ms_my: ID papan pemuka untuk dibenamkan. Tersedia dalam UI papan pemuka benam Superset.

source: Filters
ms_my: Penapis
