Repository: kelvin5290/openedx-translations
Catalog: translations/FeedbackXBlock/feedback/conf/locale/*/LC_MESSAGES/django.po
Languages: ms_my

source: What did you learn from this? What was missing?
ms_my: Apa yang anda pelajari daripada ini? Apa yang hilang?

source: How would you rate this as a learning experience?
ms_my: Bagaimanakah anda menilai ini sebagai pengalaman pembelajaran?

source: Think about the material, and try to synthesize key lessons learned, as well as key gaps in our presentation.
ms_my: Fikirkan tentang bahan tersebut, dan cuba sintesiskan pelajaran utama yang dipelajari, serta jurang utama dalam pembentangan kami.

source: Take a little bit of time to reflect here. Research shows that a meaningful synthesis will help you better understand and remember material from this course.
ms_my: Luangkan sedikit masa untuk merenung di sini. Penyelidikan menunjukkan bahawa sintesis yang bermakna akan membantu anda lebih memahami dan mengingati bahan daripada kursus ini.

source: Excellent
ms_my: Cemerlang

source: Good
ms_my: bagus

source: Average
ms_my: Purata

source: Fair
ms_my: Adil

source: Poor
ms_my: miskin

source: Freeform user prompt
ms_my: Gesaan pengguna bentuk bebas

source: Random number generated for p. -1 if uninitialized
ms_my: Nombor rawak dijana untuk p. -1 jika tidak dimulakan

source: How user voted. -1 if didn't vote
ms_my: Cara pengguna mengundi. -1 jika tidak mengundi

source: What percent of the time should this show?
ms_my: Berapa peratus masa ini harus ditunjukkan?

source: A list of user votes
ms_my: Senarai undian pengguna

source: Feedback
ms_my: Maklum balas

source: Display Name
ms_my: Nama Paparan

source: Provide Feedback
ms_my: Berikan Maklum Balas

source: Voting message
ms_my: Mesej mengundi

source: Thank you for voting!
ms_my: Terima kasih kerana mengundi!

source: Feedback message
ms_my: Mesej maklum balas

source: Thank you for your feedback!
ms_my: Terima kasih atas maklum balas anda!

source: Show aggregate to students
ms_my: Tunjukkan agregat kepada pelajar

source: Please reflect on this course material
ms_my: Sila renungkan bahan kursus ini

source: Please take time to meaningfully reflect on your experience with this course material.
ms_my: Sila luangkan masa untuk merenung secara bermakna pengalaman anda dengan bahan kursus ini.

source: Please rate your overall experience
ms_my: Sila nilaikan keseluruhan pengalaman anda

source: Please take a moment to thoughtfully reflect.
ms_my: Sila luangkan sedikit masa untuk merenung.

source: Please vote!
ms_my: Tolong undi!

source: Component
ms_my: Komponen

source: Number of ratings
ms_my: Bilangan penilaian

source: Average rating
ms_my: Penilaian purata

source: Feedback
ms_my: Maklum balas

source: Comment
ms_my: Komen

source: Vote
ms_my: Undi

source: No vote
ms_my: Tiada undi

source: Submit Feedback
ms_my: Hantar Maklum Balas

source: This XBlock allows you to collect student feedback on pieces of the course. This may be helpful either for course improvement, or to give students a chance to reflect on what they have done.
ms_my: XBlock ini membolehkan anda mengumpul maklum balas pelajar tentang bahagian kursus. Ini mungkin membantu sama ada untuk penambahbaikan kursus atau memberi peluang kepada pelajar untuk merenung apa yang telah mereka lakukan.

source: Display name
ms_my: Nama paparan

source: The name of the component.
ms_my: Nama komponen.

source: The message to show after user vote.
ms_my: Mesej untuk ditunjukkan selepas undian pengguna.

source: The message to show after user feedback.
ms_my: Mesej untuk ditunjukkan selepas maklum balas pengguna.

source: Show aggregate report to students
ms_my: Tunjukkan laporan agregat kepada pelajar

source: False
ms_my: palsu

source: True
ms_my: betul

source: Whether to show the aggregate report to students.
ms_my: Sama ada mahu menunjukkan laporan agregat kepada pelajar.

source: Freeform prompt
ms_my: Gesaan bentuk bebas

source: Example: Please provide us feedback on this section.
ms_my: Contoh: Sila berikan kami maklum balas tentang bahagian ini.

source: Freeform placeholder
ms_my: Pemegang tempat bentuk bebas

source: This is shown as grayed out text before the student has answered.
ms_my: Ini ditunjukkan sebagai teks berwarna kelabu sebelum pelajar menjawab.

source: Likert icon set
ms_my: Set ikon likert

source: Faces (happy to sad)
ms_my: Muka (gembira ke sedih)

source: Faces (sad to happy)
ms_my: Muka (sedih ke gembira)

source: Numeric
ms_my: angka

source: Stars
ms_my: Bintang

source: We can either show happy/sad faces, numbers 1-5 or stars.
ms_my: Kita boleh sama ada menunjukkan muka gembira/sedih, nombor 1-5 atau bintang.

source: Likert prompt
ms_my: Likert gesaan

source: Example: Please rate your overall experience with this section.
ms_my: Contoh: Sila nilaikan pengalaman keseluruhan anda dengan bahagian ini.

source: Likert option 1
ms_my: Likert pilihan 1

source: Example: Excellent!
ms_my: Contoh: Cemerlang!

source: Likert option 2
ms_my: Pilihan Likert 2

source: Example: Good
ms_my: Contoh: Baik

source: Likert option 3
ms_my: Pilihan Likert 3

source: Example: Average
ms_my: Contoh: Purata

source: Likert option 4
ms_my: Pilihan likert 4

source: Example: Fair
ms_my: Contoh: Adil

source: Likert option 5
ms_my: Likert pilihan 5

source: Example: Poor
ms_my: Contoh: Miskin

source: Save
ms_my: Jimat

source: Cancel
ms_my: Batal
